{
  "uid": 100061,
  "name": "\u0022FabMirror\u0022",
  "description": "Fabback acrylic mirror is a great alternative to traditional glass mirrors. Its superior impact strength and lightweight attributes make this mirror a versatile product that can be used with confidence in many applications around the home. Its shatter resistant properties make it the obvious choice for bath mirrors, home gyms, dressing areas, and even children\u0027s play areas. Because its easily fabricated using common tools it can be used in custom applications such as table tops or cut to match a custom frame to create decorative wall mirrors. Regardless of the project, FABBACK acrylic mirror is a great item for use in any area of your home or office.Up to seventeen times greater impact resistance than glass mirror of equal thicknessLightweight - half the weight of glass mirror of the same size and thicknessCan be easily cut using standard plastic cutters and common tools around the homeEasy to care for using only a mild soap and water mixture and damp soft clothSilver mirror colorMirror must be adheared to a ridgid substrate (i.e. 1/2 in. plywood) before mounting to wall",
  "attributes": [
    {
      "key": "MFG Brand Name",
      "value": "Unbranded"
    },
    {
      "key": "Mirrored",
      "value": "Yes"
    },
    {
      "key": "Non-Glare",
      "value": "No"
    },
    {
      "key": "Product Depth (in.)",
      "value": "0.118"
    },
    {
      "key": "Product Height (in.)",
      "value": "36"
    },
    {
      "key": "Product Length (in.)",
      "value": "24"
    },
    {
      "key": "Product Thickness (in.)",
      "value": "0.118"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "4.02"
    },
    {
      "key": "Product Width (in.)",
      "value": "36"
    },
    {
      "key": "Shatter Resistant",
      "value": "Yes"
    },
    {
      "key": "Sheet Features",
      "value": "Mirrored,Shatter Resistant"
    },
    {
      "key": "Surface Type",
      "value": "Mirror"
    }
  ],
  "isDeleted": false
}