{
  "uid": 100050,
  "name": "1. Hampton Bay Beverly Patio Dining Armchairs with Bare Cushions (2-Pack)",
  "description": "Sit back and relax in comfort and style in these Beverly Patio Dining Armchairs with Bare Cushions (2-Pack) from Hampton Bay. Perfect for a deck, porch, patio or sunroom, the chairs are made with a powder-coated, sturdy and durable rust-resistant, steel-reinforced frame with all-weather resin wicker to help withstand outdoor elements. Inspired by vintage styles, they feature a woven multi-brown wicker finish and include bare seat cushions that can be customized with slipcovers through the Choose Your Own Color option.Part of the Choose Your Own Color program, slipcovers for cushions must be purchased separatelyAll-weather resin wicker crafts a versatile piece for indoor and outdoor useFashioned with a multi-brown wicker finish for a vintage aesthetic in your outdoor living areaNo assembly requiredAll components packed in 1 boxCoordinates with other brown wicker items in the Beverly collection (sold separately)2-year limited frame, fabric and weave warrantyPowder-coated steel frame is durable and rust-resistantMore options available, CLICK HERE to Choose Your Own ColorCustomizable items cannot be returned. Click here to review our return policy for additional information regarding returns\u003Cbr",
  "attributes": [
    {
      "key": "Assembled Depth (in.)",
      "value": "23.60 in"
    },
    {
      "key": "Assembled Height (in.)",
      "value": "34.00 in"
    },
    {
      "key": "Assembled Width (in.)",
      "value": "22.50 in"
    },
    {
      "key": "Assembly Required",
      "value": "No"
    },
    {
      "key": "Care Instructions",
      "value": "Spot Clean"
    },
    {
      "key": "Chair Type",
      "value": "Dining Chair"
    },
    {
      "key": "Collection Name",
      "value": "Beverly"
    },
    {
      "key": "Commercial / Residential",
      "value": "Residential"
    },
    {
      "key": "Cushion Color Family",
      "value": "Unfinished"
    },
    {
      "key": "Cushion Color or Pattern",
      "value": "Bare"
    },
    {
      "key": "Fill Material",
      "value": "Foam"
    },
    {
      "key": "Frame Material",
      "value": "Steel"
    },
    {
      "key": "Frame Primary Finish",
      "value": "Brown"
    },
    {
      "key": "MFG Brand Name",
      "value": "Hampton Bay"
    },
    {
      "key": "Outdoor Living Product Type",
      "value": "Patio Furniture Seating Set"
    },
    {
      "key": "Patio Furniture Features",
      "value": "Arms,Cushions included,Stackable,UV protected,Weather resistant"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "14"
    },
    {
      "key": "Seat Height (in.)",
      "value": "17.5"
    },
    {
      "key": "Weight Capacity (lb.)",
      "value": "200"
    }
  ],
  "isDeleted": false
}