{
  "uid": 100029,
  "name": "DecoArt Whisper Chalky Finish Paint, 1 PT - Pint",
  "description": "Achieving a vintage, time-worn look is simple if you start with the right paint. With Americana DecorChalky Finish paint, creating beautiful home decor and furniture pieces does not require skills or hours of training. Make store-bought pieces or flea market finds look like they came from a European estate sale or a French countryside cottage by using Americana Decor Chalky Finish paint.Ultra-matte sheen that can be quickly customized with different waxes or varnishes that delivers a smooth, soft finish every timeOne coat coverage over most sealed surfaces and base colors - one can covers up to 120 sq. ft.Cleans easily with soap and waterNo need to use primer - reliable adhesion to most surfaces without sanding or using a layer of primerFinal packaging my varyClick Here to learn more about Chalky Finish PaintChalky Finish is also available in the following colorsOnline Price includes Paint Care fee in the following states: CA, CO, CT, MN, OR, RI, VT",
  "attributes": [
    {
      "key": "- Online Price includes Paint Care fee in the following states",
      "value": "CA, CO, CT, MN, OR, RI, VT"
    },
    {
      "key": "Coating Product Category",
      "value": "Paint"
    },
    {
      "key": "Color/Finish",
      "value": "Whisper"
    },
    {
      "key": "Container Size",
      "value": "1 PT-Pint"
    },
    {
      "key": "MFG Brand Name",
      "value": "DecoArt"
    },
    {
      "key": "Paint Product Type",
      "value": "Chalky Finish Paint"
    },
    {
      "key": "Paint/Stain Key Features",
      "value": "Washable"
    },
    {
      "key": "Paint/Stain/Waterproofer Product Type",
      "value": "Specialty Finish/Small Project"
    },
    {
      "key": "RGB Value",
      "value": "255:252:221"
    },
    {
      "key": "Sheen",
      "value": "Flat/Matte"
    },
    {
      "key": "Specialty Finish",
      "value": "Chalk Finish/Matte"
    },
    {
      "key": "Washable",
      "value": "Yes"
    },
    {
      "key": "Waterproof",
      "value": "No"
    }
  ],
  "isDeleted": false
}