{
  "uid": 100068,
  "name": "Rheem Natural Gas Tall Water Heater - Performance Plus 50 Gal.",
  "description": "The Rheem Performance Plus 50 Gal. Natural Gas Tall Water Heater comes with a 40,000 BTU/hour environmentally friendly low NOx burner that provides ample hot water for households with three to five people. The push button ignition system ensures safe and easy startup. Its maintenance free combustion air intake system means there are no filters to clean and replace. The self-diagnostic gas control valve monitors system performance. A premium grade anode rod provides long-lasting tank protection. Factory installed temperature and pressure relief valve and 3/4 in. water connections are included with the water heater for easy installation.California residents:due to requirements from air quality management districts in the state of California, please use the map below to confirm whether you live in an area that requires the purchase of ultra low NOx water heatersDue to ultra low NOx requirements from air quality management districts in the state of California, please confirm that your shipping zip code is not restricted from the use of items that do not meet local qualificationsNatural gas water heater costs less to operate than electric modelsDelivers 84 Gal. of hot water in the first hour9 year limited warranty on tank and parts for your convenience2 year in home labor warranty for peace of mind0.62 energy factor makes this one of the most efficient gas water heaters availableMaintenance free - no filter to clean or replacePush button ignition system simplifies the startup processSelf-diagnostic gas valve monitors system performanceDesigned for easy replacement of your existing water heaterRated for installations up to 8,500 ft.Call 1-855-400-2552 before noon for same-day service in most areas, or Visit our Water Heater Installation page for more information.Meets new 2015 NAECA StandardsCalifornia Residents - See if your county requires water heaters that meet Air Quality Management District Ultra low NOx (ULN) requirements:",
  "attributes": [
    {
      "key": "Application Type",
      "value": "Residential"
    },
    {
      "key": "- California residents",
      "value": "due to requirements from air quality management districts in the state of California, please use the map below to confirm whether you live in an area that requires the purchase of ultra low NOx water heaters"
    },
    {
      "key": "Certifications and Listings",
      "value": "CSA Certified,FVIR Certified"
    },
    {
      "key": "ENERGY STAR Certified",
      "value": "No"
    },
    {
      "key": "Finish Family",
      "value": "Gray"
    },
    {
      "key": "Fuel Type",
      "value": "Gas"
    },
    {
      "key": "Gas Type",
      "value": "Natural Gas"
    },
    {
      "key": "Indoor/Outdoor",
      "value": "Indoor"
    },
    {
      "key": "Maximum Temperature  (F)",
      "value": "160"
    },
    {
      "key": "MFG Brand Name",
      "value": "Rheem"
    },
    {
      "key": "Minimum Temperature (F)",
      "value": "45"
    },
    {
      "key": "Product Depth (in.)",
      "value": "21.5"
    },
    {
      "key": "Product Height (in.)",
      "value": "59.25"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "165"
    },
    {
      "key": "Product Width (in.)",
      "value": "21.5"
    },
    {
      "key": "Recovery Rate at 90F Rise (gallons/hour)",
      "value": "40.4"
    },
    {
      "key": "Tank Capacity (gallons)",
      "value": "50"
    },
    {
      "key": "Tank Valve Size (in.)",
      "value": ".75"
    },
    {
      "key": "Water Connection Location",
      "value": "Top"
    },
    {
      "key": "Water Connection Size (in.)",
      "value": ".75"
    },
    {
      "key": "Water Heater Features",
      "value": "LoNox,Overheat Protection,Pilot Light Window,Pilot Reset Button,Self Cleaning,Temperature Pressure Relief Valve"
    },
    {
      "key": "Water Heater Profile",
      "value": "Tall"
    }
  ],
  "isDeleted": false
}