{
  "uid": 100052,
  "name": "Swim Time Santiago 10 ft. Cantilever Umbrella with Sunbrella",
  "description": "Create your own shaded backyard oasis with this beautiful Santiago 10 ft. Octagonal Umbrella. This large cantilever-style umbrella provides optimal shade coverage without the pole getting in the way of conversation or entertaining. The offset pole design is much more versatile than market style umbrellas, allowing you to move the shade where you need it the most. It is just the right size for next to your pool or spa and is great for shading tables of any size. The canopy tilts to provide shade during the rising or setting sun. The durable 8 rib canopy has a single wind vent at the top to prevent inverting on windy days. The sturdy bronze-colored anodized aluminum pole is finished in a bronze color. A smooth-working crank handle easily opens and closes the umbrella (no ropes or pulleys). The large canopy is made of Sunbrella Acrylic fabric. We recommend this cross-arm umbrella base be weighted down with at least 120 lbs. Base weights sold separately or use 4 patio stones. Pole diameter is 2 in., base measures 35.5 in. x 35.5 in. Sunbrella acrylic canopy backed by 5-year warranty; pole and frame are backed by a 1-year warranty.10 ft. octagon umbrella canopy with single wind ventAnodized aluminum poleRich bronze colored frameSunbrella acrylic canopy backed by 5-year warranty1-year warranty on pole and frameSecure cross arm with base weights (sold separately) or patio stones (not included)",
  "attributes": [
    {
      "key": "Assembled Depth (in.)",
      "value": "126 in"
    },
    {
      "key": "Assembled Height (in.)",
      "value": "99 in"
    },
    {
      "key": "Assembled Width (in.)",
      "value": "120 in"
    },
    {
      "key": "Canopy Color",
      "value": "Beige"
    },
    {
      "key": "Canopy Shape",
      "value": "Octagon"
    },
    {
      "key": "Color Family",
      "value": "Beige"
    },
    {
      "key": "MFG Brand Name",
      "value": "Swim Time"
    },
    {
      "key": "Opening Mechanism",
      "value": "Crank lift system"
    },
    {
      "key": "Outdoor Living Product Type",
      "value": "Patio Umbrella"
    },
    {
      "key": "Patio Furniture Features",
      "value": "Sunbrella fabric,Tiltable,UV protected"
    },
    {
      "key": "Pattern Style",
      "value": "Solid"
    },
    {
      "key": "Pole Color",
      "value": "Bronze"
    },
    {
      "key": "Pole Diameter (in.)",
      "value": "2"
    },
    {
      "key": "Pole Material",
      "value": "Aluminum"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "29"
    },
    {
      "key": "Rib Material",
      "value": "Aluminum"
    },
    {
      "key": "Umbrella Canopy Diameter (ft.)",
      "value": "10"
    },
    {
      "key": "Umbrella Canopy Material",
      "value": "Acrylic"
    },
    {
      "key": "Umbrella Height (in.)",
      "value": "99"
    },
    {
      "key": "Umbrella Type",
      "value": "Cantilever"
    }
  ],
  "isDeleted": false
}