{
  "uid": 100012,
  "name": "Hampton Bay Caramel Bamboo Rollup Shade - 96 in. W",
  "description": "The 96 in. wide Caramel Simple Weave Rollup Bamboo Shade adds a unique casual style to any room. Replace your white window blinds with this versatile natural shade and add warm comforting tones to your decor. This cozy natural shade (also called a bamboo blind or bamboo shade) is composed of natural environmental friendly materials and installs easily with simple hooks. It has a textured caramel finish that complements many hardwood floor and furniture styles, and looks great with a jute or sisal rug. Bamboo flatstick slats are held together by a dark-weave cord, which gently roll up when more sunlight is needed. Textured natural shades are stylishly complementary to coastal, lake, beach, mountain, cottage, or traditional styles of interior decorating. If you plan to use this natural shade outdoors on the porch or deck, you can simply unhook it and bring it indoors easily during the off season if you choose. Shade sizes 60 inch wide and larger roll up for easy lifting. Sizes narrower than 60 in. wide fold up roman style. All sizes install easily with simple hooks.96 in. W x 72 in. LActual Blind Width is 96 in.No deductions are made to this blind - the actual width of this blind is the same as width orderedFor an Inside Mount, fits windows: 96 in. WideFor an Outside mount, order the width of the overall area to be coveredShade provides privacy and the perfect amount of lightShips within 2-3 business daysBamboo slats held by a dark weave cord for warm tones and natural beautyNatural materials may vary slightly in colorRolls up easily when you want to let in additional sunlightInstalls in minutes with the included simple hook hardwareFilters out light for energy-efficient insulationIncludes a 6 in. matching valance, a color coordinated weaving thread and pull cordsDecorating Tip: Add depth and texture to a room by layering textured window shades under curtain panels or cornice boardsDecorating Tip: To make your windows look larger, you can hang this shade outside the molding or up to the ceilingNot sure what size to buy? Click here to download a printable window treatment measuring guide!WARNING: The cords on this product present a potential strangulation hazard. For child safety, consider cordless alternatives or products with inaccessible cords. To access a copy of the warning label, see additional images.",
  "attributes": [
    {
      "key": "Actual Blind/Shade Width (In.)",
      "value": "96"
    },
    {
      "key": "Arched",
      "value": "No"
    },
    {
      "key": "- For an Inside Mount, fits windows",
      "value": "96 in. Wide"
    },
    {
      "key": "- Decorating Tip",
      "value": "Add depth and texture to a room by layering textured window shades under curtain panels or cornice boards"
    },
    {
      "key": "- Decorating Tip",
      "value": "To make your windows look larger, you can hang this shade outside the molding or up to the ceiling"
    },
    {
      "key": "- \u003Cb\u003EWARNING",
      "value": "\u003C/b\u003E The cords on this product present a potential strangulation hazard. For child safety, consider cordless alternatives or products with inaccessible cords. To access a copy of the warning label, see additional images."
    },
    {
      "key": "Certifications and Listings",
      "value": "ANSI Certified"
    },
    {
      "key": "Color Family",
      "value": "Tan"
    },
    {
      "key": "Color/Finish",
      "value": "Caramel"
    },
    {
      "key": "Color/Finish Family",
      "value": "Browns/Tans"
    },
    {
      "key": "Cordless/Corded",
      "value": "Corded"
    },
    {
      "key": "Decor Product Type",
      "value": "Window Treatment"
    },
    {
      "key": "Enclosure Type",
      "value": "No Enclosure"
    },
    {
      "key": "Features",
      "value": "Routless"
    },
    {
      "key": "Fire retardant",
      "value": "No"
    },
    {
      "key": "Front Color",
      "value": "Fruitwood"
    },
    {
      "key": "Hardware Included",
      "value": "Yes"
    },
    {
      "key": "Included",
      "value": "No Additional Items Included"
    },
    {
      "key": "Light Control",
      "value": "Light Filtering"
    },
    {
      "key": "Material",
      "value": "Bamboo"
    },
    {
      "key": "MFG Brand Name",
      "value": "Hampton Bay"
    },
    {
      "key": "Minimum window depth required (in.)",
      "value": "1.75"
    },
    {
      "key": "Mount Type",
      "value": "Inside/Outside"
    },
    {
      "key": "Opening type",
      "value": "Bottom up"
    },
    {
      "key": "Orientation",
      "value": "Horizontal"
    },
    {
      "key": "Pre-Cut Deduction (in.)",
      "value": "0"
    },
    {
      "key": "Pre-Cut or True-to-Size Blind",
      "value": "True-to-Size"
    },
    {
      "key": "Product Depth (in.)",
      "value": "1"
    },
    {
      "key": "Product Height (in.)",
      "value": "72"
    },
    {
      "key": "Product Length (in.)",
      "value": "72"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "9.15"
    },
    {
      "key": "Product Width (in.)",
      "value": "96"
    },
    {
      "key": "Slat/vane width (in.)",
      "value": "96"
    },
    {
      "key": "Stain Resistant",
      "value": "No"
    },
    {
      "key": "Surface",
      "value": "Textured"
    },
    {
      "key": "Washable",
      "value": "No"
    },
    {
      "key": "Width (in) x Length (in)",
      "value": "96 x 72"
    },
    {
      "key": "Window Treatment Product Type",
      "value": "Natural/Woven Roman Blind/Shade"
    }
  ],
  "isDeleted": false
}