{
  "uid": 100094,
  "name": "Ariens Deluxe 28\u0022 Gas Snow Blower with Auto-Turn Steering",
  "description": "The Ariens Deluxe Two-Stage 28 in. Gas Snow Blower offers powerful snow-clearing action. Snow removal is even easier with the new Auto-Turn steering feature. There is no more straining or fumbling with triggers to turn your Sno-Thro around. Auto-Turn is just that - Automatic. The Sno-Thro will turn when and where you want it to, with ultimate traction. It features a 254 cc Ariens AX engine. With a 28 in. clearance width and a 21 in. intake height, this rust-resistant snow blower features an electric ignition button for quick starts, and 205-degree chute rotation with remote deflector control to easily change the height and direction of snow being thrown. The Deluxe Sno-Thro series machines are the most popular and versatile choice to clear walkways and driveways of all sizes to any home or business.254 cc Ariens AX engine offers powerful snow-clearing actionThe new auto-turn steering offers maximum control, precise turning and smooth operation all with no levers or triggers28 in. clearance width and 21 in. intake height make quick work of clearing driveways and patios in minimal passes6 Forward speeds and 2 reverse speeds let you adjust snow throwing to accommodate different conditions14 in. serrated auger handles compacted snow and ice and aggressively pulls it into the blower housing14 in. 3-blade impeller provides the driving force necessary to powerfully discharge the snowHeavy-duty cast iron gear case with alloy steel gears and L-3 synthetic severe-duty gear oil provides continuous reliability and a longer gear life with a 5-year warrantyDual-handle interlock system conveniently frees one hand to allow chute and speed adjustments while maintaining operator safetyExclusive dual belt auger drive system propels snow up and out of the chute powerfully and continually, providing sustained power and longer belt life with minimal to no maintenance or adjustments205-degree, 2.5x ice drill chute with a remote deflector accurately discharges snow up to 50 ft. for enhanced clearing120-Volt electric push-button start provides a quick and easy startLarge, in-dash halogen headlight helps provide extended snow removal time and added safetyHeavy-duty, reversible skid shoes adjust the height of the blower housing to help clear uneven surfacesRust-resistant exterior helps ensure long-term useIncludes a 3 year limited consumer warrantyIn most shipping areas, Ariens offers free white glove delivery service, Sno-Thro will be shipped to your local Ariens authorized servicing dealer, who will complete 100% assembly of unit and perform multi-point inspection prior to home delivery, multi-point inspection includes, operators manual confirmation, set tire pressure, check fluid levels, and file warranty registration informationDisclaimer in qualifying area only - If an Ariens authorized dealer is not in your shipping area, the Sno-Thro will ship mostly assembled, directly to you via regular truck delivery, simple set-up instructions will be included with unit, to confirm White Glove Delivery availability prior to purchasing, call 888-927-4367 option #2Home Depot Protection Plan:",
  "attributes": [
    {
      "key": "Assembled Depth (in.)",
      "value": "55.4 in"
    },
    {
      "key": "Assembled Height (in.)",
      "value": "44.5 in"
    },
    {
      "key": "Assembled Width (in.)",
      "value": "29.9 in"
    },
    {
      "key": "Assembly Required",
      "value": "Yes"
    },
    {
      "key": "Auger diameter (in.)",
      "value": "14"
    },
    {
      "key": "CA (CARB) Compliant",
      "value": "CARB Compliant"
    },
    {
      "key": "Certifications and Listings",
      "value": "No Certifications or Listings"
    },
    {
      "key": "Chute rotation turning radius (Deg)",
      "value": "200"
    },
    {
      "key": "Clearing Surface Type",
      "value": "Gravel/ Paved"
    },
    {
      "key": "Clearing tool included",
      "value": "Yes"
    },
    {
      "key": "Clearing Width (In.)",
      "value": "28 in"
    },
    {
      "key": "Drive System",
      "value": "Disc-O-Matic"
    },
    {
      "key": "Engine Displacement (cc)",
      "value": "254"
    },
    {
      "key": "Engine Make",
      "value": "OEM Branded"
    },
    {
      "key": "Engine torque (ft.-lb.)",
      "value": "12.5"
    },
    {
      "key": "Engine Type",
      "value": "OHV"
    },
    {
      "key": "Fuel tank capacity (gallons)",
      "value": ".725"
    },
    {
      "key": "Ideal Snow Depth (In.)",
      "value": "16"
    },
    {
      "key": "Impeller diameter (in.)",
      "value": "14"
    },
    {
      "key": "Intake height (in.)",
      "value": "21"
    },
    {
      "key": "MFG Brand Name",
      "value": "Ariens"
    },
    {
      "key": "Number of Forward Speeds",
      "value": "6"
    },
    {
      "key": "Number of Reverse Speeds",
      "value": "2"
    },
    {
      "key": "Oil capacity (oz.)",
      "value": "32"
    },
    {
      "key": "Product Depth (in.)",
      "value": "55.4"
    },
    {
      "key": "Product Height (in.)",
      "value": "44.5"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "224"
    },
    {
      "key": "Product Width (in.)",
      "value": "29.9"
    },
    {
      "key": "Recommended Oil type",
      "value": "SAE 5W31"
    },
    {
      "key": "Rust Resistant",
      "value": "Yes"
    },
    {
      "key": "Snow Blower Features",
      "value": "Headlight,Power Steering,Skid Shoes"
    },
    {
      "key": "Snow Blower Usage",
      "value": "Heavy"
    },
    {
      "key": "Snow Equipment Product Type",
      "value": "Two Stage Gas Snow Blower"
    },
    {
      "key": "Start Type",
      "value": "Electric"
    },
    {
      "key": "Terrain",
      "value": "Flat with Obstacles"
    },
    {
      "key": "Tire height (in.)",
      "value": "16"
    },
    {
      "key": "Tire width (in.)",
      "value": "5"
    },
    {
      "key": "Traction",
      "value": "Wheel Drive"
    },
    {
      "key": "Type of Snow",
      "value": "Heavy, Wet"
    }
  ],
  "isDeleted": false
}