{
  "uid": 100021,
  "name": "Rain Bird 1800 Series Pop-Up Sprinkler Head",
  "description": "Installed in parks and backyards across the globe, Rain Bird\u0027s 1800 Series is the #1 selling commercial-grade pop-up sprinkler in the world. Chosen for its reliability, heavy-duty materials and versatility, the 1800 Series offers a broad selection of spray heads for watering shrubs, small lawns and irregularly shaped planting areas. Precision spray heads and nozzles customize your watering system to cover virtually any configuration of lawn or garden - not the sidewalk or driveway. The 1800 Series offers Rain Bird\u0027s patented pop-up mechanism for out-of-sight retraction into the lawn when not in operation. A wide choice of nozzles provides full circle, partial circle coverage or infinite pattern adjustment for optimum head-to-head coverage.Spray distance from 8 ft. to 15 ft.Patented close-in watering for most efficient uniform water coverage, resulting in the elimination of dry brown spotsHeavy-duty stainless-steel spring helps ensure flush retractionPop-up sprinkler head features a top-adjustment screw to adjust the spray distance4 in pop-up heightDual spray technology for water efficiencyReduces water waste in windy conditionsNote: Product may vary by store.",
  "attributes": [
    {
      "key": "Assembled Depth (in.)",
      "value": "6 in"
    },
    {
      "key": "Assembled Height (in.)",
      "value": "2.25 in"
    },
    {
      "key": "Assembled Width (in.)",
      "value": "2.25 in"
    },
    {
      "key": "- Note",
      "value": "Product may vary by store."
    },
    {
      "key": "Color Family",
      "value": "Blacks"
    },
    {
      "key": "Irrigated",
      "value": "Yes"
    },
    {
      "key": "Irrigation System Component",
      "value": "Sprinkler"
    },
    {
      "key": "Maximum Coverage Area (sq ft.)",
      "value": "353"
    },
    {
      "key": "Maximum Spray Distance (ft.)",
      "value": "15"
    },
    {
      "key": "MFG Brand Name",
      "value": "Rain Bird"
    },
    {
      "key": "Pressure Rating",
      "value": "70 psi"
    },
    {
      "key": "Product Diameter (in.)",
      "value": "2.25 in"
    },
    {
      "key": "Retracted Height (in.)",
      "value": "5.9"
    },
    {
      "key": "Retraction Spring",
      "value": "Yes"
    },
    {
      "key": "Riser Required",
      "value": "Yes"
    },
    {
      "key": "Sprinkler Location",
      "value": "Below ground"
    },
    {
      "key": "Sprinkler Type",
      "value": "Pop-Up"
    }
  ],
  "isDeleted": false
}