{
  "uid": 100139,
  "name": "Milwaukee RipGuard Hole Saw Set - 13 Piece",
  "description": "The Milwaukee Hole Dozer Hole Saw features Rip guard, the strongest tooth form in the industry, backed by the Rip guard limited lifetime tooth break warranty. Each tooth is built with more steel behind the cutting edge for added strength. The Rip Guard warranty on tooth breaks is a first for the hole saw industry. The added tooth strength along with 8% cobalt give added life to the teeth, allowing for increased productivity on the jobsite, as well as continued hole quality. The Hole Dozer includes Plug Jack, an all access slot design that allows for full access during plug removal. The Plug Jack gives access lower into the cup for thick material and higher towards the teeth for thin material. With multiple positions to apply leverage and better plug access, Plug Jack increases productivity and eliminates wasted downtime between holes. For fast, tool-free change-outs, use Milwaukee\u0027s universal Quick-Change Arbors. 49-56-7210, 49-56-7240, 49-56-7250 and 49-56-9100.Rip guard, the strongest tooth form in the industryRip guard limited lifetime tooth break warrantyPlug jack, an all access slot design for fast plug removalBi-metal construction with 8% cobalt for increased wear resistance",
  "attributes": [
    {
      "key": "Arbor included",
      "value": "Yes"
    },
    {
      "key": "Bit Material",
      "value": "Bi-Metal"
    },
    {
      "key": "Drill Bit Type",
      "value": "Hole Saw"
    },
    {
      "key": "Drill Bit Type(s) Included",
      "value": "Hole Saw"
    },
    {
      "key": "Individual/Set",
      "value": "Set"
    },
    {
      "key": "Material Cut",
      "value": "Multi-Purpose"
    },
    {
      "key": "MFG Brand Name",
      "value": "Milwaukee"
    },
    {
      "key": "Min Chuck Size Required",
      "value": "3/8 In."
    },
    {
      "key": "Number of Pieces",
      "value": "13"
    },
    {
      "key": "Pilot Bit Included",
      "value": "Yes"
    },
    {
      "key": "Power Tool Product Type",
      "value": "Drill \u0026 Router Bits"
    },
    {
      "key": "Product Depth (in.)",
      "value": "3.5"
    },
    {
      "key": "Product Height (in.)",
      "value": "9"
    },
    {
      "key": "Product Width (in.)",
      "value": "9"
    },
    {
      "key": "Shank Style",
      "value": "3-Flat"
    },
    {
      "key": "Tools Product Type",
      "value": "Power Tool"
    }
  ],
  "isDeleted": false
}