{
  "uid": 100186,
  "name": "Battic Door Insul-Stair R-50 Attic Cover Kit",
  "description": "Battic Door R-50 Attic Stair Cover is an energy-efficient pull down ladder insulating cover. New codes require the attic access to be insulated to the same level as the attic. The kit includes everything you need to cover, seal, and insulate your pull down ladder. The kit includes the rigid box (stair cover), rubber gasket, a reflective shield, and R-50 fiberglass insulation to cover the top of box. Installs easily without tools. Insert the insulation into the reflective shield, and place the stair cover rigid box into the reflective shield covering the insulation. The shield holds the insulation to the box. Additional insulation (not included) may be added to the sides, or insulate the attic up to the sides of the stair cover kit. The stair cover fits between trusses. Available in 3 sizes to fit most any size or brand of pull down ladder: 22 in. x 54 in., 25 in. x 54 in. and 30 in. x 54 in. Also available without insulation (installer may add their own insulation to desired level).New codes require the attic access pull down ladder be insulated to the same level as the attic floor (minimum R-30), unless insulated to a minimum of R-30, attic ladders do not meet codeKit includes a stair cover box sized to fit perfectly onto the frame of your wood or aluminum pull down ladderStair cover kit weighs about 10 lbs. and rests on a rubber gasket to provide an air sealStair cover box is covered with reflective aluminum foil wrap that reflects attic heat and creates a large pocket over the box that is filled with R-50 fiberglass insulationAdditional insulation (not included) may be added to the sides of the box (space permitting), or insulate the attic up the sides of the stair cover kitDurable stair cover box is made of white heavy duty corrugated board, ends are 3 layers thick for strength and durabilityEasy to install - the kit assembles in minutes without toolsPremium R-50 fiberglass is pre-cut and included to cover the top of the stair cover boxStair cover box is 13 in. deep and fits most any brand of wood or aluminum 25 in. x 54 in. size attic stairsInterior dimensions of box are 24 in. x 52 in.How to measure: Measure the hinged plywood door, if 24 in. W x 52 in. L this is the correct kit, other size kits are available for other size stairsStair cover will rest on the 3/4 in. W frame of the ladder, not on the top of joists or attic floorTo enter attic climb ladder and push stair cover out of the way, the stair cover is not connected or hinged, when leaving attic lower box back into position, ladder folds up inside of box",
  "attributes": [
    {
      "key": "- How to measure",
      "value": "Measure the hinged plywood door, if 24 in. W x 52 in. L this is the correct kit, other size kits are available for other size stairs"
    },
    {
      "key": "ENERGY STAR Certified",
      "value": "Yes"
    },
    {
      "key": "Insulation Type",
      "value": "Accessory"
    },
    {
      "key": "MFG Brand Name",
      "value": "Battic Door Energy Conservation Products"
    },
    {
      "key": "Product Depth (in.)",
      "value": "52"
    },
    {
      "key": "Product Height (in.)",
      "value": "24"
    },
    {
      "key": "Product Width (in.)",
      "value": "24"
    }
  ],
  "isDeleted": false
}