{
  "uid": 100129,
  "name": "Sundstrom Safety AirGuard P100 Respirator Mask",
  "description": "The SR 100 half mask Air Purifying Respirator is intended for use when maximum safety and breathing comfort are required. The heat-treated silicone material is FDA and BGA approved offering a safe and comfortable fit that molds to the shape of your face. Extremely low breathing resistance makes this mask optimal for low to strenuous work activates.A unique face seal design providing a high protection factorAlso available in small/medium, filters and cartridges are not includedCupped face seal accommodating various face shapes and sizesdouble exhalation valve design providing only half the breathing resistance of competitive respiratorscan be used with our P100 filter and / or a range of chemical cartridges which can be \u0022piggy-Face piece is made of heat treated silicone with minimal risk of contact allergiesplastic components are made of high quality nylon plasticEasily adjustable V-shaped elastic head harness with a large crown platelatex free quick and easy donning and doffing procedureMeets and exceeds NIOSH standards for air purifying respiratorsMachine washable at 104 degrees F",
  "attributes": [
    {
      "key": "Certifications and Listings",
      "value": "OSHA Compliant"
    },
    {
      "key": "MFG Brand Name",
      "value": "Sundstrom Safety"
    },
    {
      "key": "NIOSH classification",
      "value": "P 100"
    },
    {
      "key": "Paint Product Type",
      "value": "Respirators and Dust Masks"
    },
    {
      "key": "Product Depth (in.)",
      "value": "3.5"
    },
    {
      "key": "Product Height (in.)",
      "value": "6"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "0.5"
    },
    {
      "key": "Product Width (in.)",
      "value": "5"
    },
    {
      "key": "Quantity per package",
      "value": "1"
    },
    {
      "key": "Quick release",
      "value": "No"
    },
    {
      "key": "Respirator type",
      "value": "Combination"
    },
    {
      "key": "Safety \u0026 Accessories Product Type",
      "value": "Respirators"
    },
    {
      "key": "Type",
      "value": "Half face mask"
    }
  ],
  "isDeleted": false
}