{
  "uid": 100151,
  "name": "\u0022Commercial Electric EasyMount LED Utility Light\u0022",
  "description": "7 in. LED Easy Utility Light. Fastest and easiest fixture in the world to mount. Designed to simply screw into most existing plastic and porcelain lamp holders without any wiring required. Comes complete with a hardware kit to also direct wire into a junction box if desired. Converts your lamp holder to a fixture in less than 15 seconds. Great for hallways, bedrooms, closets, bathrooms, stairways, basements, garages, porches and any other area where a high quality LED light source is required. Lasts up to 35,000 hours. Patent pending. Daylight color temperature.11.5-Watt equal to 60-Watt light output, save up to $187 dollars a year over the life of the fixtureComes with a medium socket built into the base for easy installation; also comes with a direct wire installation kit for a direct replacement of any existing light fixtureItem can be installed in any keyless light socket UL rated and approved for both damp and dry locationsProduct can directly replace an existing light bulb currently in an exposed lamp holder; the installation is very simple and takes only 10 seconds or less5 year warranty easy installationADA compliant-meets the American disability act standard extension requirementsHome Depot Protection Plan:",
  "attributes": [
    {
      "key": "Certifications and Listings",
      "value": "1-UL Listed,ADA Compliant,DOT Rated,FCC Listed,cUL Listed"
    },
    {
      "key": "ENERGY STAR Certified",
      "value": "No"
    },
    {
      "key": "Fixture Color/Finish",
      "value": "White Housing and Lens"
    },
    {
      "key": "Fixture Color/Finish Family",
      "value": "White"
    },
    {
      "key": "Hardware Included",
      "value": "Yes"
    },
    {
      "key": "Maximum Wattage (watts)",
      "value": "0"
    },
    {
      "key": "MFG Brand Name",
      "value": "Commercial Electric"
    },
    {
      "key": "Number of Bulbs Required",
      "value": "0"
    },
    {
      "key": "Product Depth (in.)",
      "value": "7.00 in"
    },
    {
      "key": "Product Height (in.)",
      "value": "3.50 in"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "1.2"
    },
    {
      "key": "Product Width (in.)",
      "value": "7.00 in"
    },
    {
      "key": "Shade Color Family",
      "value": "White"
    },
    {
      "key": "Shade Material",
      "value": "Acrylic"
    }
  ],
  "isDeleted": false
}