{
  "uid": 100130,
  "name": "Terro Outdoor Ant Bait Stakes - Ready-to-use, weatherproof, with borax",
  "description": "TERRO Outdoor Liquid Ant Bait Stakes attract and kill all common household ants, including Argentine ants, ghost ants, cornfield ants, pavement ants, acrobat ants, white footed ants, little black ants, odorous house ants and other sweet eating ants. To kill the ants you see and the ants you don\u0027t, simply place the pre-filled liquid bait stakes outdoors in areas where ants are observed.  Ants typically follow defined trails from the nest to food or water.  Placing the outdoor stakes close to these trails will improve control. While the active ingredient in TERRO Outdoor Liquid Ant Bait Stakes will ultimately kill the worker ant, it works slowly to allow worker ants to consume the product and survive long enough to carry the liquid back to the nest and deliver a dose to the rest of the colony. The key to obtaining effective control is to monitor the placements and ensure there is always a fresh supply of TERRO. Depending on the size of the infestation, complete control may take up to two weeks. The patented TERRO Outdoor Liquid Ant Bait Stakes feature reinforced stake ridges that provide increased strength when placed in the ground. A see-through window makes it easy to monitor the bait level so you know when it\u0027s time to replace the stake. The tiered bait pack increases bait consumption and reduces waste. Along with these features, the liquid ant bait inside the stake offers ants both a food and water source.Kills ants outside before they get insidePre-filled bait stations are ready-to-useContains boraxKills the ants you see and the ants you don\u0027tWeatherproof station protects the bait from the elements, prevents it from drying out",
  "attributes": [
    {
      "key": "Application Type",
      "value": "Bait"
    },
    {
      "key": "Concentrated or Ready to Use",
      "value": "Ready to use"
    },
    {
      "key": "Indoor/Outdoor",
      "value": "Outdoor"
    },
    {
      "key": "MFG Brand Name",
      "value": "Terro"
    },
    {
      "key": "Organic",
      "value": "No"
    },
    {
      "key": "Pest Type",
      "value": "Ants"
    },
    {
      "key": "Product Depth (in.)",
      "value": "4.5 in"
    },
    {
      "key": "Product Height (in.)",
      "value": "7.75 in"
    },
    {
      "key": "Product Width (in.)",
      "value": "2.75 in"
    },
    {
      "key": "Safe for Edibles",
      "value": "Yes"
    },
    {
      "key": "Safe for Pets",
      "value": "No"
    }
  ],
  "isDeleted": false
}