{
  "uid": 100155,
  "name": "Backyard X-Scapes Bamboo Fence Panel - Mahogany Stain",
  "description": "Backyard X-Scapes, Inc. uses the finest bamboo canes from the Anji Mountain located in China to manufacturer their bamboo fencing. Their bamboo fencing goes through a rigorous process to ensure that its customers will be receiving a quality bamboo product. Held together by galvanized steel wires and cut to cap off the top, its construction give consumers the ability to easily install each panel. With additional hardware and supplies, the versatility of these panels can range from gates, to doors, additive shades for roofs, or just as an accent. Why not use this economical friendly resource to help enhance your indoor and/or outdoor appearance.Approx Size: 1 in. D x 6 ft. H x 8 ft. LColor: Stained MahoganyApprox. weight: 70 lbsTreatment: Fencing is not treated. Always apply a good quality; oil based UV-resistant wood sealant using a brush for best applicationApprox. 1 in.  diameter, stained mahogany color",
  "attributes": [
    {
      "key": "- Approx Size",
      "value": "1 in. D x 6 ft. H x 8 ft. L"
    },
    {
      "key": "- Color",
      "value": "Stained Mahogany"
    },
    {
      "key": "- Approx. weight",
      "value": "70 lbs"
    },
    {
      "key": "- Treatment",
      "value": "Fencing is not treated. Always apply a good quality; oil based UV-resistant wood sealant using a brush for best application"
    },
    {
      "key": "Color Family",
      "value": "Red"
    },
    {
      "key": "Color/Finish",
      "value": "Stained Mahogany"
    },
    {
      "key": "Fence Application",
      "value": "Decorative,Garden,Privacy"
    },
    {
      "key": "Garden Fencing Type",
      "value": "Split Bamboo Fence"
    },
    {
      "key": "Landscape Supply Type",
      "value": "Garden Fencing"
    },
    {
      "key": "Material",
      "value": "Bamboo"
    },
    {
      "key": "MFG Brand Name",
      "value": "Backyard X-Scapes"
    },
    {
      "key": "Package Quantity",
      "value": "1"
    },
    {
      "key": "Product Depth (in.)",
      "value": "1"
    },
    {
      "key": "Product Height (in.)",
      "value": "72"
    },
    {
      "key": "Product Width (in.)",
      "value": "96"
    }
  ],
  "isDeleted": false
}