{
  "uid": 100149,
  "name": "MARAZZI Gunstock Wood Porcelain Tile - 6x24, 15pc Case",
  "description": "Montagna Gunstock is a hand scraped wood plank on a porcelain body. The porcelain body allows you to have the look of wood with the durability of porcelain. Unlike conventional wood planks, these porcelain wood planks are not affected by seasonal changes, where the joints expand and contract. Long gone are the days of waxing, staining and sanding.14.53 square feet, 15 pieces per case. Case weight is 50 lb.Grade 1, first-quality porcelain tile for floor, wall and countertop use6 in. width x 24 in. length x 9 mm thickGlazed textured matte finish with a medium sheen and slight variation in toneP.E.I. Rating IV has high resistance to abrasion and is suitable for heavy-duty residential and commercial floor installations such as entrances, commercial kitchens, hotels, exhibition and sales rooms with some dirt conditionsImpervious flooring has water absorption of less than 0.5% for indoor or outdoor use and is frost proofC.O.F. greater than .60 to .79 is required for commercial applications to meet or exceed ADA (Americans with Disabilities Act) Guidelines. Skid Resistant. Indoor and outdoor useCompletely frost resistant for indoor or outdoor applications; use a latex modified thinset for acceptable bond strengthResidential and commercial useLearn how to get a Lifetime Warranty by using Custom Building Products from The Home Depot. Visit www.homedepot.com/CBPDon\u0027t forget your coordinating trim pieces, grout, backerboard, thinset and installation toolsAll online orders for this item ship via parcel ground and may arrive in multiple boxesIt is recommended you purchase a minimum of 10% overage to account for design cuts and patterns",
  "attributes": [
    {
      "key": "Approximate Tile Size",
      "value": "6x24"
    },
    {
      "key": "Break Strength (lb.)",
      "value": "276"
    },
    {
      "key": "Color Family",
      "value": "Browns / Tans"
    },
    {
      "key": "Color/Finish",
      "value": "Browns"
    },
    {
      "key": "Commercial / Residential",
      "value": "Commercial / Residential"
    },
    {
      "key": "Exact Dry SCOF Rating",
      "value": ".72"
    },
    {
      "key": "Exact Wet SCOF Rating",
      "value": ".52"
    },
    {
      "key": "Flooring Product Type",
      "value": "Porcelain Tile"
    },
    {
      "key": "Glazed",
      "value": "Yes"
    },
    {
      "key": "Indoor/Outdoor",
      "value": "Indoor/Outdoor"
    },
    {
      "key": "MFG Brand Name",
      "value": "MARAZZI"
    },
    {
      "key": "Number of Tiles per Case",
      "value": "15"
    },
    {
      "key": "Product Length (in.)",
      "value": "24 in"
    },
    {
      "key": "Product Thickness (mm)",
      "value": "9"
    },
    {
      "key": "Product Width (in.)",
      "value": "6 in"
    },
    {
      "key": "Style Type",
      "value": "Wood Grain"
    },
    {
      "key": "Suggested Grout Line Size",
      "value": "3/16"
    },
    {
      "key": "Tile Features",
      "value": "Chemical Resistant,Frost Resistant,Glazed,Meets A.D.A. Requirements"
    },
    {
      "key": "Tile Finish",
      "value": "Matte"
    },
    {
      "key": "Tile Material",
      "value": "Porcelain"
    },
    {
      "key": "Tile Use",
      "value": "Accent Wall,Bath Wall,Bath floor,Bedroom Floor,Countertop,Entry Way,Exterior Wall,Fireplace Facade,Hallway Floor,Kitchen Floor,Living Room Floor,Shower Wall,Shower floor"
    }
  ],
  "isDeleted": false
}