{
  "uid": 100169,
  "name": "Samsung Extra-Large Gas Dryer with Steam and Sanitize Cycle",
  "description": "The Samsung 7.4 cu. ft. Extra-Large Capacity Gas Dryer with steam freshens clothes and removes wrinkles. It automatically adjusts drying time by sensing moisture so your clothes don\u0027t over or under dry. The NSF certified sanitize cycle eliminates 99.9% of household bacteria from laundry. The extra-large capacity is big enough to handle a king-size comforter.7.4 cu. ft. capacity is big enough to handle a king-size comforter11 cycles including Refresh, Steam Sanitize, Wrinkle Away, Normal, Eco Normal, Heavy Duty, Towels, Perm Press, Bedding, Delicates, Wool and Active WearPowder coated drum prevents rust and protects clothes from damageRear panel controls for easy access and operationSteam Sanitize and Wrinkle Away eliminate the need to iron and refreshes clothing so you do not have to wash as often and save money by going to the dry cleaners less often5 temperature settings provide the proper heat for different fabric types to ensure that clothes are not overdriedSensor Dry determines the moisture level in your clothes and sets the ideal drying time providing additional energy savings by not overdryingThe Wrinkle Prevent Option reduces ironing time and intermittently tumbles clothes at the end of the cycle to help prevent wrinkles from setting inEnd-of-cycle signal provides an audible alert that the dryer cycle is finishedEco Dry option saves you money while still getting your clothes dry in a timely mannerInternal drum light makes it easy to load and unloadDryer rack lets you carefully dry your most delicate itemsStylish exterior with LED control panelSanitize Cycle provides peace of mind with NSF certified sanitization. Eliminates 99.9% of household bacteria from laundryWarranty: One (1) Year All Parts and Labor, Two (2) Years Control BoardDryer Duct and electrical cords are required for installation and will be offered separately during appliance checkoutClick Here for details on the services included with Delivery \u0026 Basic Hook-up and Installation options for Major Appliances",
  "attributes": [
    {
      "key": "Appliance Type",
      "value": "Gas Dryer"
    },
    {
      "key": "- Warranty",
      "value": "One (1) Year All Parts and Labor, Two (2) Years Control Board"
    },
    {
      "key": "Capacity - Dryer (cu. ft.)",
      "value": "7.4"
    },
    {
      "key": "Certifications and Listings",
      "value": "1-UL Listed,CSA Certified,NSF Listed"
    },
    {
      "key": "Color/Finish",
      "value": "White"
    },
    {
      "key": "Color/Finish Family",
      "value": "White"
    },
    {
      "key": "Control Type",
      "value": "Electronic"
    },
    {
      "key": "Depth With Door Open 90 Degrees (In)",
      "value": "50.8"
    },
    {
      "key": "Door Opening Height (In.)",
      "value": "46"
    },
    {
      "key": "Door Opening Width (In.)",
      "value": "27"
    },
    {
      "key": "Door Style",
      "value": "Reversible"
    },
    {
      "key": "Dry Cycles",
      "value": "Delicates,Heavy Duty,Permanent Press,Speed Dry"
    },
    {
      "key": "Dryer Drum Material",
      "value": "Powder-Coated Steel"
    },
    {
      "key": "Dryer Features",
      "value": "Automatic Temperature Control,Cycle Time Remaining Display,Delay Start,Door Window,End-Of-Cycle Signal,Four-Way Venting,Front Control,Interior Light,Lint Filter,Moisture Sensor,Rack,Sensor Dry,Steam Function,Timed Dry"
    },
    {
      "key": "Exhaust Vent Location",
      "value": "Bottom,Left Side,Rear,Right Side"
    },
    {
      "key": "Included Items",
      "value": "No Additional Items Included"
    },
    {
      "key": "Lint Filter Location",
      "value": "Front"
    },
    {
      "key": "Matching Washer Type",
      "value": "Top Load"
    },
    {
      "key": "MFG Brand Name",
      "value": "Samsung"
    },
    {
      "key": "Number of Drying Cycles",
      "value": "11"
    },
    {
      "key": "Number of Drying Temperatures",
      "value": "5"
    },
    {
      "key": "Product Depth (in.)",
      "value": "30"
    },
    {
      "key": "Product Height (in.)",
      "value": "44.25"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "128"
    },
    {
      "key": "Product Width (in.)",
      "value": "27"
    },
    {
      "key": "Stackable",
      "value": "No"
    },
    {
      "key": "Steam Function",
      "value": "Yes"
    },
    {
      "key": "Voltage (volts)",
      "value": "240"
    }
  ],
  "isDeleted": false
}