{
  "uid": 100100,
  "name": "1. Dimex Aluminum Edging",
  "description": "The EasyFlex Aluminum Landscape Edging by Dimex is the perfect choice for homeowners and contractors alike, offering professional grade quality. Its name speaks for itself with easy installation; simply slide the ends of the material together with an approximate 4 in. overlap, insert the provided spikes at a 45 angle and enjoy a permanent and virtually maintenance-free solution to the infamous curb appeal dilemma.  EasyFlex will not rust, rot or become brittle like other edgings, and straight runs or curves can be created with ease. It is made from recycled material, is non-toxic, has excellent corrosion resistance and is all-around environmentally friendly. This set is available in a variety of colors including silver, black, brown, bronze and green. Applications include landscape beds, tree rings, walkways and pathways, brick or stone patios, gardens, drip edges and more.Easy sliding installationWill not rust, rot, crack or become brittleCreates straight runs or curves with easePermanent and virtually maintenance freeMade from recycled materialLimited lifetime warranty against manufacturers defectsApplications include landscape beds, tree rings, walkways and pathways, brick or stone patio gardens, drip edgesEasy-to-install aluminum lawn edging and landscape border",
  "attributes": [
    {
      "key": "Attachable",
      "value": "Yes"
    },
    {
      "key": "Color Family",
      "value": "Black"
    },
    {
      "key": "Color/Finish",
      "value": "Black"
    },
    {
      "key": "Hardware Included",
      "value": "Yes"
    },
    {
      "key": "Landscape Supply Type",
      "value": "Non Concrete Edging"
    },
    {
      "key": "Material",
      "value": "Aluminum"
    },
    {
      "key": "MFG Brand Name",
      "value": "Dimex"
    },
    {
      "key": "Package Quantity",
      "value": "1"
    },
    {
      "key": "Product Depth (in.)",
      "value": "0.125"
    },
    {
      "key": "Product Height (in.)",
      "value": "4"
    },
    {
      "key": "Product Width (in.)",
      "value": "288"
    },
    {
      "key": "Width",
      "value": ".125 in"
    }
  ],
  "isDeleted": false
}