{
  "uid": 100183,
  "name": "Feather River Doors Sapphire Fiberglass Double Door - Patina Caming",
  "description": "Feather River Doors Sapphire 3/4 Oval is a Smooth Fiberglass Double Door with Patina Caming that is ready to paint. This door can be painted any color to match your homes decor. The Sapphire Collection has an elegant clear bevel center design with patina caming accented with glue chip and granite glass. This door has all the long lasting benefits associated with Fiberglass Doors, a great look, along with a load of Features and Benefits usually viewed as upgrades with other doors plus Energy Efficient and Energy Star Qualified. Door Spec: 72 in. x 80 in. Prehung Double Door with White Aluminum Astragal, 4-9/16 in. Primed Jamb, Right Hand Inswing, Double Bored Active and Inactive Door-Panels, Fits Rough Opening of 74-3/4 in. x 82-1/8 in.California residents: see\u0026nbsp;Proposition 65 informationFiberglass construction resists denting, rusting and rotting for durability in the elementsPolyurethane foam core provides energy-efficient insulationComposite adjustable threshold and compression weather-strip help to prevent air and water infiltrationSill-to-jamb kit and bottom door rail provide resistance to exterior jamb and door rotMatching glass caming, sill and hinge finish add a stylish accentElegant clear bevel center design with patina caming accented with glue chip and granite glassSmooth white surface with high-definition panel embossments can be painted to match your decorEnergy Star qualified to meet or exceed federal guidelines for energy efficiency for year-round energy and money savingsBall bearing hinges offer smooth operation and help to prevent door sagging and hinge wearTriple-pane glass with patina caming is insulated and tempered for energy efficiency and safetyFrom outside, open towards the inside of the home with the hinges on the rightRequires a 74-3/4 in. x 82-1/8 in. rough opening for a secure fitClick here to design your custom door today!",
  "attributes": [
    {
      "key": "Color Family",
      "value": "White"
    },
    {
      "key": "Color/Finish",
      "value": "Smooth White: Ready to Paint"
    },
    {
      "key": "Door Configuration",
      "value": "Double Door"
    },
    {
      "key": "Door Handing",
      "value": "Right-Hand/Inswing"
    },
    {
      "key": "Door Size (WxH) in.",
      "value": "74 x 82"
    },
    {
      "key": "Door Style",
      "value": "Classic,Mediterranean,Midcentury,Modern"
    },
    {
      "key": "Door Thickness (in.)",
      "value": "1.75 in"
    },
    {
      "key": "Door Type",
      "value": "Exterior Prehung"
    },
    {
      "key": "Energy Star Qualified",
      "value": "North-Central,Northern,South-Central,Southern"
    },
    {
      "key": "Features",
      "value": "Brickmould,Lockset Bore,Weatherstripping"
    },
    {
      "key": "Finish Type",
      "value": "Unfinished"
    },
    {
      "key": "Fire rating",
      "value": "nan"
    },
    {
      "key": "Glass Caming Finish",
      "value": "Patina"
    },
    {
      "key": "Glass Style",
      "value": "Decorative"
    },
    {
      "key": "Glass Type",
      "value": "3/4 Oval"
    },
    {
      "key": "Hinge Finish",
      "value": "Patina"
    },
    {
      "key": "Included",
      "value": "No additional items or accessories included"
    },
    {
      "key": "Jamb Size (in.)",
      "value": "4-9/16\u0022"
    },
    {
      "key": "Material",
      "value": "Fiberglass"
    },
    {
      "key": "MFG Brand Name",
      "value": "Feather River Doors"
    },
    {
      "key": "Number of Hinges",
      "value": "3"
    },
    {
      "key": "Panel Type",
      "value": "3 Panel"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "172"
    },
    {
      "key": "Rough Opening Height",
      "value": "82.125 in"
    },
    {
      "key": "Rough Opening Width",
      "value": "74.75 in"
    }
  ],
  "isDeleted": false
}