{
  "uid": 100135,
  "name": "Pelican Premium Carbon Whole House Water Filter System",
  "description": "The PC600 Pelican Premium 10 GPM Whole House Carbon Water Filter System For Homes With 1-3 Bathrooms is a deluxe, high-capacity, virtually maintenance-free system that is easily installed in any home and has a 600,000/5-year capacity. Only the top rated valves and tanks are used in manufacturing each Pelican system, backed by an industry-leading limited lifetime parts warranty. Imagine spring-like water through every faucet of your home. Drink, bathe and shower in sparkling clean water with no more dry itchy skin or unpleasant odors from chemicals. The large diameter of the tank holds a significant amount of water filtration carbon media, increasing the overall performance and lifespan, and the replacement cost is a fraction of the cost of similar items. When it comes time to replace the filter, all you have to do is replace the media inside the tank, with no plumbing required and no need to replace the entire tank.Wrapped in premium stainless steel to ensure long life, durability and unsurpassed qualityPelican Carbon series filter features preloaded design that makes it ready to install, minimizes steps and saves timeMinimal filter/media change with the sediment pre-filter every six to nine months; tank 1 media every five years or 1,000,000 gallons; tank 2 media is lifetime media that needs no replacementIncludes sediment pre-filter system with mounting hardwareBacterial static media inhibits bacterial growthEnergy efficient; does not waste water and requires no electricity",
  "attributes": [
    {
      "key": "Bypass valve",
      "value": "Yes"
    },
    {
      "key": "Certifications and Listings",
      "value": "ANSI Certified,NSF Listed"
    },
    {
      "key": "Color/Finish",
      "value": "Metallic"
    },
    {
      "key": "Filter change indicator",
      "value": "No"
    },
    {
      "key": "Filtration method",
      "value": "GAC Carbon"
    },
    {
      "key": "Fitting size (in.)",
      "value": "1"
    },
    {
      "key": "Fitting style",
      "value": "Threaded"
    },
    {
      "key": "Hardware Included",
      "value": "Yes"
    },
    {
      "key": "Installation kit included",
      "value": "Yes"
    },
    {
      "key": "Maximum feed water pressure (psi)",
      "value": "80"
    },
    {
      "key": "Maximum feed water temperature (F)",
      "value": "120"
    },
    {
      "key": "Maximum filtered water flow (gallons per min.)",
      "value": "10"
    },
    {
      "key": "MFG Brand Name",
      "value": "Pelican Water"
    },
    {
      "key": "Minimum feed water pressure (psi)",
      "value": "25"
    },
    {
      "key": "Minimum feed water temperature (F)",
      "value": "36"
    },
    {
      "key": "Number of stages",
      "value": "4"
    },
    {
      "key": "Product Depth (in.)",
      "value": "18"
    },
    {
      "key": "Product Height (in.)",
      "value": "49.5"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "21"
    },
    {
      "key": "Product Width (in.)",
      "value": "18"
    },
    {
      "key": "UV lamp",
      "value": "No"
    },
    {
      "key": "Water Filtration System Type",
      "value": "Whole House"
    },
    {
      "key": "Water Filtration Technology",
      "value": "Carbon"
    }
  ],
  "isDeleted": false
}