{
  "uid": 100162,
  "name": "Husky MagnumAir 3.5in Framing Nailer, Lightweight, Adjustable Exhaust",
  "description": "This Husky Pneumatic 3-1/2 in. 21 Full Head Framing Nailer is made of Die-cast magnesium for lightweight usability on a variety of projects. The tool-free design lets you easily adjust the nail depth and 360 exhaust port. It is an excellent lightweight option for driving 2 - 3 1/2 in. plastic-collated nails in projects such as framing, sheathing, remodeling and outdoor work. A dust cap and internal air filter keep the nailer free from debris for smooth, clean operation. The driving mechanism is constructed to prevent dry firing.Easy-load magazine features simple pull-back pusherNo-mar tipSwitch allows for quick transitions between sequential and contact nailingTool-free depth adjustmentAnti-dry fire system helps protect tool and operatorGreat for framing, sheathing, remodeling, deck work and outdoor projectsConforming rubber grip for operator comfortDust cap and internal air filter for clean operationLightweight magnesium constructionDrives 2 - 3-1/2 in. nails360 adjustable exhaust2 year limited warrantyFraming Nailer weight is 8.16 lb.Need help? CLICK HERE to view our Nail Gun Buying GuideHome Depot Protection Plan:",
  "attributes": [
    {
      "key": "Air Tool Type",
      "value": "Air Nailer"
    },
    {
      "key": "Compressor/Air Tool Features",
      "value": "Adjustable Exhaust Port,Fastener Depth Control"
    },
    {
      "key": "Energy Type",
      "value": "Air"
    },
    {
      "key": "Included",
      "value": "No additional components or accessories are included"
    },
    {
      "key": "Loading type",
      "value": "Strip"
    },
    {
      "key": "Maximum Fastener Size",
      "value": "3-1/2 in"
    },
    {
      "key": "MFG Brand Name",
      "value": "Husky"
    },
    {
      "key": "Minimum Fastener Size",
      "value": "2 in"
    },
    {
      "key": "Minimum Recommended Air Delivery SCFM @ 90PSI",
      "value": "2.4"
    },
    {
      "key": "Minimum Recommended Operating Pressure (psi)",
      "value": "70"
    },
    {
      "key": "Nail Gauge",
      "value": "10"
    },
    {
      "key": "Nailgun Angle",
      "value": "21"
    },
    {
      "key": "Product Depth (in.)",
      "value": "5.38"
    },
    {
      "key": "Product Height (in.)",
      "value": "15.13"
    },
    {
      "key": "Product Width (in.)",
      "value": "21.63"
    },
    {
      "key": "Reconditioned",
      "value": "No"
    },
    {
      "key": "Tools Product Type",
      "value": "Air Tool"
    }
  ],
  "isDeleted": false
}