{
  "uid": 100286,
  "name": "Werner Energy Seal Attic Ladder",
  "description": "The Werner Energy Seal Aluminum Attic Ladder delivers five times more energy efficiency than a traditional attic ladder with its insulated door and weather-stripping that offer energy saving benefits. An innovative air locking design creates a tight seal, reducing drafts and air leakage up to 60%. The ladder offers a universal fit for homes with ceiling heights 8-10 ft., designed for attic openings 22.5 in. x 54 in. Lightweight aluminum construction boasts a 375 lb. load capacity, while gas struts ensure smooth, easy door opening. Installation is simple with the easy-to-follow online instruction video.Aluminum construction offers lightweight durabilityReduces drafts to conserve energySealed opening provides 60% reduction in air leakageInsulated door provides five times more energy efficiency for your home compared to standard attic laddersQuiet struts for easy opening and closing375 lb. load capacity provides ample support for transporting items to and from the atticFits ceiling heights 7 ft. 8 in. to 10 ft. 3 in.ANSI and OSHA compliant for safetyFits ceiling heights 7\u00278\u0022 to 10\u00273\u0022",
  "attributes": [
    {
      "key": "Certifications and Listings",
      "value": "OSHA Compliant"
    },
    {
      "key": "Finish Type",
      "value": "Unfinished"
    },
    {
      "key": "Ladder Rating",
      "value": "Type 1AA - 375 lbs."
    },
    {
      "key": "Ladder Type",
      "value": "Attic"
    },
    {
      "key": "Load weight capacity",
      "value": "375 lb."
    },
    {
      "key": "Material",
      "value": "Aluminum"
    },
    {
      "key": "Maximum ceiling height (ft.)",
      "value": "10.3"
    },
    {
      "key": "MFG Brand Name",
      "value": "Werner"
    },
    {
      "key": "Minimum ceiling height (ft.)",
      "value": "7.8"
    },
    {
      "key": "Nonslip tread",
      "value": "11"
    },
    {
      "key": "Number of Steps",
      "value": "11"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "55.5"
    },
    {
      "key": "Recessed Opening Height (In.)",
      "value": "54"
    },
    {
      "key": "Recessed Opening Width (In.)",
      "value": "22.5"
    },
    {
      "key": "Rung/Step Depth",
      "value": "3 in"
    },
    {
      "key": "Stainable/Paintable",
      "value": "Stainable \u0026 Paintable"
    },
    {
      "key": "Step rise (in.)",
      "value": "12"
    }
  ],
  "isDeleted": false
}