{
  "uid": 100257,
  "name": "Cedar Pro 100% Aromatic Red Cedar Planks",
  "description": "Enjoy the clean fresh scent and the luxurious enhancement throughout your home that only Cedar Essentials 100% Aromatic Eastern Red Cedar planks can provide. Whether you are updating, remodeling or building a new home, Cedar Essentials solid wood tongue and groove planking is the Eco-Friendly way to line, protect and beautify all of the storage areas in your home. From closets, cabinets, dresser drawers and chests in bedrooms, bathrooms, basements, pantries, laundry rooms and attics, Cedar Essentials 100% Aromatic Eastern Red Cedar planks are the perfect way to help naturally resist mildew, odor and repel pests such as moths, roaches and silverfish, while protecting your garments and other valuables without the use of any harmful chemicals or treatments. Made in the USA these planks are environmentally friendly and require no messy finishing. The end-matched tongue and groove design makes it an easy install with professional results for any do-it-yourselfer. 100% Natural Aromatic Red Cedar planking is the perfect economical solution for garment protection, preventing odor and mildew problems and freshening up all the storage areas of your home, apartment or condo from the attic to the basement and everywhere in between.California residents: see\u0026nbsp;Proposition 65 informationEach box covers 15 sq. ft.100% Aromatic eastern red cedar; no added chemicals or treatmentsAromatic fresh scent with the luxurious enhanced look of real red cedarAromatic scent naturally repels moths, roaches and other pestsNaturally resists mildewEnvironmentally friendly; safe non-toxic alternative to mothballsEnd matched tongue and groove planks for easy assemblyEast to install for the do-it-yourselferNo finishing requiredAuthentic solid wood cedar essentials planking adds beauty, warmth and valueRandom length planks are 3-3/4 in. wide x 1/4 in. thickGreat for closets, drawers, chests and more",
  "attributes": [
    {
      "key": "Application",
      "value": "Wall"
    },
    {
      "key": "Color/Finish",
      "value": "Cedar"
    },
    {
      "key": "Finish Type",
      "value": "Unfinished"
    },
    {
      "key": "Material",
      "value": "Wood"
    },
    {
      "key": "MFG Brand Name",
      "value": "Unbranded"
    },
    {
      "key": "Paneling/Planking Features",
      "value": "Moisture Resistant,Rot Resistant,Tongue and Groove"
    },
    {
      "key": "Paneling/Planking Style",
      "value": "V-Groove"
    },
    {
      "key": "Paneling/Planking Type",
      "value": "Plank Paneling"
    },
    {
      "key": "Product Height (in.)",
      "value": "48"
    },
    {
      "key": "Product Thickness (in.)",
      "value": ".25"
    },
    {
      "key": "Product Width (in.)",
      "value": "45"
    },
    {
      "key": "Quantity",
      "value": "12"
    }
  ],
  "isDeleted": false
}