{
  "uid": 100265,
  "name": "Reach Barrier Silvertanium Radiant Insulation Roll - 250 ft.",
  "description": "Reach Barrier 3023 Silvertanium Radiant Barrier is the only non-laminated reflective insulation product available and is so pliable it makes even the toughest job easier. Silvertanium is constructed with highly reflective metallization on both sides and is perforated for maximum performance and breathability. Traditional insulation materials such as fiberglass or foam don\u0027t stop the heat they just slow it down but Silvertanium cutting edge technology stops 95% of radiant heat ensuring maximum protection. It is 30% lighter than other radiant barriers. This insulation is not a multiple-layer laminated product and it will never delaminate and fall apart. The proprietary protective coating will not oxidize or degrade over time, ensuring peak performance throughout the life of the product. At just a fraction of the thickness and weight, this insulation has up to four-times the tear resistance of other brands, making installation dramatically easier. Silvertanium meets all ASTM standards, complies with the international building code and is ideal for: Attic spaces, exterior and interior walls, interior masonry walls, radiant floors, metal and steel buildings, crawl spaces, garage ceilings and many other applications where insulation is needed. This insulation roll is 250 ft. long, 48 in. high and 0.01 in. thick. Installing a radiant barrier may be the lowest-cost improvement that can produce the greatest overall reduction in energy usage and expense.Installing Silvertanium reflective attic insulation barrier is a great DIY projectSave on energy costs by reducing energy consumption in your homeEntire attic is made cooler or warmer (Not just the living space below)Air conditioning equipment and ductwork within the attic benefit from the more consistent temperatures100% recyclableYour attic space remains more useable after installation",
  "attributes": [
    {
      "key": "ENERGY STAR Certified",
      "value": "No"
    },
    {
      "key": "Friction Fit",
      "value": "No"
    },
    {
      "key": "Insulation Type",
      "value": "Radiant Barrier"
    },
    {
      "key": "MFG Brand Name",
      "value": "Reach Barrier"
    },
    {
      "key": "Product Length (ft.)",
      "value": "250 ft"
    },
    {
      "key": "Product Thickness (in.)",
      "value": ".01 in"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "22"
    },
    {
      "key": "Sheet or Roll",
      "value": "Roll"
    }
  ],
  "isDeleted": false
}