{
  "uid": 100262,
  "name": "Home Decorators Collection Espresso Bamboo Roman Shade",
  "description": "Relax the look of any room with the calm and comforting Home Decorators Collection Espresso Multi-Weave Bamboo Roman Shade. Environmentally friendly, woven wood-textured natural shades stylishly filter light and protect your furniture from fading. The rich wood tones of natural shades, (also called bamboo blinds or bamboo shades) are complimentary to many hardwood floor and furniture finishes, or jute or sisal rugs. Textured window blinds are available in many different colors and styles. They are popular window treatments for coastal and beach properties, lakeside or country cottages, or traditional and metropolitan homes.23 in. W x 72 in. LActual blind width is 22.5 in.NOTE: This blind is 0.5 in. (1.27 cm) narrower than the order size (or the size shown on the box)For an inside mount, fits windows 23 in. wideFor an outside mount, order the width of the overall area to be covered6 in. matching valance included1/8 in. natural bamboo matchsticks form a tight woven wood weave that will lightly filter the sunReal natural bamboo matchsticks are light weightSemi- private shades provide light and privacy control for windowsThin natural matchstick bamboo is threaded together in a woven wood weave similar to a jute rug and compliments any roomSemi-private roman shade has a lift and fold system that opens and closes easily for privacy and light control lightDecorative tassel matches perfect to the style of the shadeFinished bottom railDecorative designer tips includedEasy installationInterior roman shadeNot sure what size to buy? Click here to download a printable window treatment measuring guide!WARNING: The cords on this product present a potential strangulation hazard. For child safety, consider cordless alternatives or products with inaccessible cords. To access a copy of the warning label, see additional images.",
  "attributes": [
    {
      "key": "Actual Blind/Shade Width (In.)",
      "value": "22.5"
    },
    {
      "key": "Arched",
      "value": "No"
    },
    {
      "key": "- NOTE",
      "value": "This blind is 0.5 in. (1.27 cm) narrower than the order size (or the size shown on the box)"
    },
    {
      "key": "- \u003Cb\u003EWARNING",
      "value": "\u003C/b\u003E The cords on this product present a potential strangulation hazard. For child safety, consider cordless alternatives or products with inaccessible cords. To access a copy of the warning label, see additional images."
    },
    {
      "key": "Certifications and Listings",
      "value": "ANSI Certified"
    },
    {
      "key": "Color Family",
      "value": "Brown"
    },
    {
      "key": "Color/Finish",
      "value": "Espresso"
    },
    {
      "key": "Color/Finish Family",
      "value": "Browns/Tans"
    },
    {
      "key": "Cordless/Corded",
      "value": "Corded"
    },
    {
      "key": "Decor Product Type",
      "value": "Window Treatment"
    },
    {
      "key": "Enclosure Type",
      "value": "No Enclosure"
    },
    {
      "key": "Features",
      "value": "Routless"
    },
    {
      "key": "Front Color",
      "value": "Espresso"
    },
    {
      "key": "Hardware Included",
      "value": "Yes"
    },
    {
      "key": "Included",
      "value": "No Additional Items Included"
    },
    {
      "key": "Light Control",
      "value": "Light Filtering"
    },
    {
      "key": "Material",
      "value": "Bamboo"
    },
    {
      "key": "MFG Brand Name",
      "value": "Home Decorators Collection"
    },
    {
      "key": "Minimum window depth required (in.)",
      "value": "1"
    },
    {
      "key": "Mount Type",
      "value": "Inside/Outside"
    },
    {
      "key": "Opening type",
      "value": "Bottom up"
    },
    {
      "key": "Orientation",
      "value": "Horizontal"
    },
    {
      "key": "Pre-Cut Deduction (in.)",
      "value": "0.5"
    },
    {
      "key": "Pre-Cut or True-to-Size Blind",
      "value": "Pre-cut"
    },
    {
      "key": "Product Length (in.)",
      "value": "72"
    },
    {
      "key": "Product Style",
      "value": "Modern"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "4.87"
    },
    {
      "key": "Product Width (in.)",
      "value": "23"
    },
    {
      "key": "Slat/vane width (in.)",
      "value": "23"
    },
    {
      "key": "Stain Resistant",
      "value": "No"
    },
    {
      "key": "Surface",
      "value": "Textured"
    },
    {
      "key": "Width (in) x Length (in)",
      "value": "23 x 72"
    },
    {
      "key": "Window Treatment Product Type",
      "value": "Natural/Woven Roman Blind/Shade"
    }
  ],
  "isDeleted": false
}