{
  "uid": 100204,
  "name": "Home Dynamix Persian Black Runner - 1.5M Points - Customizable",
  "description": "The eye-catching Persian styling of this Home Dynamix Super Kashan Black 2 ft. 2 in. x Your Choice Length Roll Runner adds an elegant complement to your floors and home furnishings. The roll runner\u0027s high-density polypropylene construction is comprised of 1-1/2 million points per sq. meter for longevity and it is fade resistant for long-lasting color vibrancy.Persian design provides a stylish complement to floors and home furnishingsHigh-density polypropylene construction with 1-1/2 million points per sq. meter for durabilityMachine made in BelgiumThis is a Custom Order - orders are sold in increments of 1 ft.  To order: place order and set order quantity to the desired length (ft.) of your runner.  EXAMPLE: if your order is for 10 ft. you will need to add a quantity of 10 to your order and you will receive a runner that is 10 ft. in length x stated widthJute backing helps keep the runner in a fixed positionFade resistant to stand up to discolorationPlease Note: The digital images and product dimensions on our website are as accurate as possible. Due to differences in computer monitors, some rug colors may vary slightly. Lengths and widths may vary from the published dimensions. We do our best to provide you with an exact measurement, but please be advised that some variation exists. Patterns may vary slightly according to shape and size selected.This is a Custom Order - orders are sold in increments of 1 ft.  To order: place order and set order quantity to the desired length (ft.) of your runner.  EXAMPLE: if your order is for 10 ft. you will need to add a quantity of 10 to your order and you will receive a runner that is 10 ft. in length x stated width.Custom length products are not returnable",
  "attributes": [
    {
      "key": "- This is a Custom Order - orders are sold in increments of 1 ft.  To order",
      "value": "place order and set order quantity to the desired length (ft.) of your runner.  EXAMPLE: if your order is for 10 ft. you will need to add a quantity of 10 to your order and you will receive a runner that is 10 ft. in length x stated width"
    },
    {
      "key": "- Please Note",
      "value": "The digital images and product dimensions on our website are as accurate as possible. Due to differences in computer monitors, some rug colors may vary slightly. Lengths and widths may vary from the published dimensions. We do our best to provide you with an exact measurement, but please be advised that some variation exists. Patterns may vary slightly according to shape and size selected."
    },
    {
      "key": "- This is a Custom Order - orders are sold in increments of 1 ft.  To order",
      "value": "place order and set order quantity to the desired length (ft.) of your runner.  EXAMPLE: if your order is for 10 ft. you will need to add a quantity of 10 to your order and you will receive a runner that is 10 ft. in length x stated width."
    },
    {
      "key": "Cleaning instructions",
      "value": "Professionally clean"
    },
    {
      "key": "Color Family",
      "value": "Blacks"
    },
    {
      "key": "Color/Finish",
      "value": "Black"
    },
    {
      "key": "Commercial / Residential",
      "value": "Residential"
    },
    {
      "key": "Features",
      "value": "No Additional Features"
    },
    {
      "key": "Flooring Product Type",
      "value": "Roll Runner"
    },
    {
      "key": "Indoor/Outdoor",
      "value": "Indoor"
    },
    {
      "key": "Machine Washable",
      "value": "No"
    },
    {
      "key": "Material",
      "value": "Polypropylene with Jute backing"
    },
    {
      "key": "MFG Brand Name",
      "value": "Home Dynamix"
    },
    {
      "key": "Product Length (in.)",
      "value": "12"
    },
    {
      "key": "Product Thickness (in.)",
      "value": "0.51 in"
    },
    {
      "key": "Product Width (in.)",
      "value": "26"
    },
    {
      "key": "Recycled Materials (%)",
      "value": "0"
    },
    {
      "key": "Rug Shape",
      "value": "Runner"
    },
    {
      "key": "Unit",
      "value": "LinearFoot"
    }
  ],
  "isDeleted": false
}