{
  "uid": 100240,
  "name": "Splashback Pearl 3D Glass Mosaic Tile",
  "description": "An ideal tile for a kitchen backsplash or bathroom surfaces, the glass and stone combination of Splashback\u0027s sample size Baroque Pearl 3D Brick Pattern Mosaic Tile create a beautifully multi-dimensionally effect. The mesh backing not only simplifies installation, it also allows the tiles to be separated which adds to their design flexibility. Sample size tiles available. See item 203061538 for full size tile.1 square foot per piece, each piece sold individually. Piece weight equals 0.75 lbs.Grade 1, first-quality stone and glass tile for wall and top use3 in. length x 6 in. wide x 5/16 in. thickGlazed smooth finish with some random shade and tone variationP.E.I. Rating 0 is suitable for walls and residential use onlyNon-Vitreous flooring has water absorption of more than 7% for indoor useC.O.F. Slipresistance/C.O.F. rating greater than .50 is recommended for standard residential applications and is marginally skid resistant. Indoor useNot frost resistantResidential and commercial useLearn how to get a Lifetime Warranty by using Custom Building Products from The Home Depot. Visit www.homedepot.com/CBPDon\u0027t forget your coordinating trim pieces, grout, backerboard, thinset and installation toolsAll online orders for this item ship via ground and may arrive in multiple boxesIt is recommended you purchase a minimum of 10% overage to account for design cuts and patternsTile samples are not returnable",
  "attributes": [
    {
      "key": "Approximate Tile Size",
      "value": "3x6"
    },
    {
      "key": "Color Family",
      "value": "Browns / Tans"
    },
    {
      "key": "Color/Finish",
      "value": "Browns / Tans"
    },
    {
      "key": "Commercial / Residential",
      "value": "Commercial / Residential"
    },
    {
      "key": "Flooring Product Type",
      "value": "Tile Sample"
    },
    {
      "key": "Indoor/Outdoor",
      "value": "Indoor/Outdoor"
    },
    {
      "key": "MFG Brand Name",
      "value": "Splashback Tile"
    },
    {
      "key": "Mosaic Sub Unit Length (in.)",
      "value": "0.25"
    },
    {
      "key": "Mosaic Sub Unit Width (in.)",
      "value": "0.5"
    },
    {
      "key": "Number of Tiles per Case",
      "value": "1"
    },
    {
      "key": "Product Thickness (mm)",
      "value": "8"
    },
    {
      "key": "Style Type",
      "value": "Contemporary"
    },
    {
      "key": "Suggested Grout Line Size",
      "value": "1/16"
    },
    {
      "key": "Tile Features",
      "value": "No Additional Features"
    },
    {
      "key": "Tile Finish",
      "value": "Polished"
    },
    {
      "key": "Tile Material",
      "value": "Glass"
    },
    {
      "key": "Tile Use",
      "value": "Accent Wall,Backsplash,Bath Wall,Fireplace Facade,Shower Wall"
    }
  ],
  "isDeleted": false
}