{
  "uid": 100227,
  "name": "Adjust-A-Gate Steel Frame DIY Gate Kit",
  "description": "Ask for the adjustable, Adjust-A-Gate system every time for your gate needs. This line is ideal for repairing an old gate or building a new one. Including all necessary hardware \u0026 parts, our gate is assembled onsite to get the job done right, the first time. The Adjust-A-Gate system comes with all the components needed to build a sturdy, reliable gate that will serve you for years to come. You simply add rails and fence boards, you will have a gate for life. Accessories include an optional drop rod for double drive applications.2-rail Adjust-A-Gate kit, for openings of 36 in.-60 in. wide, 36 in. high frame for 3 ft., 4 ft. and 5 ft. high fencesUse for wood or composite fence gates; single or double drive useOur exclusive adjustable diagonal truss cable will keep your gate true and aligned year after yearKit includes: Vertical frame, spreader bars, frame hinges, post hinges, gate latch kit, truss cable, screws and gate stopEasy to install; perfect for the DIYerHeavy-duty hinges prevent sagging and dragging2-step powder coated all-steel frame, fade and rust resistant, square tube design",
  "attributes": [
    {
      "key": "Builders Hardware Product Type",
      "value": "Gate Accessories"
    },
    {
      "key": "- Kit includes",
      "value": "Vertical frame, spreader bars, frame hinges, post hinges, gate latch kit, truss cable, screws and gate stop"
    },
    {
      "key": "Fasteners included",
      "value": "Yes"
    },
    {
      "key": "Finish",
      "value": "polyester powder coat over steel"
    },
    {
      "key": "Finish Family",
      "value": "Gray"
    },
    {
      "key": "Material",
      "value": "Steel"
    },
    {
      "key": "MFG Brand Name",
      "value": "Adjust-A-Gate"
    },
    {
      "key": "Product Depth (in.)",
      "value": "2"
    },
    {
      "key": "Product Height (in.)",
      "value": "45"
    },
    {
      "key": "Product Width (in.)",
      "value": "60"
    }
  ],
  "isDeleted": false
}