{
  "uid": 100270,
  "name": "Werner 16 ft. Fiberglass Podium Ladder with HolsterTop PRO",
  "description": "Werner\u0027s 16 ft. Reach Fiberglass Podium Ladder delivers the same reach height as a 12 ft. stepladder and offers a large standing surface with toe guard, providing maximum comfort. It features the 4X Work Zone that allows you to face any direction safely, so you can accomplish more without having to reposition your ladder. This updated design also includes the HolsterTop PRO extended guardrail, providing an extra point of contact while securely and conveniently organizing tools and accessories at the top of the ladder. Built with safety in mind, the exclusive EDGE360 bracing system increases the size of the ladder foot pad and braces the first step, providing protection from every angle.Offers equivalent reach height of a 12 ft. step ladderExtra-large platform for long standing comfortHolsterTop PRO extended guard rail securely wraps around Work Zone and holds an arsenal of toolsEDGE360 includes an integrated rail shield, edge bracing and oversized foot pads for securityDouble riveted, slip-resistant, TRACTION-TRED steps offer secure footingANSI certified and OSHA compliant for safe use4X Work Zone to reach all directions:",
  "attributes": [
    {
      "key": "Base Spread (in.)",
      "value": "80.5"
    },
    {
      "key": "Certifications and Listings",
      "value": "ANSI Certified,OSHA Compliant"
    },
    {
      "key": "Ladder Height (ft.)",
      "value": "10"
    },
    {
      "key": "Ladder Rating",
      "value": "Type 1A - 300 lbs."
    },
    {
      "key": "Ladder Type",
      "value": "Step Ladder"
    },
    {
      "key": "Ladders/Scaffolding Features",
      "value": "Weather Resistant"
    },
    {
      "key": "Load weight capacity",
      "value": "300 lb."
    },
    {
      "key": "Material",
      "value": "Fiberglass"
    },
    {
      "key": "Maximum reach (ft.)",
      "value": "16"
    },
    {
      "key": "MFG Brand Name",
      "value": "Werner"
    },
    {
      "key": "Nonslip tread",
      "value": "10"
    },
    {
      "key": "Number of Steps",
      "value": "10"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "58"
    },
    {
      "key": "Rung/Step Depth",
      "value": "3"
    },
    {
      "key": "Step rise (in.)",
      "value": "12"
    }
  ],
  "isDeleted": false
}