{
  "uid": 100291,
  "name": "Waste King EZ-Mount 2600 RPM Garbage Disposal",
  "description": "The Waste King 2600 Legend Series 1/2 HP EZ-Mount Sound Insulated Garbage Disposal is one of the best food disposals on the market. With a high-speed 2600 RPM Vortex powered permanent magnet motor, this Disposal can efficiently get rid of your food waste. It includes a removable splash guard that aids in internal inspection and can be easily cleaned. It is also septic safe for properly sized septic tanks, making it environmentally friendly. The fast and easy mount system provides a no-hassle installation and is suitable for dishwasher hookup.Sound insulated, continuous feed garbage disposerSafe for properly sized septic tanksFast and easy mount system provides a no-hassle installationHigh-speed 2600 RPM permanent magnet motor produces more power per poundCorrosion proof glass-filled polyester grinding chamber and glass-filled nylon hopperStainless steel and Celcon sink flangePositive seal stopper, removable splash guard and ABS waste elbowStainless steel grind ring, swivel impellers, and turntablePermanently lubricated, sleeve-type bearingsManual reset overload protector36 in. power cord includedLifetime corrosion warranty5-year in-home service warrantyHome Depot Protection Plan:",
  "attributes": [
    {
      "key": "Certifications and Listings",
      "value": "4-UL Certified,CSA Listed"
    },
    {
      "key": "Dishwasher drain connection",
      "value": "Yes"
    },
    {
      "key": "Disposer Feed",
      "value": "Continuous Feed"
    },
    {
      "key": "Energy Consumption (kWh/year)",
      "value": "0.52"
    },
    {
      "key": "Grind chamber capacity (oz.)",
      "value": "27.3"
    },
    {
      "key": "Grinding Speed (RPM)",
      "value": "2600"
    },
    {
      "key": "Horsepower (hp)",
      "value": "0.5"
    },
    {
      "key": "Kitchen Product Type",
      "value": "Disposal"
    },
    {
      "key": "MFG Brand Name",
      "value": "Waste King"
    },
    {
      "key": "Noise insulation",
      "value": "Yes"
    },
    {
      "key": "Product Depth (in.)",
      "value": "9.13"
    },
    {
      "key": "Product Height (in.)",
      "value": "13.43"
    },
    {
      "key": "Product Length (in.)",
      "value": "9.13"
    },
    {
      "key": "Product Width (in.)",
      "value": "7.62"
    },
    {
      "key": "Stainless steel grind chamber",
      "value": "Yes"
    },
    {
      "key": "Voltage (volts)",
      "value": "115"
    }
  ],
  "isDeleted": false
}