{
  "uid": 100217,
  "name": "Sigman Natural Canvas Drop Cloth 12 ft. x 15 ft.",
  "description": "Standard weight canvas drop cloths are popular with professional painters and contractors. Canvas drop cloth fabric weight 8 oz. / sq. yard. Canvas drop cloths are used for painting and cleaning up indoors and outdoors, wallpapering and removal, leaf collections and other jobs. Made from natural cotton canvas, canvas drop cloths are reusable, washable and environment friendly. Natural canvas drop cloths absorbs splashes and spills but are not leak or spill proof. For more leak resistant drop cloths, please try butyl drop cloths or tarps.Natural cotton canvas drop cloths absorb splashes and spills but are not leak or spill proof, for more leak resistant drop cloths, please try butyl drop cloths or tarpsCanvas drop cloths are used for painting and cleaning up indoors and outdoors, wallpapering and removal, leaf collections and other jobs12 ft. x 15 ft. canvas drop cloth covers area of up to approximately 180 square feetCanvas drop cloths are made from natural cotton canvas and environment friendly, drop cloths are not seamless and may have seamsEasily drape canvas drop cloths over floors, furniture or bushes for painting or construction job site protection or clean upReusable and washableGet the right coverage - click here for Home Depot\u0027s buying guide",
  "attributes": [
    {
      "key": "Color Family",
      "value": "Beige / Cream"
    },
    {
      "key": "Drop cloth length (ft.)",
      "value": "15"
    },
    {
      "key": "Drop cloth width (ft.)",
      "value": "12"
    },
    {
      "key": "Drop Cloths Product Type",
      "value": "Canvas"
    },
    {
      "key": "MFG Brand Name",
      "value": "Sigman"
    },
    {
      "key": "Paint Product Type",
      "value": "Drop Cloths"
    },
    {
      "key": "Product Depth (in.)",
      "value": "138"
    },
    {
      "key": "Product Height (in.)",
      "value": "0.25"
    },
    {
      "key": "Product Length (in.)",
      "value": "174"
    },
    {
      "key": "Product Thickness (in.)",
      "value": "0.25 in"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "10.25"
    },
    {
      "key": "Product Width (in.)",
      "value": "138"
    },
    {
      "key": "Slip Resistant Surface",
      "value": "No"
    },
    {
      "key": "Tarps, Drop Cloths \u0026 Plastic Sheeting Product Type",
      "value": "Drop Cloths"
    },
    {
      "key": "Washable",
      "value": "Yes"
    },
    {
      "key": "Washable/Reusable",
      "value": "Yes"
    }
  ],
  "isDeleted": false
}