{
  "uid": 100316,
  "name": "Mighty Mule Dual Gate Opener Enhanced Access Package",
  "description": "The FM502 Automatic Gate Opener is Mighty Mule strongest dual gate operator. As a Home Depot Exclusive the Enhanced Access Package offers 2 additional Single Button Remotes (FM135), a Wired or Wireless Digital Keypad (FM137) and a 50 ft. Wired Driveway Vehicle Sensor (FM138). The FM502 heavy duty gate opener is designed for dual swing gates up to 18 ft. or weighing up to 850 lbs. per panel. The Mighty Mule FM502 gate opener is ideal for ornamental, vinyl, tubular steel farm gates, chain link or wood gates.Package includes 2 additional single button access remotes (FM135), wired or wireless digital keypad (FM137) and 50 ft. wired driveway vehicle sensor (FM138) and also included, the standard FM502 kit contents: includes 1 single button access remote (FM135), AC transformer (RB570), battery (FM150), control box, all required hardware and a detailed installation manual with an interactive DVDIdeal for dual swing gates weighing up to a maximum of 18 ft. or a maximum of 850 lbs. per panelPerfect for all gate types including ornamental, vinyl, tubular steel farm gates, chain link or wood gates30% Residential energy efficient property tax credit available, residential home owners can use this credit on a new operator system, accessories and installation with the purchase of a Mighty Mule solar panel; 10-Watt (FM123)Mighty Mule offers strong, elegant steel gates on HomeDepot.com that can be shipped directly to your homeBacked by a 18-month Mighty Mule warranty and technical supportHome Depot protection plan:",
  "attributes": [
    {
      "key": "- Package includes 2 additional single button access remotes (FM135), wired or wireless digital keypad (FM137) and 50 ft. wired driveway vehicle sensor (FM138) and also included, the standard FM502 kit contents",
      "value": "includes 1 single button access remote (FM135), AC transformer (RB570), battery (FM150), control box, all required hardware and a detailed installation manual with an interactive DVD"
    },
    {
      "key": "Commercial/Residential Use",
      "value": "Residential"
    },
    {
      "key": "Fencing Product Type",
      "value": "Gate Opener Kit"
    },
    {
      "key": "Gate opening style",
      "value": "Swinging"
    },
    {
      "key": "Hardware Included",
      "value": "Yes"
    },
    {
      "key": "Lighting Included",
      "value": "No"
    },
    {
      "key": "Maximum gate size (ft.)",
      "value": "18"
    },
    {
      "key": "MFG Brand Name",
      "value": "Mighty Mule"
    },
    {
      "key": "Power Requirements",
      "value": "AC or Solar"
    },
    {
      "key": "Product Depth (in.)",
      "value": "18.5"
    },
    {
      "key": "Product Height (in.)",
      "value": "46"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "62"
    },
    {
      "key": "Product Width (in.)",
      "value": "24.5"
    },
    {
      "key": "Remote control included",
      "value": "Yes"
    },
    {
      "key": "Weight Capacity (lb.)",
      "value": "850"
    },
    {
      "key": "Wired or Wireless",
      "value": "Combo"
    }
  ],
  "isDeleted": false
}