{
  "uid": 100308,
  "name": "Maytag 7.0 cu. ft. Electric Dryer with AutoDry in White",
  "description": "With an impressive 7.0 cu. ft. capacity and an AutoDry moisture sensor that stops the cycle at the perfect point of dry, this Maytag dryer is built to handle your largest loads. Sturdy Maytag Commercial Technology guarantees these dryers come standard with high-performance, commercial-grade parts like a durable, high-torque motor, premium rollers and a 5-rib belt that keeps them humming along year after year. And we backed this heavy-duty dryer with a 10-year limited parts warranty, so you\u0027ll be covered for every demanding laundry job for a decade. Rely on the Wrinkle Control cycle to help keep clothes looking good.The extra-large 7.0 cu. ft. capacity provides enough space to evenly dry your largest loads straight from the washer15 Dryer Cycles including multiple timed dry options, heavy duty, energy preferred auto dry, less dry - auto dry, more dry, air dry, normal and damp dryDryer drum\u0027s powder-coat finish resists chipping and abrasion to protect clothes from damageRear panel controls provide convenient access to all cycle and option selections4 temperature settings: air only, high, low and medium allow you to choose the best drying temperature for each loadAutoDry sensor tracks moisture levels to stop the cycle at that perfect point of dryWith the Wrinkle Control option, the dryer continues to tumble your clothes after the cycle has ended. It\u0027s a no-heat way to help prevent wrinkles from setting inSet the end-of-cycle signal alerts you when the drying cycle has completedMaytag Commercial Technology. These dryers come standard with high-performance, commercial-grade partsInterior drum light illuminates the interior of the dryer to make loading and unloading easier. Reversible side-swing door increases installation optionsThe heavy-duty motor provides faster spin speeds, which work together with optimized airflow for exceptional dryingMaytag Commercial Technology. These dryers come standard with high-performance, commercial-grade parts10-year limited parts warranty on the drive motor and dryer drum",
  "attributes": [
    {
      "key": "Amperage (amps)",
      "value": "30"
    },
    {
      "key": "Appliance Type",
      "value": "Electric Dryer"
    },
    {
      "key": "Assembled Depth (in.)",
      "value": "28.2 in"
    },
    {
      "key": "Assembled Height (in.)",
      "value": "43 in"
    },
    {
      "key": "Assembled Width (in.)",
      "value": "29 in"
    },
    {
      "key": "- 4 temperature settings",
      "value": "air only, high, low and medium allow you to choose the best drying temperature for each load"
    },
    {
      "key": "Capacity - Dryer (cu. ft.)",
      "value": "7"
    },
    {
      "key": "Certifications and Listings",
      "value": "1-UL Listed"
    },
    {
      "key": "Color/Finish",
      "value": "White"
    },
    {
      "key": "Color/Finish Family",
      "value": "White"
    },
    {
      "key": "Control Type",
      "value": "Electro-Mechanical"
    },
    {
      "key": "Depth With Door Open 90 Degrees (In)",
      "value": "51"
    },
    {
      "key": "Door Opening Height (In.)",
      "value": "16.8"
    },
    {
      "key": "Door Opening Width (In.)",
      "value": "20.1"
    },
    {
      "key": "Door Style",
      "value": "Reversible"
    },
    {
      "key": "Dry Cycles",
      "value": "Auto Dry,Damp Dry,Heavy Duty"
    },
    {
      "key": "Dryer Drum Material",
      "value": "Powder-Coated Steel"
    },
    {
      "key": "Dryer Features",
      "value": "Damp Dry,End-Of-Cycle Signal,Interior Light,Lint Filter,Moisture Sensor,Sensor Dry,Timed Dry"
    },
    {
      "key": "Exhaust Vent Location",
      "value": "Rear"
    },
    {
      "key": "Included Items",
      "value": "No Additional Items Included"
    },
    {
      "key": "Lint Filter Location",
      "value": "Top"
    },
    {
      "key": "Matching Washer Type",
      "value": "Top Load"
    },
    {
      "key": "MFG Brand Name",
      "value": "Maytag"
    },
    {
      "key": "Number of Drying Cycles",
      "value": "15"
    },
    {
      "key": "Number of Drying Temperatures",
      "value": "4"
    },
    {
      "key": "Pedestal Model#",
      "value": "nan"
    },
    {
      "key": "Product Depth (in.)",
      "value": "28.2"
    },
    {
      "key": "Product Height (in.)",
      "value": "43"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "109"
    },
    {
      "key": "Product Width (in.)",
      "value": "29"
    },
    {
      "key": "Stackable",
      "value": "No"
    },
    {
      "key": "Stacking Kit Model#",
      "value": "nan"
    },
    {
      "key": "Steam Function",
      "value": "No"
    },
    {
      "key": "Voltage (volts)",
      "value": "240"
    }
  ],
  "isDeleted": false
}