{
  "uid": 100359,
  "name": "Wilsonart Black Beauty Laminate Sheets",
  "description": "Wilsonart\u0027s 48 in. x 96 in. Black Laminate Sheets provide enduring beauty like no other surfacing product. And, whatever pattern and color you choose for your kitchen countertop, bathroom vanity, laundry room or garage worktop, the beauty and easy maintenance will be yours at a price you can celebrate.  A new look is yours for less, leaving you with more to spend on special extras.Best value in surfacing, Wilsonart laminate offers design, performance and durability at a price for any budgetWilsonart laminate exceeds the industry\u0027s highest standards for indoor air quality, with GREENGUARD certification on all laminate typesWilsonart laminate contains a minimum of 20% post-consumer recycled content, the highest percentage of post-consumer recycled content in the industryPlease review actual sample before ordering as the pattern/color shown is a printed reproductionStart your kitchen design today with our Kitchen PlannerGet a free quote with our Countertop Estimator",
  "attributes": [
    {
      "key": "Antimicrobial",
      "value": "Yes"
    },
    {
      "key": "Color",
      "value": "Solid black color"
    },
    {
      "key": "Color Family",
      "value": "Black"
    },
    {
      "key": "Color/Finish",
      "value": "Solid black color"
    },
    {
      "key": "High Temperature Resistance",
      "value": "Warranty does not cover exposure to extreme temperatures."
    },
    {
      "key": "Kitchen Product Type",
      "value": "Laminate Sheets for Countertops"
    },
    {
      "key": "Laminate Style",
      "value": "Solids"
    },
    {
      "key": "Material",
      "value": "Laminate"
    },
    {
      "key": "MFG Brand Name",
      "value": "Wilsonart"
    },
    {
      "key": "Product Depth (in.)",
      "value": "96"
    },
    {
      "key": "Product Height (in.)",
      "value": "0.039"
    },
    {
      "key": "Product Length (in.)",
      "value": "96"
    },
    {
      "key": "Product Thickness (in.)",
      "value": "0.039 in"
    },
    {
      "key": "Product Width (in.)",
      "value": "48"
    },
    {
      "key": "Scratch Resistant",
      "value": "No"
    },
    {
      "key": "Stain Resistant",
      "value": "Yes"
    }
  ],
  "isDeleted": false
}