{
  "uid": 100399,
  "name": "American Standard VorMax CleanCurve Elongated Toilet",
  "description": "VorMax flushing technology is the solution to maintaining a cleaner toilet bowl by simply flushing the toilet. Its revolutionary VorMax flushing system completely cleans the entire bowl, including under the rim. The VorMax flushing technology has been independently tested and proven to CLEAN 2X BETTER than conventional toilets. This helps maintain a tidier toilet bowl longer, so cleaning is a breeze. Source: Test witnessed by IAPMO R\u0026T Labs comparing VorMax against conventional under-the-rim-water-dispersal toilets from major retailers.Includes decorative slow close seat that features a seamless, concealing lid and EverClean surface which helps keep the seat cleaner longerOptum VorMax flush technology cleans 2x better than conventional toiletsVorMax flush technology delivers a powerful jet of water that scrubs the bowl clean from top to bottom, removing everything in its pathCleanCurve rim design eliminates hidden, hard-to-reach surfaces where dirt and buildup hideEverClean surface is super smooth and easier to keep clean, even after years of use; plus, the permanent EverClean antimicrobial surface inhibits the growth of stain and odor causing bacteria on the surfaceIndustry-leading flush technology saves water without losing performance. It uses just 1.28 Gal. of water per flush, a 20% savings compared to 1.6 GPF toilets; a 20% savings in water usage translates to money savingComfortable right height, elongated bowl is ADA compliant which can help make getting on and off of the toilet easierEasy installation. Complete toilet includes everything you need for installation, including the seat and wax ringFeatures dual-injection flush valves that open almost simultaneously, delivering water to the bowl in two ways, to the jet hole for a powerful vortex scouring action in the bowl and to the trap way to create the siphon which disposes of all the wasteSuperior waste removal with a 2-1/16 in. smooth fully glazed trap way outletChrome handle100% factory flush testedWarranty: lifetime on chinaware, 10-year on all mechanical parts, 1-year on seatFor installation offer details, click here or see an associate12 in. Rough-in",
  "attributes": [
    {
      "key": "Bowl Height",
      "value": "Comfort Height"
    },
    {
      "key": "Bowl Height (in.)",
      "value": "16.5"
    },
    {
      "key": "Bowl Shape",
      "value": "Elongated"
    },
    {
      "key": "- Warranty",
      "value": "lifetime on chinaware, 10-year on all mechanical parts, 1-year on seat"
    },
    {
      "key": "Certifications and Listings",
      "value": "ADA Compliant,EPA Approved,IAPMO Certified"
    },
    {
      "key": "Color Family",
      "value": "White"
    },
    {
      "key": "Color/Finish",
      "value": "White"
    },
    {
      "key": "Commercial / Residential",
      "value": "Residential"
    },
    {
      "key": "Flush Valve Size (in.)",
      "value": "3.5"
    },
    {
      "key": "Flushing Mechanism",
      "value": "Gravity Flush"
    },
    {
      "key": "Flushing Technology",
      "value": "Gravity Fed"
    },
    {
      "key": "Flushing Type",
      "value": "Single Flush"
    },
    {
      "key": "Gallons Per Flush",
      "value": "1.28"
    },
    {
      "key": "MaP Performance Rating",
      "value": "1000"
    },
    {
      "key": "Material",
      "value": "Vitreous China"
    },
    {
      "key": "MFG Brand Name",
      "value": "American Standard"
    },
    {
      "key": "Mount Location",
      "value": "Floor Mount"
    },
    {
      "key": "Product Depth (in.)",
      "value": "30.625"
    },
    {
      "key": "Product Height (in.)",
      "value": "30.75"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "92"
    },
    {
      "key": "Product Width (in.)",
      "value": "18"
    },
    {
      "key": "Rough In Size",
      "value": "12"
    },
    {
      "key": "Toilet Features",
      "value": "Antimicrobial,Complete Kit"
    },
    {
      "key": "Toilet Included Components",
      "value": "Handle,Seat"
    },
    {
      "key": "Trip Lever Location",
      "value": "Left Front"
    }
  ],
  "isDeleted": false
}