{
  "uid": 100339,
  "name": "Lexan ClearGuard Multi-Wall Sheet",
  "description": "Versatile LEXAN Thermoclear multi-wall sheet can be relied upon to deliver high quality; low maintenance glazing that is built to last. Easy to use by homeowners and contractors alike this product is a great material for a vast array of applications such as canopies and walkways, residential and commercial greenhouses, skylights and overhead glazing, sunrooms, carports, privacy panels and room partitions. Whether the project is indoors or out, LEXAN Thermoclear multiwall sheet can be the solution you need.2-Sided UV coated thermoclear multiwall sheet offers a high degree of light transmittance while blocking harmful ultra violet raysMade with virtually unbreakable LEXAN polycarbonate resin, thermoclear multi-wall sheet offers excellent impact strength and exceptional flame resistanceLightweight, easy to fabricate and install by do-it-yourself\u0027s and contractors using common everyday toolsThermoclear multi-wall sheet has a 10-year limited warranty against yellowing and breakage caused by hailBeautiful hammered glass texture for a high end finish",
  "attributes": [
    {
      "key": "MFG Brand Name",
      "value": "LEXAN"
    },
    {
      "key": "Mirrored",
      "value": "No"
    },
    {
      "key": "Non-Glare",
      "value": "No"
    },
    {
      "key": "Product Depth (in.)",
      "value": "96"
    },
    {
      "key": "Product Height (in.)",
      "value": "0.236"
    },
    {
      "key": "Product Length (in.)",
      "value": "96"
    },
    {
      "key": "Product Thickness (in.)",
      "value": "0.236"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "8.64"
    },
    {
      "key": "Product Width (in.)",
      "value": "48"
    },
    {
      "key": "Shatter Resistant",
      "value": "Yes"
    },
    {
      "key": "Sheet Features",
      "value": "Shatter Resistant"
    },
    {
      "key": "Surface Type",
      "value": "Texture"
    }
  ],
  "isDeleted": false
}