{
  "uid": 100311,
  "name": "Feit Electric 4ft. Dual LED Utility Light - Ultra Bright",
  "description": "Feit Electric\u0027s 4 ft. Dual LED Utility-light uses 38-Watt and comes fully assembled with an ultra-light weight design that can be used in hanging or flush mount installation. This no-humming LED offers a cool white-light and adds instant full brightness to any dark lit area even in sub-zero temperatures. There are no lamps to dispose of or replace with this 4 ft. 2 lamp which is ideal for any garage, game room, basement, work bench, closet and or cabinet. Includes two 6 in. hanging wire harnesses as well as a 5 ft. plug-in chord and easy on/off-light switch. Durable smooth edge housing provides the-light you need along with a sleek modern design.High-efficiency fixture consumes 57% less energy, saving you moneyDurable polycarbonate construction is built to last and offers a clean, polished lookUses 2 utility-lights 88-Watt equivalent (included) 38-Watt, 120-VoltUL listed3700 LumensIncludes assembly and install parts: easy plug in use with on/off switch, 5 ft. plug in chordFully assembled, includes 6 in. hanging wire harness that provides ample reachFlexible use with 1-touch on/off switch4100K day-light4 per box",
  "attributes": [
    {
      "key": "Bulb Type Included",
      "value": "LED"
    },
    {
      "key": "- Includes assembly and install parts",
      "value": "easy plug in use with on/off switch, 5 ft. plug in chord"
    },
    {
      "key": "Certifications and Listings",
      "value": "No Certifications or Listings"
    },
    {
      "key": "Commercial Light Type",
      "value": "Work Light"
    },
    {
      "key": "ENERGY STAR Certified",
      "value": "No"
    },
    {
      "key": "Fixture Color/Finish",
      "value": "Black"
    },
    {
      "key": "Light Bulb Base Code",
      "value": "Other"
    },
    {
      "key": "Light Source",
      "value": "LED"
    },
    {
      "key": "MFG Brand Name",
      "value": "Feit Electric"
    },
    {
      "key": "Number of Bulbs Required",
      "value": "0"
    },
    {
      "key": "Product Depth (in.)",
      "value": "48"
    },
    {
      "key": "Product Height (in.)",
      "value": "1.8"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "2.89"
    },
    {
      "key": "Product Width (in.)",
      "value": "5"
    }
  ],
  "isDeleted": false
}