{
  "uid": 100309,
  "name": "Milwaukee Sawzall Blade Set: Wood \u0026 Metal Cutting 12-Piece",
  "description": "Get wood and metal cutting blades in both thin kerf and demolition for a wide variety of professional applications with the 12-piece Milwaukee Sawzall Blade Set. The wood cutting blades are equipped with Fang Tip and Nail Guard technology to extend the life and increase durability in nail-embedded wood. The thin kerf, Double Duty Upgrade metal cutting blades provide extended life and fast, flexible cuts. Torch demolition, Double-Duty Upgrade metal cutting blades also provide extended life and facilitate tough cuts. Torch blades also have Grid Iron Technology for increased stiffness. Metal cutting blades are equipped with Tough Neck, engineered to protect against tang breakage for added strength.Includes wood- and metal-cutting Sawzall blades in both thin kerf and demolition for a wide variety of professional applicationsWood-cutting blades with fang tip and nail guard technology to extend the life and increase durability in nail-embedded woodThin kerf Double Duty Upgrade metal cutting blades for long life and fast, flexible cutsTorch demolition, Double Duty Upgrade, metal cutting blades for long use and making tough cuts1 in. tall blade profile for straighter cutsDouble relief angle for reduced tooth stressMatrix II bi-metal teeth for greater durabilityDurable storage case that adjusts to hold up to 9 in. bladesJobsite durable storage case adjusts to hold up to 9 in. blades.",
  "attributes": [
    {
      "key": "Assembled Depth (in.)",
      "value": "1.5 in"
    },
    {
      "key": "Assembled Height (in.)",
      "value": "12 in"
    },
    {
      "key": "Assembled Width (in.)",
      "value": "7 in"
    },
    {
      "key": "Blade Length (In.)",
      "value": "9 in"
    },
    {
      "key": "Color Family",
      "value": "Red"
    },
    {
      "key": "Material Cut",
      "value": "Multi-Purpose"
    },
    {
      "key": "MFG Brand Name",
      "value": "Milwaukee"
    },
    {
      "key": "Number in Package",
      "value": "12"
    },
    {
      "key": "Number of Teeth",
      "value": "6"
    },
    {
      "key": "Power Tool Accessory Type",
      "value": "Blade"
    },
    {
      "key": "Power Tool Product Type",
      "value": "Power Tool Accessory"
    },
    {
      "key": "Saw Blade Material",
      "value": "BiMetal"
    },
    {
      "key": "Teeth Per Inch",
      "value": "Multiple"
    },
    {
      "key": "Tools Product Type",
      "value": "Power Tool"
    }
  ],
  "isDeleted": false
}