{
  "uid": 100344,
  "name": "\u0022InstallBay Garage PVC Slat Wall Kit with 10 Hooks\u0022",
  "description": "The InstallBay Garage Slat Wall delivers consistent color and a precision fit for a perfect installation every time. Lightweight, strong, durable and maintenance free, virgin PVC construction resists warping, bowing and is water and moisture resistant. Manufactured with a precision high heat extrusion process that ensures the highest standards aremet with every production run of slat wall and trim. Our PVC material is UV treated and the solid color design keeps scratches and dings from showing keeping the slat wall looking fresh and new over a long period of time. InstallBay Slat Wall utilizes an L-style slot instead of the traditional T-style design, this design difference keeps unwanted moisture, dust and debris from accumulating in the downward groove that is on most slat wall designs. The 3 in. on center slots are specifically designed to work with our complete line of locking S, J, Loop and standard hooks along with our baskets, shelves and bicycle racks and accommodate most slat wall hangers and hooks that are available in the market. InstallBay has designed, developed and patented the first hidden screw slat wall available on the market. Each panel utilizes a French cleat design that covers the screws from the previous 6 in. piece of slat wall, an industry first only from The InstallBay. Each panel can be screwed to the studs with a standard 2 in. drywall screw, no need for expensive matching painted head screws.Lite weight designIncludes 10-hooksHolds up to 1056 lbs. when fully anchored to the studs in the wallUtilizes a french cleat design that hides the mounting screwsClick here to learn more about garage organization",
  "attributes": [
    {
      "key": "Assembled Depth (in.)",
      "value": "2 in"
    },
    {
      "key": "Assembled Height (in.)",
      "value": "48 in"
    },
    {
      "key": "Assembled Width (in.)",
      "value": "48 in"
    },
    {
      "key": "MFG Brand Name",
      "value": "InstallBay Garage"
    },
    {
      "key": "Storage Product Type",
      "value": "Complete Storage Systems"
    }
  ],
  "isDeleted": false
}