{
  "uid": 100343,
  "name": "Lithonia Lighting LED Ceiling Wraparound Light - 4000 Lumens",
  "description": "The Flush Mount Ceiling White LED Wraparound Light from Lithonia Lighting provides bright, uniform general purpose illumination. It is cheaper to operate than incandescent and fluorescent lights and with a 50,000 hour average LED life, you won\u0027t have to worry about changing bulbs. The LEDs are conveniently integrated for ease of installation and maintenance. Luminous end caps soften the overall appearance for improved aesthetics. Ideal applications include general purpose lighting for garages, workshops, kitchens, utility rooms/spaces and corridors in commercial and residential environments.4000 LumensEnergy-efficient, cool-running LED technology saves you money on power billsAn acrylic prismatic lens wraps around the fixture to maximize light output and distributionDurable steel construction with a white finish and luminous end capsHigh-performance LEDs (4000K) have a 50,000 hour average lifeFor use with non-dimmable switches onlyMulti-volt driver (120 - 277-Volt)CSA listed for damp locationsHome Depot Protection Plan:",
  "attributes": [
    {
      "key": "Adjustable Lamp Head",
      "value": "No"
    },
    {
      "key": "Bulb Type Included",
      "value": "LED"
    },
    {
      "key": "Certifications and Listings",
      "value": "1-UL Listed,CSA Listed"
    },
    {
      "key": "ENERGY STAR Certified",
      "value": "No"
    },
    {
      "key": "Fixture Color/Finish",
      "value": "White"
    },
    {
      "key": "Fixture Color/Finish Family",
      "value": "White"
    },
    {
      "key": "Hardware Included",
      "value": "Yes"
    },
    {
      "key": "MFG Brand Name",
      "value": "Lithonia Lighting"
    },
    {
      "key": "Product Depth (in.)",
      "value": "48"
    },
    {
      "key": "Product Height (in.)",
      "value": "2.75"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "11"
    },
    {
      "key": "Product Width (in.)",
      "value": "10"
    },
    {
      "key": "Shade Color Family",
      "value": "Clear"
    },
    {
      "key": "Shade Material",
      "value": "Acrylic"
    },
    {
      "key": "Shape",
      "value": "Novelty/Specialty"
    }
  ],
  "isDeleted": false
}