{
  "uid": 100386,
  "name": "Wagner Smart Roller Pro",
  "description": "Eliminate back-bending trips to the paint tray while creating a smooth, professional finish on your walls. The Smart Roller is Wagner\u0027s ultimate all-in-one roller and paint container. Transform your home with a simple squeeze of the ratchet Power Trigger which feeds paint from the on-board reservoir right to your roller and onto your walls eliminating the need for those messy paint trays. The extended handle lets you reach 8 ft. ceilings with ease. Perfect for medium-sized interior projects.Plastic handle has an integrated paint reservoir that eliminates need for paint trayPolyester knit roller cover is compatible with water-based and oil-based paints and stainsInternally fed 9 in. x 3/8 in. roller provides continuous, even paint coveragePaint up to a 7 ft. x 10 ft. area in a single fill and ratchet trigger controls paint flowThe quick connect tabs make assembly easy and tool free and the included accessories make the product easy to fill, easy to use and easy to cleanKit includes 22 oz. reservoir, suction tube and paint can lid for easy filling, 9 in. internally fed roller for semi-smooth to smooth surfaces, and spatter shield to prevent overhead dripsTo learn more about Wagner products, click hereProduct may vary by store",
  "attributes": [
    {
      "key": "Accessories Included",
      "value": "Yes"
    },
    {
      "key": "Applicator/Tool Type",
      "value": "Roller"
    },
    {
      "key": "Batteries Included",
      "value": "No"
    },
    {
      "key": "Battery Type Required",
      "value": "nan"
    },
    {
      "key": "Handle length (ft.)",
      "value": "3"
    },
    {
      "key": "Maximum reach (ft.)",
      "value": "8"
    },
    {
      "key": "MFG Brand Name",
      "value": "Wagner"
    },
    {
      "key": "Number of Batteries Required",
      "value": "0"
    },
    {
      "key": "Paint capacity (gallons)",
      "value": "0.17"
    },
    {
      "key": "Paint coverage per fill (sq. ft.)",
      "value": "70"
    },
    {
      "key": "Paint Product Type",
      "value": "Applicator/Tool"
    },
    {
      "key": "Product Depth (in.)",
      "value": "3"
    },
    {
      "key": "Product Height (in.)",
      "value": "35.75"
    },
    {
      "key": "Product Length (in.)",
      "value": "3"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "4"
    },
    {
      "key": "Product Width (in.)",
      "value": "7.653"
    },
    {
      "key": "Roller Product Type",
      "value": "Power Rollers"
    },
    {
      "key": "Voltage (volts)",
      "value": "0"
    }
  ],
  "isDeleted": false
}