{
  "uid": 100334,
  "name": "Dremel FlexPro Drill Stand",
  "description": "It\u0027s a drill press, tool holder and flex shaft holder all in one. Drill accurate perpendicular and angled holes. Holds your tool in place for applications like sanding and buffing, and the telescoping flex shaft holder extends to any height between 16 in. and 29 in.Articulating drill press drills perpendicular and angled holes in 15 increments, up to 90 horizontalTool holder holds tool at 90s horizontal for tasks such as polishing metal objects, sanding different shapes and grinding metal piecesFlex shaft tool stand allows telescopic adjustment to any height between 16 in. and 29 in.Crow\u0027s nest provides on-board storage for drill bits, wrenches, and other Dremel accessoriesCord management clips - for safe storage of power cordsInch and metric marking on base for accurate drilling of work pieceDepth markings with depth stop for consistent depth adjustmentSturdy metal base with 4 clamping points to securely hold work pieceIncludes work station, attachment, mounting wrench, and instructions\u0022Click here to connect to the worlds most talented \u0026 novice DIYers in one community. Share, Learn, Connect, and Inspire. Craft. Fix. Build. Join Now\u0022",
  "attributes": [
    {
      "key": "Application Type",
      "value": "Cutting,Drilling,Grinding,Mortising,Polishing,Sanding,Scraping,Sharpening"
    },
    {
      "key": "Color Family",
      "value": "Silver"
    },
    {
      "key": "Individual/Set",
      "value": "Individual"
    },
    {
      "key": "MFG Brand Name",
      "value": "Dremel"
    },
    {
      "key": "Number of Pieces",
      "value": "1"
    },
    {
      "key": "Power Tool Accessory Type",
      "value": "Rotary Tool Accessory"
    },
    {
      "key": "Power Tool Product Type",
      "value": "Power Tool Accessory"
    },
    {
      "key": "Product Depth (in.)",
      "value": "7.7"
    },
    {
      "key": "Product Height (in.)",
      "value": "14"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "5.58"
    },
    {
      "key": "Product Width (in.)",
      "value": "8"
    },
    {
      "key": "Tools Product Type",
      "value": "Power Tool"
    }
  ],
  "isDeleted": false
}