{
  "uid": 100301,
  "name": "Bali Cut-to-Size PVC Vertical Louvers - Sula Whisper",
  "description": "Make wide windows or patio doors beautiful and functional with the Bali Cut-to-Size PVC louvers. The louvers can be trimmed to fit your window and can be washed to help provide easy maintenance. Room darkening louvers make them ideal for bedrooms or any room where more privacy and light control is desired.3.5 in. W x 84 in. LFits windows: 84 in. LDurability and style of our Bali Cut-to-Size Vinyl Vertical blinds make them ideal for any location, including those with high humidity, such as kitchens, bathrooms and laundry roomsVinyl louvers offer value, durability, easy cleaning and superior light controlSpare louvers can also be used for the valance insert for the vertical head rail (sold separately)3.5 in. wide louversIf purchasing a 44 in. - 60 in. wide head rail, you will need 2 louver packsIf purchasing a 61 in. - 78 in. wide head rail, you will need 3 louver packsIf purchasing a 79 in. - 104 in. wide head rail, you will need 4 louver packsSame color front and backNeutral colors to enhance any decorIf your louver length includes the height of the vertical head rail you will need to deduct 2 in. from your total louver lengthBali Cut-to-size available in store or onlineWhile our product images represent the product as accurately as possible, please note that different screen monitor settings may create a color varianceNot sure what size to buy? Click here to download a printable window treatment measuring guide!WARNING: The cords on this product present a potential strangulation hazard. For child and pet safety, consider cordless alternatives or products with inaccessible cords. To access a copy of the warning label, see additional images.Learn more about child and pet safety.",
  "attributes": [
    {
      "key": "Actual Blind/Shade Width (In.)",
      "value": "3.5"
    },
    {
      "key": "Arched",
      "value": "No"
    },
    {
      "key": "- Fits windows",
      "value": "84 in. L"
    },
    {
      "key": "- \u003Cb\u003EWARNING",
      "value": "\u003C/b\u003E The cords on this product present a potential strangulation hazard. For child and pet safety, consider cordless alternatives or products with inaccessible cords. To access a copy of the warning label, see additional images."
    },
    {
      "key": "Certifications and Listings",
      "value": "ANSI Certified"
    },
    {
      "key": "Color Family",
      "value": "White"
    },
    {
      "key": "Color/Finish",
      "value": "Sula Whisper"
    },
    {
      "key": "Cordless/Corded",
      "value": "Cordless"
    },
    {
      "key": "Decor Product Type",
      "value": "Window Treatment"
    },
    {
      "key": "Enclosure Type",
      "value": "No Enclosure"
    },
    {
      "key": "Features",
      "value": "Fade resistant,Routless,Washable"
    },
    {
      "key": "Fire retardant",
      "value": "No"
    },
    {
      "key": "Front Color",
      "value": "Sula Whisper"
    },
    {
      "key": "Included",
      "value": "No Additional Items Included"
    },
    {
      "key": "Light Control",
      "value": "Room Darkening"
    },
    {
      "key": "Material",
      "value": "PVC"
    },
    {
      "key": "MFG Brand Name",
      "value": "Bali Cut-to-Size"
    },
    {
      "key": "Minimum window depth required (in.)",
      "value": "2.75"
    },
    {
      "key": "Mount Type",
      "value": "Inside/Outside"
    },
    {
      "key": "Opening type",
      "value": "Side to side"
    },
    {
      "key": "Orientation",
      "value": "Vertical"
    },
    {
      "key": "Pre-Cut Deduction (in.)",
      "value": "0"
    },
    {
      "key": "Pre-Cut or True-to-Size Blind",
      "value": "True-to-Size"
    },
    {
      "key": "Product Length (in.)",
      "value": "84"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "3.9"
    },
    {
      "key": "Product Width (in.)",
      "value": "3.5"
    },
    {
      "key": "Size Ordering Options",
      "value": "Cut to Width"
    },
    {
      "key": "Slat/vane width (in.)",
      "value": "3"
    },
    {
      "key": "Stain Resistant",
      "value": "No"
    },
    {
      "key": "Surface",
      "value": "Smooth"
    },
    {
      "key": "Washable",
      "value": "Yes"
    },
    {
      "key": "Width (in) x Length (in)",
      "value": "3.5 x 84"
    },
    {
      "key": "Window Treatment Product Type",
      "value": "Vertical Blind/Shade"
    }
  ],
  "isDeleted": false
}