{
  "uid": 100491,
  "name": "Weber Performer Deluxe 22 in. Charcoal Grill with Cart",
  "description": "Get the same high-performance kettle grill that is synonymous with the Weber name, now outfitted with a heavy-duty steel cart, push-button ignition system, side table, charcoal bin and LCD timer. The Weber Performer Deluxe 22 in. charcoal grill in green also boasts the Tuck-Away lid holder that acts as a pair of extra hands to cradle the lid while you tend to the main course. The cooking platform is a 363 sq. in. Gourmet BBQ System hinged cooking grate with a removable center section that accommodates separately-sold Weber cooking components. After you\u0027ve feasted on a finger-licking meal, simply pivot the three damper blades in the kettle basin to funnel charcoal dust into the removable ash catcher underneath.California residents: see\u0026nbsp;Proposition 65 informationGourmet BBQ System hinged plated-steel cooking grate has a 363 sq. in. cooking area, compatible with other BBQ System separately-sold cookware (wok, griddle, sear grate, pizza stone)Includes electronic Touch-N-Go gas ignition system; uses separately-sold 14.1 oz. or 16.4 oz. disposable liquid propane canistersSteel cart frame includes: (1) Char-Bin weather-protected charcoal container, (1) removable LCD timer, (3) tool hooks, (1) wire bottom rack, (1) painted metal side table, (2) locking caster wheels and (2) all-weather 8 in. rubber-molded wheelsPortable backlit LCD cook timer displays countdown time; take it with you or secure it to the grill cartGreen Performer Deluxe 22 in. kettle and lid constructed with high-grade porcelain-enamelIncludes One-Touch Cleaning System with 3 aluminized steel rust-resistant dampers, which regulate airflow while cooking and sweep ash after grillingIncludes large-capacity removable ash catcher to easily dispose of coal ashesLid has a handle with heat shield, built-in thermometer and adjustable damper with 4 air ventsIncludes: (2) Char-Basket charcoal holders for indirect heat grilling, (1) Tuck-Away lid holder, and (1) steel charcoal grate10-year limited warranty on lid, bowl and center ringHome Depot Protection Plan:",
  "attributes": [
    {
      "key": "Assembled Depth (in.)",
      "value": "28.5 in"
    },
    {
      "key": "Assembled Height (in.)",
      "value": "40 in"
    },
    {
      "key": "Assembled Width (in.)",
      "value": "50.25 in"
    },
    {
      "key": "- Steel cart frame includes",
      "value": "(1) Char-Bin weather-protected charcoal container, (1) removable LCD timer, (3) tool hooks, (1) wire bottom rack, (1) painted metal side table, (2) locking caster wheels and (2) all-weather 8 in. rubber-molded wheels"
    },
    {
      "key": "- Includes",
      "value": "(2) Char-Basket charcoal holders for indirect heat grilling, (1) Tuck-Away lid holder, and (1) steel charcoal grate"
    },
    {
      "key": "Certifications and Listings",
      "value": "ANSI Certified,CSA Listed"
    },
    {
      "key": "Color",
      "value": "Green"
    },
    {
      "key": "Color Family",
      "value": "Green"
    },
    {
      "key": "Cooking space (sq. in.)",
      "value": "363"
    },
    {
      "key": "Grill Assembly",
      "value": "Full Assembly Required"
    },
    {
      "key": "Grill Color Family",
      "value": "Green"
    },
    {
      "key": "Grill Features",
      "value": "Heat Thermometer,Removable Ash Catcher,Storage Rack,Tool Holder,Warming Rack"
    },
    {
      "key": "Grill Grate Material",
      "value": "Chrome-Plated Steel"
    },
    {
      "key": "Grill Material",
      "value": "Porcelain"
    },
    {
      "key": "Grill/Smoker Fuel Type",
      "value": "Charcoal"
    },
    {
      "key": "Ignition Type",
      "value": "Electrical"
    },
    {
      "key": "MFG Brand Name",
      "value": "Weber"
    },
    {
      "key": "Outdoor Living Product Type",
      "value": "Charcoal/Wood Grill"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "96"
    }
  ],
  "isDeleted": false
}