{
  "uid": 100498,
  "name": "Wilsonart Breccia Stone Laminate Countertop Sheets",
  "description": "Wilsonart\u0027s 48 in. x 96 in. Breccia Nouvelle Laminate Sheets provide enduring beauty like no other surfacing product. And, whatever pattern and color you choose for your kitchen countertop, bathroom vanity, laundry room or garage worktop, the beauty and easy maintenance will be yours at a price you can celebrate.  A new look is yours for less, leaving you with more to spend on special extras.Wilsonart\u0027s breccia nouvelle offers the look of a rich stone composed of various broken fragments of brown, black and sienna minerals accented with white quartzBreccia nouvelle can only be purchase at The Home DepotWilsonart premium laminates are enhanced with a specially engineered finish that adds lustrous depth and strengthens the surfaceLaminate countertops are famous for easy care and superior performanceA new Wilsonart laminate countertop, all by itself, can transform your kitchen without major remodelingStart your kitchen design today with our Kitchen PlannerGet a free quote with our Countertop Estimator",
  "attributes": [
    {
      "key": "Antimicrobial",
      "value": "No"
    },
    {
      "key": "Color Family",
      "value": "Black"
    },
    {
      "key": "Color/Finish",
      "value": "A stone composed of fragments of brown, black, and grey minerals accented with white quartz"
    },
    {
      "key": "High Temperature Resistance",
      "value": "Warranty does not cover exposure to extreme temperatures."
    },
    {
      "key": "Kitchen Product Type",
      "value": "Laminate Sheets for Countertops"
    },
    {
      "key": "Laminate Style",
      "value": "Stone Look"
    },
    {
      "key": "Material",
      "value": "Laminate"
    },
    {
      "key": "MFG Brand Name",
      "value": "Wilsonart"
    },
    {
      "key": "Product Depth (in.)",
      "value": "96"
    },
    {
      "key": "Product Height (in.)",
      "value": "0.039"
    },
    {
      "key": "Product Length (in.)",
      "value": "96"
    },
    {
      "key": "Product Thickness (in.)",
      "value": ".039 in"
    },
    {
      "key": "Product Width (in.)",
      "value": "48"
    },
    {
      "key": "Scratch Resistant",
      "value": "No"
    },
    {
      "key": "Stain Resistant",
      "value": "Yes"
    }
  ],
  "isDeleted": false
}