{
  "uid": 100494,
  "name": "Ultra Protect Clear Polycarbonate Aluminum Basement Window Well Cover",
  "description": "The \u0022Ultra Protect\u0022 basement window well covers are designed with \u0022Safety\u0022 \u0026 \u0022Security\u0022 for your home and family in mind. These versatile basement window well covers are manufactured using virtually indestructible clear polycarbonate plastic riveted to a continuous structural grade aluminum angle rear support. These basement window well covers will support a minimum of 250 lbs when properly installed using our patented SAF-T Locking System that is included with each \u0022Ultra Protect\u0022 window well cover. Installing these basement window well covers over your basement window wells minimizes the risk of persons falling into deep, uncovered, unprotected basement window wells, preventing possible injury. The model RT536 (53 in. x 37 in.) basement window well cover is designed for use over Rectangular shaped Egress basement window wells. Its versatility makes it possible to be installed and trimmed to the profile of any type (steel, plastic, brick, wood tie, concrete etc.) basement window wells also known as \u0022Area Walls\u0022. Once installed it can be trimmed to the profile (plus up to a 1 in. overhang around the perimeter) of the window well openings using an ordinary jigsaw with an aluminum cutting blade (10 to 14 teeth per in. blade for best results)to make for a perfect fit window well cover. A patented, solid steel locking system with pull pin release quickly unlocks the basement window well covers (without the use of a tool, required by code) from inside the basement window well.Basement window wells are the #1 entry point for home burglaries, deter intruders with \u0022Ultra Protect\u0022 basement window well coversMade with durable UV protected clear polycarbonate plastic and high strength structural grade aluminumInstallation hardware includes our patented \u0026 secure SAF-T Lock locking system to help keep your home safe and secureSupports a minimum of 250 lbs. when installed using our SAF-T lock locking system (included)21 stock sizes to choose fromCan be trimmed to the profile of any shape or type window well for a perfect fitWhen choosing an Ultra Protect basement window well cover be sure to choose a cover large enough to be cut to the size \u0026 profile plus a minimum 1/2 in. overhang of the window wellDurable and lightweight so even young children can lift cover off and escape in case of emergencyKeeps out unwanted animals, debris and precipitationMeets or exceeds IBC \u0026 IFC building codesLimited lifetime guarantee",
  "attributes": [
    {
      "key": "Hardware Included",
      "value": "Yes"
    },
    {
      "key": "Light transmittal",
      "value": "Yes"
    },
    {
      "key": "Locking system",
      "value": "Yes"
    },
    {
      "key": "Material",
      "value": "Plastic"
    },
    {
      "key": "MFG Brand Name",
      "value": "Ultra Protect"
    },
    {
      "key": "Product Depth (in.)",
      "value": "37"
    },
    {
      "key": "Product Height (in.)",
      "value": "1"
    },
    {
      "key": "Product Length (in.)",
      "value": "37"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "18"
    },
    {
      "key": "Product Width (in.)",
      "value": "53"
    },
    {
      "key": "Thickness (In.)",
      "value": "1/8"
    },
    {
      "key": "Weight Capacity (lb.)",
      "value": "250"
    },
    {
      "key": "Window Well Part",
      "value": "Cover"
    }
  ],
  "isDeleted": false
}