{
  "uid": 100476,
  "name": "TRIXIE Log Cabin Dog House with Adjustable Feet",
  "description": "Give your pet a place to escape the elements with TRIXIE\u0027s Log Cabin Dog House with peaked roof. Our solid pine construction and use of the finest materials means this shelter will endure years of use with very little maintenance. Benefits include a draft resistant tongue-and-groove exterior that is finished out with a weatherproof sealer both inside and out. The A-frame style roof is covered with durable composite shingles. The adjustable, extra-high plastic-tipped feet allow you to level the house on uneven ground and also provide extra circulation underneath. This will help keep the floor cool in the summer and warm/dry in the winter. TRIXIE has also provided a removable floor for easy cleaning, a unique feature not found in many other dog houses. This shelter is suitable for large/XL breed dogs weighing up to 95 lbs. (ex: Golden Retriever). Compatible with TRIXIE\u0027s plastic dog door (Item #39593) which is sold separately. Quick and easy assembly. One year warranty. Dimensions (inches): 38 in. x 44 in. x 41 in., door opening 15 in. x 22 in., Weight: 66 lbs.Weatherproof solid pine construction with draft resistant tongue and groove designRaised floor allows air to circulate below keeping the floor dry and comfortable, removable for easy cleaningAdjustable feet to level shelter on uneven groundTRIXIE\u0027s plastic dog door sold separately as item #39591Suitable for small breed dogs weighing up to 95 lbs. such as a golden retriever",
  "attributes": [
    {
      "key": "Material",
      "value": "Wood"
    },
    {
      "key": "MFG Brand Name",
      "value": "TRIXIE"
    },
    {
      "key": "Pet Size",
      "value": "Medium to Large"
    },
    {
      "key": "Product Depth (in.)",
      "value": "44"
    },
    {
      "key": "Product Height (in.)",
      "value": "41.25"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "65.81"
    },
    {
      "key": "Product Width (in.)",
      "value": "37.75"
    }
  ],
  "isDeleted": false
}