{
  "uid": 100464,
  "name": "Grace MetalGuard Waterproofing Underlayment",
  "description": "Grace Ice \u0026 Water Shield HT fully-adhered, smooth surface roofing underlayment is specifically designed for high temperature applications such as metal roof assemblies. It delivers all the advantages of Grace Ice \u0026 Water Shield roofing underlayment with thermal stability metal roofs require. Not all high temperature roofing underlayments are the same. Grace Ice \u0026 Water Shield HT is an excellent high temperature ice and water barrier that follows in the footsteps of the original Ice \u0026 Water Shield, but is specially formulated to meet the higher service temperatures that are inherent to metal roofing systems. Grace Ice \u0026 Water Shield HT is formulated with a proprietary adhesive with temperature resistance of up to 260F. The membrane forms a watertight bond to the roof deck, and seals around fasteners to around the nail of the primary roof covering and thus maintains its waterproof integrity on the roof deck. It also creates a strong bond to the roof deck. Grace Ice \u0026 Water Shield HT delivers optimal balance of adhesion and thermal stability for superior performance under the most demanding conditions.Temperature resistance up to 260 F: Provides premium waterproofing for metal roofs120 day exposure: Delivers consistent performance over long, unpredictable construction cyclesStrong adhesion to the roof deck: Helps ensure a watertight seal, protecting roofs from harsh weather conditionsHigh quality seal around roofing nails: Delivers strong roof leak protection; providing peace of mind against costly call backsForms superior laps: Provides watertight installation with no special treatment of the lapsDual barrier protection - rubberized asphalt is combined with polymeric film to form two waterproofing barriers providing maximum protectionDelivers optimum balance of adhesion and thermal stability for superior performance under the most demanding conditionsProtects under all standard sloped roof coverings - Grace Ice \u0026 Water Shield HT protects under slate, tile, cedar shakes, metal and conventional asphalt shinglesProtects roofs from wind driven rain and ice dams",
  "attributes": [
    {
      "key": "- Temperature resistance up to 260° F",
      "value": "Provides premium waterproofing for metal roofs"
    },
    {
      "key": "- 120 day exposure",
      "value": "Delivers consistent performance over long, unpredictable construction cycles"
    },
    {
      "key": "- Strong adhesion to the roof deck",
      "value": "Helps ensure a watertight seal, protecting roofs from harsh weather conditions"
    },
    {
      "key": "- High quality seal around roofing nails",
      "value": "Delivers strong roof leak protection; providing peace of mind against costly call backs"
    },
    {
      "key": "- Forms superior laps",
      "value": "Provides watertight installation with no special treatment of the laps"
    },
    {
      "key": "Color Family",
      "value": "Black"
    },
    {
      "key": "Commercial / Residential",
      "value": "Commercial / Residential"
    },
    {
      "key": "Coverage Area (sq. ft.)",
      "value": "225"
    },
    {
      "key": "MFG Brand Name",
      "value": "Grace"
    },
    {
      "key": "Product Depth (in.)",
      "value": "1.5748"
    },
    {
      "key": "Product Height (in.)",
      "value": "900"
    },
    {
      "key": "Product Width (in.)",
      "value": "36"
    },
    {
      "key": "Roofing Product Type",
      "value": "Underlayment"
    },
    {
      "key": "Texture",
      "value": "Smooth"
    },
    {
      "key": "Thickness (In.)",
      "value": ".040"
    },
    {
      "key": "Unrolled length (ft.)",
      "value": "75"
    }
  ],
  "isDeleted": false
}