{
  "uid": 100424,
  "name": "RIDGID JobMax 3 Amp Multi-Tool Kit - PowerPro Accessory Set",
  "description": "The RIDGID JobMax 3 Amp Multi-Tool provides a powerful corded base and convenient system for attachment heads that help you get the job done. Its compact, 2.4 lb. size is great for cutting, sanding and scraping in even the tightest areas. It easily accepts all popular multi-tool accessories with the included universal adaptor.California residents: see\u0026nbsp;Proposition 65 informationIncludes power handle, multi-tool attachment, segment blade, wood blade, 2 drive gear covers, sanding pad, 5-piece of sandpaper, universal adaptor, Allen wrench and a heavy duty contractor\u0027s bagPowerful 3 Amp motor provides 0-20,000 OPMs for varying applicationsVariable speed trigger lets you control the speed you need for the application2-finger trigger for extended use and innovative micro-textured hex grip for security and comfortLED light illuminates the work area4 directional head positions let you adjust for better accessTool-free, quick connect interface: easily attach and detach the right head for the job3-year warranty and lifetime service agreement with tool registrationCLICK HERE TO REGISTER YOUR RIDGID PRODUCT.",
  "attributes": [
    {
      "key": "Accessory Change System",
      "value": "Accessory change system is completed with the assistance of an allen wrench"
    },
    {
      "key": "Accessory Compatibility",
      "value": "Accepts all popular multi-tool accessories"
    },
    {
      "key": "- Tool-free, quick connect interface",
      "value": "easily attach and detach the right head for the job"
    },
    {
      "key": "Certifications and Listings",
      "value": "1-UL Listed"
    },
    {
      "key": "Color Family",
      "value": "Orange"
    },
    {
      "key": "Cord Length (ft.)",
      "value": "8"
    },
    {
      "key": "Corded Tool Type",
      "value": "Specialty"
    },
    {
      "key": "Cordless/Corded",
      "value": "Corded"
    },
    {
      "key": "MFG Brand Name",
      "value": "RIDGID"
    },
    {
      "key": "Oscillation Arc Range (Degrees)",
      "value": "3"
    },
    {
      "key": "Oscillations Per Minute (OPM)",
      "value": "20,000"
    },
    {
      "key": "Power Tool Features",
      "value": "Bag Included"
    },
    {
      "key": "Power Tool Product Type",
      "value": "Corded"
    },
    {
      "key": "Product Depth (in.)",
      "value": "13.3 in"
    },
    {
      "key": "Product Height (in.)",
      "value": "9.1 in"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "4.6"
    },
    {
      "key": "Product Width (in.)",
      "value": "3.6 in"
    },
    {
      "key": "Reconditioned",
      "value": "No"
    },
    {
      "key": "Tools Product Type",
      "value": "Power Tool"
    }
  ],
  "isDeleted": false
}