{
  "uid": 100467,
  "name": "Rust-Oleum LeakSeal White Rubberized Spray",
  "description": "Rust-Oleum LeakSeal White Spray is an easy to use, rubberized protective utility coating designed to fill and seal leaks and cracks. It provides a water-tight, flexible seal that prevents moisture penetration, rust, and corrosion. LeakSeal dries to a semi-smooth, firm finish that will not sag or drip, and can be top-coated with latex or oil based paints.California residents: see\u0026nbsp;Proposition 65 informationA durable, rubberized utility coating designed to fill and seal leaks and cracksEasy to use, limited overspray, multi-surface/multi-purpose use, for use on metal, aluminum, galvanized metal, PVC, concrete, masonry, asphalt roofing materials, vinyl siding, fiberglass and moreDry time to the touch in approximately 2 hours and cures after 24 hours12-oz. can provides coverage is can be up to 10 sq. ft. depending on the surface porosityCan be top-coated with latex or oil based paintsFlat/matte finish will not reflect lightRust and moisture resistant applies for superior protection from leaks and cracksWithstands extreme temperatures and climatesProvides ultimate UV protectionPrevents water and moisture penetration for ultimate protection",
  "attributes": [
    {
      "key": "Coating Product Category",
      "value": "Paint"
    },
    {
      "key": "Container Size",
      "value": "12 OZ-Ounce"
    },
    {
      "key": "Coverage Area (sq. ft.)",
      "value": "10"
    },
    {
      "key": "Dry to touch (min.)",
      "value": "30"
    },
    {
      "key": "MFG Brand Name",
      "value": "Rust-Oleum Stops Rust"
    },
    {
      "key": "Paint Product Type",
      "value": "Patching and Repair Product"
    },
    {
      "key": "Paint/Stain Clean Up",
      "value": "Mineral Spirits"
    },
    {
      "key": "Paint/Stain Key Features",
      "value": "No additional features"
    },
    {
      "key": "Sheen",
      "value": "Flat/Matte"
    },
    {
      "key": "Tint Base",
      "value": "Base 1"
    },
    {
      "key": "Tintable",
      "value": "No"
    },
    {
      "key": "Transparency",
      "value": "Solid"
    }
  ],
  "isDeleted": false
}