{
  "uid": 100426,
  "name": "Milwaukee PowerMax 11-Amp Angle Grinder Kit",
  "description": "The Milwaukee 11-Amp 4-1/2 in. Angle Grinder offers a unique combination of maximum power, performance and durability. With a 1400 max watts out motor that powers through the toughest jobs, this angle grinder is easy to use with single hand operation, is well balanced and has an ergonomic design for comfortable use no matter how long your job lasts. Milwaukee\u0027s Electronic Advantage includes overload protection to maximize motor life, an electronic clutch that extends tool life and helps prevent bind-up, line lock-out to prevent automatic start-up after power loss and soft start. Featuring a 100% tool-free design, you can change all accessories, including hubbed products, while the burst resistant and adjustable guard, allows you to make quick guard installations and adjustments for less downtime.Powerful 11-amp, 11,000 RPM motor provides maximum performance and durabilityOverload protection maximizes motor lifeElectronic clutch extends tool life and prevents bind-upTool-free accessory change for easy change of all accessories without a wrenchTool-free adjustable guard provides quick guard installations and adjustmentsAdvanced airflow system maximizes airflow and reduces debris ingress for improved motor life and performanceDebris baffles protect internal components by deflecting damaging debris out of the airflow at the intake ventsCompatible with multiple grinder guards and flangesAdjustable handle position for user comfortIncludes: 11-Amp 4-1/2 in. Angle Grinder,  Contractor Bag, Flange, Grinding Wheel, Side Handle, Spanner Wrench and Type 27 Guard5-year limited tool warrantyHome Depot Protection Plan:",
  "attributes": [
    {
      "key": "Amperage (amps)",
      "value": "11"
    },
    {
      "key": "Arbor Size",
      "value": "5/8 in.-11 in."
    },
    {
      "key": "- Includes",
      "value": "11-Amp 4-1/2 in. Angle Grinder,  Contractor Bag, Flange, Grinding Wheel, Side Handle, Spanner Wrench and Type 27 Guard"
    },
    {
      "key": "Certifications and Listings",
      "value": "1-UL Listed,CSA Listed,ETL Listed"
    },
    {
      "key": "Color Family",
      "value": "Red"
    },
    {
      "key": "Cord Length (ft.)",
      "value": "8"
    },
    {
      "key": "Corded Tool Type",
      "value": "Angle Grinder"
    },
    {
      "key": "Cordless/Corded",
      "value": "Corded"
    },
    {
      "key": "Grinding Wheel Included",
      "value": "Yes"
    },
    {
      "key": "Maximum Speed (rpm)",
      "value": "11000"
    },
    {
      "key": "MFG Brand Name",
      "value": "Milwaukee"
    },
    {
      "key": "Power Tool Product Type",
      "value": "Corded"
    },
    {
      "key": "Product Depth (in.)",
      "value": "4.5"
    },
    {
      "key": "Product Height (in.)",
      "value": "7.72"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "8.16"
    },
    {
      "key": "Product Width (in.)",
      "value": "15.29"
    },
    {
      "key": "Reconditioned",
      "value": "No"
    },
    {
      "key": "Side Handle",
      "value": "Yes"
    },
    {
      "key": "Spindle Lock",
      "value": "Yes"
    },
    {
      "key": "Tools Product Type",
      "value": "Power Tool"
    },
    {
      "key": "Variable Speed",
      "value": "No"
    },
    {
      "key": "Wheel Diameter (in.)",
      "value": "4.5 in"
    }
  ],
  "isDeleted": false
}