{
  "uid": 100414,
  "name": "Arke Karina Loft Staircase Kit - Adjustable, Space-saving, Steel",
  "description": "The space-saving design of the Karina model makes it the ideal staircase to use in replacement of the traditional pull-down attic stairs when converting an attic into a loft, office, or bedroom. It is available in 3 colors - black, white, and grey - powder-coat finish - ready to install. The standard Karina staircase kit is adjustable in height from a range of 6 ft. 10 1/4 in. to 9 ft. 3 in. and with two additional risers (right footed), can be extended to a maximum height of 10 ft. 9 1/4 in. The Karina comes with a handrail for one side. A second-side handrail is available as an optional accessory if needed. The Karina stair treads are manufactured from European beech wood, finished with a light natural stain and clear coat protective sealer. An alternating tread design (right-step/left-step) allows for installation in very limited spaces. This kit can be installed in 4 different configurations. To complete your project, a balcony rail kit is available. Riser bars are available in a set of 20 to close off the back of the treads. Each Karina staircase kit is shipped complete with detailed assembly instructions and a DVD to assist in your installation.Supporting structure made from steel11 clear-sealed, alternating treadsBlack powder-coat finishSpace-saving design is ideal for small areas and attic/loft conversionsAdjustable heightIncludes assembly instructions and DVDImportant: consult your local building inspector for specifics regarding compliance with the local building codes",
  "attributes": [
    {
      "key": "- Important",
      "value": "consult your local building inspector for specifics regarding compliance with the local building codes"
    },
    {
      "key": "Hardware Included",
      "value": "Yes"
    },
    {
      "key": "Interior/Exterior",
      "value": "Interior"
    },
    {
      "key": "Material",
      "value": "Steel"
    },
    {
      "key": "MFG Brand Name",
      "value": "Arke"
    },
    {
      "key": "Package Contents",
      "value": "All-in-one complete unit: 11 alternating treads, balusters, handrails, hardware and accessories included, nothing to paint, weld, stain or seal  In stock for immediate delivery to most US."
    },
    {
      "key": "Product Depth (in.)",
      "value": "62"
    },
    {
      "key": "Product Height (in.)",
      "value": "111"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "257"
    },
    {
      "key": "Product Width (in.)",
      "value": "22.5"
    },
    {
      "key": "Stair Part Type",
      "value": "Kit"
    }
  ],
  "isDeleted": false
}