{
  "uid": 100482,
  "name": "NuMax Straight Finish Nailer Kit with Adjustable Exhaust Port",
  "description": "The NuMax Pneumatic 16-Gauge x 2-1/2 in. Strip Straight Finish Nailer features a top-loading, aluminum magazine which is great for a variety of fastening jobs. The nail depth can be adjusted without the need of any tools for driving nails ranging from 1 in. to 2 1/2 in. The nailer is designed for convenience with a no-mar tip that helps protect work surfaces and a 360 adjustable exhaust port to stop exhaust air from blowing on you.Top loading, straight magazineQuick-release nose70-110 PSI operating pressureNo-mar tip protects work surfaceTool-free depth adjustment360 adjustable exhaust port directs exhaust away from your faceDust cap helps keeps tool cleanDie-cast aluminum construction is durable while still lightweightFor applications such as molding, casing, door installation, base shoes, chair rails, hand railings and craft workDrives 3/4 - 2-1/2 in. nailsPadded grip allows extended use without fatigueIncludes oil and wrenchesNuMax 1 year limited warrantyNeed help? CLICK HERE to view our Nail Gun Buying GuideHome Depot Protection Plan:",
  "attributes": [
    {
      "key": "Air Tool Type",
      "value": "Air Nailer"
    },
    {
      "key": "Compressor/Air Tool Features",
      "value": "Adjustable Exhaust Port,Fastener Depth Control"
    },
    {
      "key": "Energy Type",
      "value": "Air"
    },
    {
      "key": "Included",
      "value": "No additional components or accessories are included"
    },
    {
      "key": "Loading type",
      "value": "Strip"
    },
    {
      "key": "Maximum Fastener Size",
      "value": "2-1/2 in"
    },
    {
      "key": "MFG Brand Name",
      "value": "NuMax"
    },
    {
      "key": "Minimum Fastener Size",
      "value": "1 in"
    },
    {
      "key": "Minimum Recommended Air Delivery SCFM @ 90PSI",
      "value": "2"
    },
    {
      "key": "Minimum Recommended Operating Pressure (psi)",
      "value": "70"
    },
    {
      "key": "Nail Gauge",
      "value": "16"
    },
    {
      "key": "Nailgun Angle",
      "value": "0"
    },
    {
      "key": "Product Depth (in.)",
      "value": "3"
    },
    {
      "key": "Product Height (in.)",
      "value": "11.5"
    },
    {
      "key": "Product Width (in.)",
      "value": "11.5"
    },
    {
      "key": "Reconditioned",
      "value": "No"
    },
    {
      "key": "Tools Product Type",
      "value": "Air Tool"
    }
  ],
  "isDeleted": false
}