{
  "uid": 100465,
  "name": "Pet Squeak Arf Frame Dog House - Small/Medium Size",
  "description": "The Arf Frame Dog House is a Real Wood Home for your woofer. One of Pet Squeak\u0027s most popular Dog Houses, the Arf Frame provides your pet their own comfortable habitat. The Arf Frame Dog House is a \u0022close fitting\u0022 habitat for many breeds of dog who prefer a tighter den. If your dog requires more space, consider purchasing this house in the next larger size. The primary wood in Pet Squeak Dog Houses is Cunninghamia Lanceolata, commonly referred to as \u0022White Cedar\u0022 or \u0022Stained Whitewood\u0022. This special wood is renowned for it\u0027s strong fresh aroma, pest resistance and appearance. All our dog houses are sealed using non-toxic, pet safe sealer. You may also paint over the finish to customize the Dog House to your liking. Overall external dimension is inclusive of the roof, which will have an overhang.Easy assemblySolid wood, fir constructionLightweight and durableRaised floorNaturally weather-resistantNon toxicSheet lined inner-roofExample size of dog suitable for this house: up to 15 lbs. ChihuahuaInternal: 17 in. W x 16 in. D x 17 in. HDoor opening: 7.75 in. W x 10.25 in. H",
  "attributes": [
    {
      "key": "- Example size of dog suitable for this house",
      "value": "up to 15 lbs. Chihuahua"
    },
    {
      "key": "- Internal",
      "value": "17 in. W x 16 in. D x 17 in. H"
    },
    {
      "key": "- Door opening",
      "value": "7.75 in. W x 10.25 in. H"
    },
    {
      "key": "Material",
      "value": "Wood"
    },
    {
      "key": "MFG Brand Name",
      "value": "Pet Squeak"
    },
    {
      "key": "Pet Size",
      "value": "Small to Medium"
    },
    {
      "key": "Product Depth (in.)",
      "value": "22"
    },
    {
      "key": "Product Height (in.)",
      "value": "22.75"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "16"
    },
    {
      "key": "Product Width (in.)",
      "value": "22.25"
    }
  ],
  "isDeleted": false
}