{
  "uid": 100439,
  "name": "Timber-Bilt Knightsbridge Backyard Playset with Rapid-Loc Installation",
  "description": "The Timber-Bilt Knightsbridge Ready-to-Assemble Playset comes with all the lumber, accessories and hardware needed to build a backyard experience your children will enjoy. The Knightsbridge tower features a large 22 sq. ft. deck designed with a clubhouse style play area, a crow\u0027s nest, and plenty of space below to play or add a sandbox. The tower also features many other activities like a rock climbing wall, 8 ft. alpine slide, climbing ladder, and a discovery picnic table that will keep your family in the backyard for hours. The swing comes with 2 standard swing seats and vinyl-dipped chain to protect your child\u0027s hands, and a wind rider glider for the best swing experience a kid can have. The design includes the Rapid-Loc bracket system for quick installation and features durable wood, steel and plastic construction. All Timber-Bilt Swing-N-Slide Playsets meet or exceed all ASTM standards for backyard play. The Knightsbridge set will transform your backyard into an safe outdoor area your children will enjoy for years to come.Includes 2 swings, 1 wind rider glider, an 8-rock climbing wall, discovery picnic table and bench and an alpine wave slideAlpine wave slide for a fun ride8-rock climbing wall is fun for kids to scale22 sq. ft. play deck is 5 ft. off the ground and provides plenty of room to playFramed window and arched gable detail look great in your yardDiscovery picnic table and bench offer plentiful seatingWood, plastic and steel construction for durabilityComes ready to assemble with lumber, accessories and hardwareRapid-loc bracket system for quick installationMeets and exceeds American society of testing materials (ASTM) safety standardsFor private backyard use only, do not use in public settingsAll Swing-N-Slide products are designed for single family residential use only, the item cannot be shipped to a commercial ship to address or used in a commercial setting.Save on shipping today. Only at the Home Depot:Note: Product may vary by store",
  "attributes": [
    {
      "key": "Assembled Depth (in.)",
      "value": "156 in"
    },
    {
      "key": "Assembled Height (in.)",
      "value": "132 in"
    },
    {
      "key": "Assembled Width (in.)",
      "value": "216 in"
    },
    {
      "key": "Assembly Required",
      "value": "Yes"
    },
    {
      "key": "- Note",
      "value": "Product may vary by store"
    },
    {
      "key": "Certifications and Listings",
      "value": "ASTM Compliant"
    },
    {
      "key": "Color Family",
      "value": "Browns / Tans"
    },
    {
      "key": "Material",
      "value": "Wood"
    },
    {
      "key": "Materials",
      "value": "Wood"
    },
    {
      "key": "MFG Brand Name",
      "value": "Swing-N-Slide Playsets"
    },
    {
      "key": "Mounting",
      "value": "Surface Mounted"
    },
    {
      "key": "Number of Activities",
      "value": "10"
    },
    {
      "key": "Number of Swings Included",
      "value": "3"
    },
    {
      "key": "Play Set Includes",
      "value": "All lumber,Hardware"
    },
    {
      "key": "Product Depth (in.)",
      "value": "156"
    },
    {
      "key": "Product Height (in.)",
      "value": "132"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "365"
    },
    {
      "key": "Product Width (in.)",
      "value": "216"
    },
    {
      "key": "Recommended Age Range",
      "value": "3-10"
    },
    {
      "key": "Roof Style",
      "value": "Gable Style HD Tarp Roof with Wood Frame- Green"
    },
    {
      "key": "Space Required, Height (ft.)",
      "value": "12"
    },
    {
      "key": "Space Required, Length (ft.)",
      "value": "30"
    },
    {
      "key": "Space Required, Width (ft.)",
      "value": "29"
    },
    {
      "key": "Weight Capacity (lb.)",
      "value": "1050"
    }
  ],
  "isDeleted": false
}