{
  "uid": 100487,
  "name": "Dremel PowerMax Oscillating Tool Kit",
  "description": "The Dremel Multi-Max MM30 features 3.3 Amp of power ranking it as among the most powerful oscillating tools available. The convenient on-tool integrated wrench makes accessory changes fast and there\u0027s no lost wrench to find. An innovative magnetic accessory interface makes accessory changes easy because it holds the accessory in place while you tighten the screw. And the extra-wide 3.2 angle of oscillation improves the speed of cut and makes MM30 the fastest DIY cutting tool available. The MM30 is as solid performing and comfortably operating oscillating tool as you will find. Includes Dremel carry bag to store tool and accessories.Quick release on-tool integrated wrench: Dremel MM30 users no longer have to worry about losing their wrenchFast speed of cut: the extra-wide 3.2 oscillation angle provides faster cutting and performanceQuick hold magnetic accessory interface the MM30 magnetically holds the accessory in place making tightening the clamping screw significantly easier for the userWide variable speed range from 10,000-23,000 OPM is the highest top-end speed of all oscillating tool availableErgonomically optimized soft grip for comfort and control7 ft. durable rubber cord for a wide working rangeIncludes: MM435 drywall jab saw, MM450 wood and drywall blade, MM480 wood flush cut blade, MM11 hook and loop pad, MM70W sanding sheets, MM80P sanding sheets and MM502 grout blade and storage bagHome Depot Protection Plan:Repair Remodel Restore",
  "attributes": [
    {
      "key": "Accessory Change System",
      "value": "Quick Lock"
    },
    {
      "key": "Accessory Compatibility",
      "value": "All Dremel Accessories"
    },
    {
      "key": "- Quick release on-tool integrated wrench",
      "value": "Dremel MM30 users no longer have to worry about losing their wrench"
    },
    {
      "key": "- Fast speed of cut",
      "value": "the extra-wide 3.2° oscillation angle provides faster cutting and performance"
    },
    {
      "key": "- Includes",
      "value": "MM435 drywall jab saw, MM450 wood and drywall blade, MM480 wood flush cut blade, MM11 hook and loop pad, MM70W sanding sheets, MM80P sanding sheets and MM502 grout blade and storage bag"
    },
    {
      "key": "Certifications and Listings",
      "value": "CSA Certified"
    },
    {
      "key": "Color Family",
      "value": "Gray"
    },
    {
      "key": "Cord Length (ft.)",
      "value": "7"
    },
    {
      "key": "Corded Tool Type",
      "value": "Rotary Tool"
    },
    {
      "key": "Cordless/Corded",
      "value": "Corded"
    },
    {
      "key": "MFG Brand Name",
      "value": "Dremel"
    },
    {
      "key": "Oscillation Arc Range (Degrees)",
      "value": "3.2"
    },
    {
      "key": "Oscillations Per Minute (OPM)",
      "value": "10000"
    },
    {
      "key": "Power Tool Features",
      "value": "Attachments Included,Case Included"
    },
    {
      "key": "Power Tool Product Type",
      "value": "Corded"
    },
    {
      "key": "Product Depth (in.)",
      "value": "14.25"
    },
    {
      "key": "Product Height (in.)",
      "value": "7.75"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "2.7"
    },
    {
      "key": "Product Width (in.)",
      "value": "2"
    },
    {
      "key": "Reconditioned",
      "value": "No"
    },
    {
      "key": "Tools Product Type",
      "value": "Power Tool"
    }
  ],
  "isDeleted": false
}