{
  "uid": 100471,
  "name": "Shark Rotator Lift-Away Upright Vacuum with Premium Accessories",
  "description": "The Shark Rotator Professional Lift-Away is a powerful never loses suction upright vacuum that features a unique detachable and portable canister that lifts away for effortless cleaning in and around the home. The extra large capacity dust cup and Anti-Allergen Complete Seal Technology traps over 99.9% of dust and allergens inside the vacuum. Enhanced swivel steering provides the ultimate control to get in and around obstacles, furniture, ultra-quiet technology allows for operation anywhere, anytime. The powerful motorized brush roll can be turned on or off, providing superior performance on both carpets and bare floors. Includes a premium pet power brush, dusting brush, crevice tool, canister caddy, straight suction nozzle and a wide upholstery tool. An extra long 30 ft. long power cord provides maximum range for cleaning large spaces quickly and easily.California residents: see\u0026nbsp;Proposition 65 informationFeatures 3 vacuums in 1, powerful upright, lift-away pod for portable cleaning and a convenient canister vacuumExtra-large capacity dust cup and anti-allergen complete seal traps over 99.99% of dust and allergens inside the vacuumEnhanced swivel steering provides the ultimate control to get in and around obstacles, furnitureUltra quiet technology feature allows for operation anywhere, anytimePremium rotator power nozzle comes with headlights and a brush roll shutoff, providing superior performance on both carpets and bare floorsIncludes a premium pet power brush, dusting brush, crevice tool, canister caddy, straight suction nozzle and a wide upholstery toolAn extra long 30 ft. long power cord provides maximum range for cleaning large spaces quickly and easily5 year limited warranty1200-WattPowerful headlightsHome Depot Protection Plan:",
  "attributes": [
    {
      "key": "Amperage (amps)",
      "value": "10"
    },
    {
      "key": "Assembled Depth (in.)",
      "value": "12 in"
    },
    {
      "key": "Assembled Height (in.)",
      "value": "45.7 in"
    },
    {
      "key": "Assembled Width (in.)",
      "value": "12 in"
    },
    {
      "key": "Assembly Required",
      "value": "Yes"
    },
    {
      "key": "Bag Change/Receptacle Full Indicator",
      "value": "Yes"
    },
    {
      "key": "Bagless",
      "value": "Yes"
    },
    {
      "key": "Carpet Height Adjustments",
      "value": "No"
    },
    {
      "key": "Certifications and Listings",
      "value": "ETL Listed"
    },
    {
      "key": "Cleaning Range with Tools(ft.)",
      "value": "11.8"
    },
    {
      "key": "Color Family",
      "value": "Whites"
    },
    {
      "key": "Cord Length (ft.)",
      "value": "30"
    },
    {
      "key": "Dust Compression System",
      "value": "No"
    },
    {
      "key": "Edge Cleaner",
      "value": "No"
    },
    {
      "key": "Filter Type",
      "value": "HEPA"
    },
    {
      "key": "Headlights",
      "value": "Yes"
    },
    {
      "key": "MFG Brand Name",
      "value": "Shark"
    },
    {
      "key": "Number of Attachments",
      "value": "6"
    },
    {
      "key": "Number of Filters",
      "value": "3"
    },
    {
      "key": "Pet Attachment",
      "value": "Yes"
    },
    {
      "key": "Product Depth (in.)",
      "value": "12"
    },
    {
      "key": "Product Height (in.)",
      "value": "45.7"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "15.8"
    },
    {
      "key": "Product Width (in.)",
      "value": "12"
    },
    {
      "key": "Reconditioned",
      "value": "No"
    },
    {
      "key": "Retractable Cord",
      "value": "No"
    },
    {
      "key": "Surface Type",
      "value": "All Floor Types"
    },
    {
      "key": "Voltage (volts)",
      "value": "120"
    }
  ],
  "isDeleted": false
}