{
  "uid": 100473,
  "name": "Makita 4-Stroke Backpack Blower with Cruise Control",
  "description": "Makita\u0027s 76.6cc Backpack Blower combines a cleaner-burning 4-stroke motor and quieter operation (only 74 dB (A)) with commercial duty power and performance. The cleaner-burning, fuel-efficient BBX7600N is a true step-up from older 2-stroke technology. The BBX7600N is powered by a 75.6cc commercial-duty 4-stroke engine that requires no fuel mix and delivers commercial-duty performance with a maximum air speed of 195 mph and a maximum air volume of 526 cu. ft. per minute. The mechanical automatic engine decompression system ensures quicker, easier starts. Additional ease-of-use features include the easily accessible oil filling port, drain plug and large capacity air filter. The BBX7600N is compact with less weight (only 22.6 lbs.), with wide padded shoulder straps and padded back panel for improved operator comfort. Makita\u0027s cleaner-burning 4-stroke BBX7600N is engineered for commercial lawn and garden work and is ideal for professional landscapers or do-it-yourselfers seeking a best-in-class backpack blower.California residents: see\u0026nbsp;Proposition 65 informationPowerful and fuel efficient 75.6cc 4-stroke commercial duty engineMechanical automatic engine decompression for quicker, easier startsPadded shoulder straps and back panel for improved operator comfortCompact design with less weight (22.6 lbs.) for easier operation in confined areasOil filling port and drain plug are easily accessible for faster maintenanceLarge capacity air filter is replaceable and easily accessible for faster maintenanceSoft grip for less vibration and cruise control lever for reduced operator fatigueLarge capacity muffler ensures quieter operation 74 dB (A)Spark plug is easily accessible for faster maintenanceHigh air volume (526 CFM) and air speed (195 mph) for commercial duty performanceIncludes: end pipe (667-95019-00), tool kit, BHX2500 (690-90590-00), straight pipe (667-95018-01)Home Depot Protection Plan:",
  "attributes": [
    {
      "key": "Antivibration",
      "value": "No"
    },
    {
      "key": "Assembled Depth (in.)",
      "value": "15 in"
    },
    {
      "key": "Assembled Height (in.)",
      "value": "22 in"
    },
    {
      "key": "Assembled Width (in.)",
      "value": "21 in"
    },
    {
      "key": "Assembly Required",
      "value": "Yes"
    },
    {
      "key": "Blower Type",
      "value": "Backpack Blower"
    },
    {
      "key": "- Includes",
      "value": "end pipe (667-95019-00), tool kit, BHX2500 (690-90590-00), straight pipe (667-95018-01)"
    },
    {
      "key": "CA (CARB) Compliant",
      "value": "CARB Compliant"
    },
    {
      "key": "Certifications and Listings",
      "value": "No Certifications or Listings"
    },
    {
      "key": "Commercial",
      "value": "Yes"
    },
    {
      "key": "Engine Cycles",
      "value": "4 Cycle"
    },
    {
      "key": "Engine Displacement (cc)",
      "value": "75.6"
    },
    {
      "key": "Engine Type",
      "value": "4-Stroke"
    },
    {
      "key": "Fuel tank capacity (oz.)",
      "value": "64.2"
    },
    {
      "key": "Interchangeable nozzle connections",
      "value": "Yes"
    },
    {
      "key": "Maximum air speed (mph)",
      "value": "195"
    },
    {
      "key": "Maximum Air Volume (CFM)",
      "value": "526"
    },
    {
      "key": "MFG Brand Name",
      "value": "Makita"
    },
    {
      "key": "Noise rating (dB)",
      "value": "74"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "22.6"
    },
    {
      "key": "Reconditioned",
      "value": "No"
    },
    {
      "key": "Start Type",
      "value": "Automatic Override"
    },
    {
      "key": "Translucent fuel tank",
      "value": "Yes"
    },
    {
      "key": "Variable speeds",
      "value": "Yes"
    }
  ],
  "isDeleted": false
}