{
  "uid": 100595,
  "name": "Makita 7 in. 3000 RPM Corded Polisher - PowerPro 3000",
  "description": "Delivering high-quality detailing and polishing, the Makita 7 in. 3000 RPM Corded Polisher (model 9237C) is perfect for automotive detailers, marine enthusiasts and stone polishers. The polisher combines consistent power and speed control with impressive durability and performance features, resulting in a fast and powerful polisher for clear coat finishes, stone polishing and more. Detailers will appreciate the variable-speed dial and trigger that lets you match the speed to the application, while the constant speed control is engineered to maintain consistent speed even under load. A rubberized loop handle provides added comfort and protection for delicate work surfaces and for increased durability, a wire mesh intake cover prevents wool bonnet fibers and other debris from entering the motor to help ensure a long tool life.California residents: see\u0026nbsp;Proposition 65 informationIncludes polisher, 7 ft. backing pad; hook and loop (743052-5); blade wrench (783204-6); side handle (153489-2); 21 in. contractor bag (821016-X); 7 in. wool bonnet; hook and loop, compounding (192629-7); 7 in. wool bonnet; hook and loop, polishing (743403-A); loop handle 9237C (455292-0); pad alignment/centering sleeve (262542-4)Variable speed dial and trigger enables user to match the speed to the applicationConstant speed control maintains constant speed under loadSoft start for smooth startups and fewer flings off of polish, wax or pasteRubberized loop handle and gear housing provide operator comfort and help protect delicate surfaces from damageWire mesh intake cover prevents wool fibers from entering motorImproved cord guard for increased flexibility and longer lifeExternally accessible brushes for easy serviceabilityRubber tool rest for upside down placement of tool when used with side handleLock-on button for continuous-use operation3-prong plug helps prevent static electricity accumulation1-year warrantyHome Depot Protection Plan:",
  "attributes": [
    {
      "key": "Amperage (amps)",
      "value": "10"
    },
    {
      "key": "Arbor Size",
      "value": "0"
    },
    {
      "key": "Certifications and Listings",
      "value": "1-UL Listed"
    },
    {
      "key": "Color Family",
      "value": "Teal"
    },
    {
      "key": "Cord Length (ft.)",
      "value": "8.2"
    },
    {
      "key": "Corded Tool Type",
      "value": "Polisher"
    },
    {
      "key": "Cordless/Corded",
      "value": "Corded"
    },
    {
      "key": "Maximum Speed (rpm)",
      "value": "3000"
    },
    {
      "key": "MFG Brand Name",
      "value": "Makita"
    },
    {
      "key": "Power Tool Features",
      "value": "Bag Included"
    },
    {
      "key": "Power Tool Product Type",
      "value": "Corded"
    },
    {
      "key": "Product Depth (in.)",
      "value": "18.5"
    },
    {
      "key": "Product Height (in.)",
      "value": "6.89"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "7"
    },
    {
      "key": "Product Width (in.)",
      "value": "6.67"
    },
    {
      "key": "Random orbit",
      "value": "No"
    },
    {
      "key": "Reconditioned",
      "value": "No"
    },
    {
      "key": "Switch Type",
      "value": "Trigger"
    },
    {
      "key": "Tools Product Type",
      "value": "Power Tool"
    },
    {
      "key": "Variable Speed",
      "value": "Yes"
    }
  ],
  "isDeleted": false
}