{
  "uid": 100557,
  "name": "GraceShield 225 - Smooth Surface Roofing Underlayment",
  "description": "Grace invented fully-adhered roofing underlayments more than 35 years ago. Grace Ice \u0026 Water Shield fully-adhered smooth surface roofing underlayment provides best in class roof leak protection against wind driven rain \u0026 ice dams. Grace Ice \u0026 Water Shield roofing underlayment, a registered trademark of W. R. Grace, is the name that contractors trust the most to protect their reputations.Strong adhesion to the roof deck: Helps ensure watertight seal, protecting roofs from harsh weather conditionsHigh quality seal around roofing nails: Delivers best in class roof leak protection; providing peace of mind against costly call backsForms superior laps: Helps ensure a watertight installation with no special treatment of the lapsRipcord split release on demand: Makes it easier to waterproof detail areas such as valleys, chimneys, roof to wall transitionsLongest performance history: With over 35 years of performance history, Grace Ice \u0026 Water Shield roofing underlayment offers the highest confidence for the life of the roofProtects roofs from wind driven rain and ice dams36 in. x 75 ft. size provides 225 sq. ft. of coverage",
  "attributes": [
    {
      "key": "- Strong adhesion to the roof deck",
      "value": "Helps ensure watertight seal, protecting roofs from harsh weather conditions"
    },
    {
      "key": "- High quality seal around roofing nails",
      "value": "Delivers best in class roof leak protection; providing peace of mind against costly call backs"
    },
    {
      "key": "- Forms superior laps",
      "value": "Helps ensure a watertight installation with no special treatment of the laps"
    },
    {
      "key": "- Ripcord split release on demand",
      "value": "Makes it easier to waterproof detail areas such as valleys, chimneys, roof to wall transitions"
    },
    {
      "key": "- Longest performance history",
      "value": "With over 35 years of performance history, grace ice \u0026 water shield roofing underlayment offers the highest confidence for the life of the roof"
    },
    {
      "key": "Color Family",
      "value": "Black"
    },
    {
      "key": "Commercial / Residential",
      "value": "Commercial / Residential"
    },
    {
      "key": "Coverage Area (sq. ft.)",
      "value": "225"
    },
    {
      "key": "MFG Brand Name",
      "value": "Grace"
    },
    {
      "key": "Product Depth (in.)",
      "value": "0.04"
    },
    {
      "key": "Product Height (in.)",
      "value": "900"
    },
    {
      "key": "Product Width (in.)",
      "value": "36"
    },
    {
      "key": "Roofing Product Type",
      "value": "Underlayment"
    },
    {
      "key": "Texture",
      "value": "Smooth"
    },
    {
      "key": "Thickness (In.)",
      "value": "0.04"
    },
    {
      "key": "Unrolled length (ft.)",
      "value": "75"
    }
  ],
  "isDeleted": false
}