{
  "uid": 100570,
  "name": "SPT Evaporative Air Cooler, Humidifier, and Fan - Portable Refreshment",
  "description": "This Evaporative Air Cooler, Humidifier, and Fan is versatile, lightweight and economical. The Cooler easily rolls from room to room for use anywhere in your house or office. This Air Cooler shoots a stream of air with oscillating louvers, to evenly distribute refreshing cool air. Can also be used as a fan or humidifier if temperature is not an issue. The remote control allows you to easily change settings. The Air Cooler works by endothermic reaction (a reaction that consumes heat), so this evaporative Air Cooler sucks air through a wick saturated with water. As the air flows through the wick, some of the water evaporates into the air, consuming the heat that was in the air. An air stream is then blown out the front of the unit and is considerably cooler than the current room temperature. This is not an air conditioner and therefore uses much less energy. Note: This unit is NOT an air conditioner and does not have a compressor inside - air coolers will not lower a room\u0027s ambient temperature. Air coolers are designed for spot cooling. This unit is best used in dry climates or open spaces. Leave window/door open to limit the rise of humidity and for better air ventilation in the room. Add as much ice as possible and set unit next to you for best effect.A versatile, lightweight and economical alternative to a portable air conditionerCooler works by drawing in air and cooling it with a water-saturated wickShoots a stream of refreshed air back out with oscillating louvers10 l water tank capacity3 air speeds: H / M / LSleep modeTimer: from 0.5 - 7.5 hours settingETLHome Depot Protection Plan:",
  "attributes": [
    {
      "key": "Air Volume (CFM)",
      "value": "476"
    },
    {
      "key": "Amperage (amps)",
      "value": "0.5"
    },
    {
      "key": "Built-in carbon filter",
      "value": "No"
    },
    {
      "key": "Built-in HEPA filter",
      "value": "No"
    },
    {
      "key": "- 3 air speeds",
      "value": "H / M / L"
    },
    {
      "key": "- Timer",
      "value": "from 0.5 - 7.5 hours setting"
    },
    {
      "key": "Casters",
      "value": "Yes"
    },
    {
      "key": "Certifications and Listings",
      "value": "ETL Listed"
    },
    {
      "key": "Color",
      "value": "Off White"
    },
    {
      "key": "Color Family",
      "value": "Whites"
    },
    {
      "key": "Commercial / Residential",
      "value": "Residential"
    },
    {
      "key": "Cooling zone (sq. ft.)",
      "value": "87.5"
    },
    {
      "key": "Cord Length (in.)",
      "value": "6"
    },
    {
      "key": "Evaporative Cooler Product Type",
      "value": "Portable Cooler"
    },
    {
      "key": "Horsepower (hp)",
      "value": "1/16 hp"
    },
    {
      "key": "MFG Brand Name",
      "value": "SPT"
    },
    {
      "key": "Number of Speed Settings",
      "value": "3"
    },
    {
      "key": "Product Depth (in.)",
      "value": "12"
    },
    {
      "key": "Product Height (in.)",
      "value": "25"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "17"
    },
    {
      "key": "Product Width (in.)",
      "value": "16"
    },
    {
      "key": "Programmable Timer",
      "value": "Yes"
    },
    {
      "key": "Remote Control",
      "value": "Yes"
    },
    {
      "key": "Voltage (volts)",
      "value": "120"
    }
  ],
  "isDeleted": false
}