{
  "uid": 100510,
  "name": "Ideal Pet Silver Aluminum Large Patio Door Insert",
  "description": "Simplify your life with the 15 in. x 20 in. Super Large Silver Aluminum Ideal Pet Patio Door. Give your big furry friend access to shelter day and night and get them in out of the heat, rain, and cold without any fuss or scratching at the door. Economical and dependable, the Ideal Pet Patio doors require no changes to your existing sliding patio door and can be installed or removed with ease. Keep your pet safe and happy with an Ideal door.Aluminum pet patio doors will not fit correctly with vinyl sliding configurations - aluminum and vinyl are NOT INTERCHANGEABLEAdjustable to fit existing aluminum sliding door heights of 77-5/8 - 80-3/8 in. (other heights available)Flap size of 15 in. wide by 20 in. tall to accommodate very large petsIdeal for pets weighing up to 120 lbs. and up to 14-1/2 in. wideRequires no changes to your existing door and can be installed within minutes without any tools using our simple step-by-step instructionsUnit is comprised of a silver aluminum-framed safety glass panel mounted above a plastic framed pet doorSilver plastic pet door frame is dependable and stands up to everyday useFlexible vinyl flap is clear to allow pet to see through opening and non-toxic for added safetyComes with a rigid lock-out panel that slides into grooves on the inside of the frame and snaps into place to effectively lock the doorMagnetic flap closure ensures a strong seal when door is not in useLock-out panel and self-closing flap deter unwanted pests from entering your homeQuick and easy installation with simple step-by-step instructionsPanel can be installed in either a right or left hand sliding door openingPet patio door has a standard rise of 8 in.; rise is the distance from the floor to the bottom of the pet doorYou may need to align your sliding patio door with the Ideal Pet patio door for a proper fit; please refer to the manufacturer\u0027s sliding door adjustment instructions for your brand of sliding patio door",
  "attributes": [
    {
      "key": "Electronic",
      "value": "No"
    },
    {
      "key": "Lockable Flap/Panel",
      "value": "Yes"
    },
    {
      "key": "Maximum Pet Weight (lb.)",
      "value": "120"
    },
    {
      "key": "MFG Brand Name",
      "value": "Ideal Pet"
    },
    {
      "key": "Pet Door Mount Type",
      "value": "Sliding Door Inserts"
    },
    {
      "key": "Pet Door Opening Width (in.) x Height (in.)",
      "value": "15 x 20"
    },
    {
      "key": "Product Depth (in.)",
      "value": "1.875"
    },
    {
      "key": "Product Height (in.)",
      "value": "77.625"
    },
    {
      "key": "Product Width (in.)",
      "value": "18.75"
    },
    {
      "key": "Type",
      "value": "Patio Door Insert"
    }
  ],
  "isDeleted": false
}