{
  "uid": 100581,
  "name": "Columbia PureBond Hardwood Plywood - Formaldehyde-Free Professional Grade",
  "description": "Exclusively at The Home Depot: Professional grade, domestic decorative hardwood plywood featuring soy-based PureBond formaldehyde-free assembly technology. These features ensures the panels are high quality and do not have added urea formaldehyde resins which can emit formaldehyde over time after manufacturing. Formaldehyde has been shown by the state of California to degrade air quality.California residents: see\u0026nbsp;Proposition 65 informationManufactured with Columbia\u0027s exclusive soy-based PureBond formaldehyde free assembly technology which eliminates urea formaldehyde in the manufacturing processThe professional\u0027s choice when the warmth, beauty and timeless quality of hardwood is required in cabinets, furniture, wall paneling, shelving and storage solutions, media centers, built-ins, headboards and moreLight weight, all-wood veneer construction for customers who demand all natural wood over composite panel products like particleboard and MDF which typically emit higher levels of formaldehydeLower Machining CostsHardwood Face VeneerHardwood Back VeneerCommon: 3/4 in. x 4 ft. x 8 ft.; Actual: 0.703 in. x 48 in. x 96 in.Grade: C-3Note: Product may vary by store.",
  "attributes": [
    {
      "key": "Actual product thickness (in.)",
      "value": "0.703"
    },
    {
      "key": "Actual product width (in.)",
      "value": "48"
    },
    {
      "key": "- Common",
      "value": "3/4 in. x 4 ft. x 8 ft.; Actual: 0.703 in. x 48 in. x 96 in."
    },
    {
      "key": "- Grade",
      "value": "C-3"
    },
    {
      "key": "- Note",
      "value": "Product may vary by store."
    },
    {
      "key": "MFG Brand Name",
      "value": "Columbia Forest Products"
    },
    {
      "key": "Plywood Type",
      "value": "Hardwood Plywood"
    },
    {
      "key": "Pressure Treated",
      "value": "No"
    },
    {
      "key": "Product Depth (in.)",
      "value": "48"
    },
    {
      "key": "Product Height (in.)",
      "value": "0.75"
    },
    {
      "key": "Product Length (ft.)",
      "value": "8 ft"
    },
    {
      "key": "Product Thickness (in.)",
      "value": "3/4 in"
    },
    {
      "key": "Product Thickness x Width x Length",
      "value": "3/4 in. x 4 ft. x 8 ft."
    },
    {
      "key": "Product Width (ft.)",
      "value": "4 ft"
    },
    {
      "key": "Product Width (in.)",
      "value": "96"
    },
    {
      "key": "Stainable/Paintable",
      "value": "Stainable \u0026 Paintable"
    },
    {
      "key": "Tounge and Groove",
      "value": "No"
    }
  ],
  "isDeleted": false
}