{
  "uid": 100589,
  "name": "Mighty Mule Dual Swing Gate Opener Kit with Remotes",
  "description": "The FM402 Dual Automatic Gate system is a Home Depot Exclusive Kit! The FM402 Medium Duty Dual Swing system is designed for dual swing gates up to 12 ft. long, or up to 300 lbs. per panel. The system is ideal for dual vinyl, tubular steel farm gates, chain link or wood gates. The operator allows you to activate your automatic gate system by remote, keypad or indoor base station; Single Button Remote (FM135) included.Includes 2 single button access remotes (FM135), AC transformer (RB570), battery (FM150), control box, all required hardware and a detailed installation manual with an interactive DVDDesigned for Dual swing gates weighing up to a maximum of 12 ft. or a maximum of 300 lbs.Perfect for all gate types including vinyl, tubular steel farm gates, chain link or wood gates30% Residential Energy Efficient Property Tax Credit available! Residential home owners can use this credit on a new operator system, accessories and installation with the purchase of a Mighty Mule Solar Panel; 10-Watt (FM123)Mighty Mule offers strong elegant steel gates on HomeDepot.com that can be shipped directly to your home!Backed by an 18 month Mighty Mule Warranty and Technical SupportHome Depot Protection Plan Available",
  "attributes": [
    {
      "key": "Commercial/Residential Use",
      "value": "Residential"
    },
    {
      "key": "Fencing Product Type",
      "value": "Gate Opener Kit"
    },
    {
      "key": "Gate opening style",
      "value": "Swinging"
    },
    {
      "key": "Hardware Included",
      "value": "Yes"
    },
    {
      "key": "Lighting Included",
      "value": "No"
    },
    {
      "key": "Maximum gate size (ft.)",
      "value": "12"
    },
    {
      "key": "MFG Brand Name",
      "value": "Mighty Mule"
    },
    {
      "key": "Power Requirements",
      "value": "AC or Solar"
    },
    {
      "key": "Product Depth (in.)",
      "value": "14"
    },
    {
      "key": "Product Height (in.)",
      "value": "10"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "41.1"
    },
    {
      "key": "Product Width (in.)",
      "value": "36"
    },
    {
      "key": "Remote control included",
      "value": "Yes"
    },
    {
      "key": "Weight Capacity (lb.)",
      "value": "300"
    },
    {
      "key": "Wired or Wireless",
      "value": "Combo"
    }
  ],
  "isDeleted": false
}