{
  "uid": 100519,
  "name": "Ridgid 18-Gauge Brad Nailer with Fasten Edge Technology",
  "description": "The RIDGID 18-Gauge 2-1/8 in. Brad Nailer features an industry leading feature set with Fasten Edge Technology. It has a selectable trigger that can be set to contact or sequential fire. The magazine allows a wide range of fastener diameters and the internal piston catch delivers consistent driving power. It is designed for clean operation and long life and equipped with no-mar pads that help prevent scuffing or damage to the work surface.California residents: see\u0026nbsp;Proposition 65 informationPowerful motor able to drive 2-1/8 in. brad nails into solid oakOil-less motor eliminates daily oiling and oil splattering on the work surfaceDry-fire lockout extends motor life and prevents marring work surfacesJam-clearing mechanism for easy access to clear jamsHex grip enhanced micro-texture for secure grip and maximum user comfortSide load magazine allows for quick and easy nail loadingACCU-drive tip design allows for accurate placement of fasteners at the desired angleSemi-transparent magazine door allows for convenient view of the nail supplyNo-mar pad keeps work surface clean of tool marksAdjustable rear exhaust with muffler puts the exhaust where you want it without any toolsNeed help? CLICK HERE to view our Nail Gun Buying Guide",
  "attributes": [
    {
      "key": "Air Tool Type",
      "value": "Air Nailer"
    },
    {
      "key": "Compressor/Air Tool Features",
      "value": "Adjustable Exhaust Port,Fastener Depth Control"
    },
    {
      "key": "Energy Type",
      "value": "Air"
    },
    {
      "key": "Included",
      "value": "Bag,Nails"
    },
    {
      "key": "Loading type",
      "value": "Strip"
    },
    {
      "key": "Maximum Fastener Size",
      "value": "2-1/8 in"
    },
    {
      "key": "MFG Brand Name",
      "value": "RIDGID"
    },
    {
      "key": "Minimum Fastener Size",
      "value": "2-1/8 in"
    },
    {
      "key": "Minimum Recommended Air Delivery SCFM @ 90PSI",
      "value": "00.1"
    },
    {
      "key": "Minimum Recommended Operating Pressure (psi)",
      "value": "70"
    },
    {
      "key": "Nail Gauge",
      "value": "18"
    },
    {
      "key": "Nailgun Angle",
      "value": "0"
    },
    {
      "key": "Product Depth (in.)",
      "value": "9.25"
    },
    {
      "key": "Product Height (in.)",
      "value": "10"
    },
    {
      "key": "Product Width (in.)",
      "value": "2.6"
    },
    {
      "key": "Reconditioned",
      "value": "No"
    },
    {
      "key": "Tools Product Type",
      "value": "Air Tool"
    }
  ],
  "isDeleted": false
}