{
  "uid": 100511,
  "name": "Rust-Oleum Chalked Clear Matte Topcoat (2-Pack)",
  "description": "Rust-Oleum 30 oz. Ultra-Matte Interior Chalked, Topcoat Clear (2-Pack) is a soft matte topcoat that can be easily applied to any chalked surface. Unlike traditional waxes, Chalked protective topcoat adds durability, protects and seals in just one step. Chalked Protective Topcoat is the perfect finish to any Chalked paint project.California residents: see\u0026nbsp;Proposition 65 informationMatte clear finish enhances color and protects interior chalked paint surfacesEasily covers surfaces in 1 to 2 coatsOne 30 oz. can covers up to 150 sq. ft.Dries to an ultra-matte clear velvety, smooth finishEasy application and more durable than traditional wax for chalked surfaces, no need to reapplyDries to touch in 30 minutesReplaces the traditional wax topcoatReplicate the timeless style of 18th century decor by distressing for a unique aged, chippy lookCleans up with soap and waterOnline Price includes Paint Care fee in the following states: CA, CO, CT, ME, MN, OR, RI, VT",
  "attributes": [
    {
      "key": "- Online Price includes Paint Care fee in the following states",
      "value": "CA, CO, CT, ME, MN, OR, RI, VT"
    },
    {
      "key": "Coating Product Category",
      "value": "Paint"
    },
    {
      "key": "Color/Finish",
      "value": "Clear"
    },
    {
      "key": "Container Size",
      "value": "1 QT-Quart"
    },
    {
      "key": "MFG Brand Name",
      "value": "Rust-Oleum Specialty"
    },
    {
      "key": "Paint Product Type",
      "value": "Craft Paint"
    },
    {
      "key": "Paint/Stain Key Features",
      "value": "No additional features"
    },
    {
      "key": "Paint/Stain/Waterproofer Product Type",
      "value": "Specialty Finish/Small Project"
    },
    {
      "key": "RGB Value",
      "value": "255:255:255"
    },
    {
      "key": "Sheen",
      "value": "Flat/Matte"
    },
    {
      "key": "Specialty Finish",
      "value": "Chalk Finish/Matte"
    },
    {
      "key": "Washable",
      "value": "No"
    },
    {
      "key": "Waterproof",
      "value": "No"
    }
  ],
  "isDeleted": false
}