{
  "uid": 100525,
  "name": "Toro TimeCutter SS4225 42 in. Zero-Turn Riding Mower",
  "description": "The Toro TimeCutter SS4225 is a hydrostatic zero-turn tractor powered by a 22 HP at 3,600 RPMs KOHLER V-Twin engine (725cc) with Autochoke. It has a 42 in. 2-bladed mowing system under a 4 in. D top discharge deck with convenient washout ports. The mower boasts 7 cutting positions between 1-1/2 in. and 4-1/2 in. H. With its Smart Speed control system, you\u0027ll have precise control and easy maneuvering with its Trim, Tow and Mow speed ranges. Maximizing comfort, it comes with a 15 in. high back seat. It is equipped with an electric PTO and automatic parking brake for ease of operation. A hitch comes standard for pulling Brinly-Hardy attachments.California residents: see\u0026nbsp;Proposition 65 information22 HP 725cc KOHLER engine with autochoke - no need to choke, just turn the key and goDual hydrostatic transmissions provide smooth variable control, zero-turning radius and years of dependable performanceGet Toro\u0027s professional quality of cut with its 42 in. deck that helps you get into tight places but still get the yard mowed quicklyZero-turning radius delivers optimal maneuverability allowing you to easily mow around obstaclesHeavy duty 10-Gauge steel frame for lasting durabilityAutomatic parking brake for easy operation - just move the levers out to turn on the brakeHitch comes standard for pulling Brinly-Hardy attachments for maximum versatilityGround speed of up to 7 MPH forward and 3.5 MPH reverse in Mow mode, 5 MPH forward and 2.5 MPH in reverse in Tow mode and 3 MPH forward and 1.5 MPH in reverse in trim mode15 in. tall seat gives you a comfortable rideEngine guard to protect your engine from damage3-year limited warranty with unlimited hoursHeavy duty front caster forks for added longevityItem usually ships within 7-10 business days, Toro\u0027s white glove delivery service - Toro product will arrive set-up and ready to go providing you with peace of mind, our goal is your satisfaction, upon purchase, a certified Toro dealer will set-up the product and perform a multi-point inspection, arrange a time for delivery at your home, deliver the mower in person and review safety and operational information with youToro\u0027s white glove delivery service - Toro product will arrive set-up and ready to go providing you with peace of mind, our goal is your satisfaction, upon purchase, a certified Toro dealer will set-up the product and perform a multi-point inspection, arrange a time for delivery at your home, deliver the mower in person and review safety and operational information with youBuild your perfect TimeCutter online with the Toro custom Z-builder, design your Z by choosing the steering, platform, deck, engine, seat and many more custom options and accessories, hand delivered, set up and ready to go, only from ToroExtr- large 3 Gal. fuel tank ensures you have hours of mowing time on a single fillGross horsepower of this engine was laboratory rated at 3,600 RPM by the engine manufacturer in accordance with SAE J1940 and SAE J2723, as configured to meet safety, emission and operating requirements, the actual horsepower on this class of mower will be significantly lower, actual products offered may varyHome Depot Protection Plan:",
  "attributes": [
    {
      "key": "Assembled Depth (in.)",
      "value": "78 in"
    },
    {
      "key": "Assembled Height (in.)",
      "value": "35 in"
    },
    {
      "key": "Assembled Width (in.)",
      "value": "48 in"
    },
    {
      "key": "CA (CARB) Compliant",
      "value": "Not CARB Compliant"
    },
    {
      "key": "Certifications and Listings",
      "value": "EPA Approved"
    },
    {
      "key": "Commercial / Residential",
      "value": "Residential"
    },
    {
      "key": "Cutting Width (in.)",
      "value": "42"
    },
    {
      "key": "Deck Type",
      "value": "Stamped"
    },
    {
      "key": "Drive type",
      "value": "Rear-wheel Drive"
    },
    {
      "key": "Engine Displacement (cc)",
      "value": "725"
    },
    {
      "key": "Engine Make",
      "value": "Kohler"
    },
    {
      "key": "Features",
      "value": "Cup Holder"
    },
    {
      "key": "Front wheel size (in.)",
      "value": "11"
    },
    {
      "key": "Fuel tank capacity (gallons)",
      "value": "3"
    },
    {
      "key": "Horsepower (hp)",
      "value": "22"
    },
    {
      "key": "Included",
      "value": "Engine oil"
    },
    {
      "key": "Lawn Mower Type",
      "value": "Zero Turn Riding"
    },
    {
      "key": "Maximum cutting height (in.)",
      "value": "4.5"
    },
    {
      "key": "Maximum forward speed (mph)",
      "value": "7"
    },
    {
      "key": "Maximum reverse speed (mph)",
      "value": "3"
    },
    {
      "key": "MFG Brand Name",
      "value": "Toro"
    },
    {
      "key": "Minimum cutting height (in.)",
      "value": "1.5"
    },
    {
      "key": "Mower Deck Width",
      "value": "42 in"
    },
    {
      "key": "Mulching Capability",
      "value": "Yes with Proper Blade"
    },
    {
      "key": "Number of Blades",
      "value": "2"
    },
    {
      "key": "Number of Cylinders",
      "value": "Twin Cylinder"
    },
    {
      "key": "Number of deck wheels",
      "value": "2"
    },
    {
      "key": "Oil capacity (oz.)",
      "value": "70"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "589"
    },
    {
      "key": "Rear wheel size (in.)",
      "value": "18"
    },
    {
      "key": "Reconditioned",
      "value": "No"
    },
    {
      "key": "Size of Yard",
      "value": "1 - 2 Acres"
    },
    {
      "key": "Start Type",
      "value": "Electric"
    },
    {
      "key": "Terrain",
      "value": "Sloped with Obstacles"
    },
    {
      "key": "Transmission Type",
      "value": "Hydrostatic"
    },
    {
      "key": "Turning radius (in.)",
      "value": "0"
    }
  ],
  "isDeleted": false
}