{
  "uid": 100551,
  "name": "MARAZZI Ardesia Bullnose Trim",
  "description": "Ardesia 3 in. x 12 in. Bullnose Trim is part of the MARAZZI VitaElegante Ardesia collection and complements the Ardesia porcelain floor and wall tile. Bullnose trim can add the finishing touch to create a professional looking installation. The MARRAZI VitaElegante Ardesia porcelain tile captures the effect of distinct clefts, mineral deposits and sense of randomly layered color found in natural slate. Available 6 in. x 24 in./12 in. x 24 in., Ardesia porcelain tile can be used on floors and walls.0.26 square foot per piece, each piece sold individually. Piece weight equals 1.25 lbs.Grade 1, first-quality porcelain tile for floor, wall and countertop use3 in. width x 12 in. length x 10 mm thickGlazed smooth finish with medium sheen and high variation in toneP.E.I. Rating IV has high resistance to abrasion and is suitable for heavy-duty residential and commercial floor installations such as entrances, commercial kitchens, hotels, exhibition and sales rooms with some dirt conditionsImpervious flooring has water absorption of less than 0.5% for indoor or outdoor use and is frost proofC.O.F. greater than .60 to .79 is required for commercial applications to meet or exceed ADA (Americans with Disabilities Act) Guidelines. Skid Resistant. Indoor and outdoor useFrost resistantResidential and commercial useLearn how to get a Lifetime Warranty by using Custom Building Products from The Home Depot. Visit www.homedepot.com/CBPDon\u0027t forget your coordinating trim pieces, grout, backerboard, thinset and installation toolsAll online orders for this item ship via parcel ground and may arrive in multiple boxesIt is recommended you purchase a minimum of 10% overage to account for design cuts and patterns",
  "attributes": [
    {
      "key": "Approximate Tile Size",
      "value": "3x12"
    },
    {
      "key": "Break Strength (lb.)",
      "value": "251"
    },
    {
      "key": "Color Family",
      "value": "Multi"
    },
    {
      "key": "Color/Finish",
      "value": "Ardesia"
    },
    {
      "key": "Commercial / Residential",
      "value": "Commercial / Residential"
    },
    {
      "key": "Flooring Product Type",
      "value": "Porcelain Tile"
    },
    {
      "key": "MFG Brand Name",
      "value": "MARAZZI"
    },
    {
      "key": "Number of Tiles per Case",
      "value": "1"
    },
    {
      "key": "Product Length (in.)",
      "value": "11.81"
    },
    {
      "key": "Product Thickness (mm)",
      "value": "10"
    },
    {
      "key": "Product Width (in.)",
      "value": "2.93"
    },
    {
      "key": "Style Type",
      "value": "Stone Look"
    },
    {
      "key": "Suggested Grout Line Size",
      "value": "3/16"
    },
    {
      "key": "Tile Features",
      "value": "Chemical Resistant,Frost Resistant,Glazed,Meets A.D.A. Requirements"
    },
    {
      "key": "Tile Finish",
      "value": "Matte"
    },
    {
      "key": "Tile Material",
      "value": "Porcelain"
    },
    {
      "key": "Tile Use",
      "value": "Accent Wall,Backsplash,Bath Wall,Bath floor,Bedroom Floor,Countertop,Entry Way,Exterior Wall,Fireplace Facade,Hallway Floor,Kitchen Floor,Living Room Floor,Shower Wall,Shower floor"
    }
  ],
  "isDeleted": false
}