{
  "uid": 100674,
  "name": "LightShow AppLights C9: Color-changing, app-controlled, connectable holiday lights.",
  "description": "Make the season bright with spectacular AppLights lighting solutions. Control them right from the app on your smartphone to remotely turn them on or off, and change the color and theme for more than 140 total effects! The result is a customized spectacle that you won\u0027t find anywhere else.  Plus, with their ultra-brightness and end-to-end connectivity, you can join multiple AppLights sets together for an even grander display of light! And AppLights go far beyond just Christmas! Use them for other holidays such as Halloween, Easter, Valentine\u0027s Day, and even the Fourth of July! AppLights -- for this season, for all seasons!Control your Christmas lights with a convenient appCreates a multi-colored light effectConnect multiple sets together for an even greater effectAn incredible addition to any holiday decorPhone/Tablet Requirements: Android 4.3 or higher version, supporting 4.0 Bluetooth; iOS 7.0 or higher version, iPhone 4s or higher version; iPad, iPad Pro, iPad3, iPad Mini, iPad Air, and IPod Touch120 V AC Power23 ft. Lighted Length and 24.5 ft. Total LengthLead wire length 1 ft. , end wire length 0.5 ft.Home Depot Protection Plan:",
  "attributes": [
    {
      "key": "Bulb Shape",
      "value": "C9"
    },
    {
      "key": "- Phone/Tablet Requirements",
      "value": "Android 4.3 or higher version, supporting 4.0 Bluetooth; iOS 7.0 or higher version, iPhone 4s or higher version; iPad, iPad Pro, iPad3, iPad Mini, iPad Air, and IPod Touch"
    },
    {
      "key": "Certifications and Listings",
      "value": "No Certifications or Listings"
    },
    {
      "key": "Color Changing Lights",
      "value": "Yes"
    },
    {
      "key": "Commercial / Residential",
      "value": "Residential"
    },
    {
      "key": "Holiday Decor Product Type",
      "value": "Specialty Lights"
    },
    {
      "key": "Indoor/Outdoor",
      "value": "Outdoor"
    },
    {
      "key": "Light Bulb Color",
      "value": "Multiple colors"
    },
    {
      "key": "Light count",
      "value": "24"
    },
    {
      "key": "Light Functions",
      "value": "Color Changing"
    },
    {
      "key": "Light Style",
      "value": "String"
    },
    {
      "key": "Light Type",
      "value": "LED"
    },
    {
      "key": "Lighted length (ft.)",
      "value": "23"
    },
    {
      "key": "MFG Brand Name",
      "value": "LightShow"
    },
    {
      "key": "Power Type",
      "value": "Plug-in"
    },
    {
      "key": "Twinkling",
      "value": "Yes"
    },
    {
      "key": "Wattage (watts)",
      "value": "24"
    },
    {
      "key": "Wire color",
      "value": "Green"
    }
  ],
  "isDeleted": false
}