{
  "uid": 100622,
  "name": "3M BondPro Spray Adhesive",
  "description": "3M Super 77 is a multipurpose spray adhesive that can be used for a variety of projects to bond lightweight materials. It\u0027s versatile, quick drying, and transparent. Also its fast, permanent bond provides quick results to keep projects moving forward. The spray formula is easy to dispense and apply directly onto surfaces and materials where needed. Bonds decorative films, foils, plastics, papers, foams, metals and cardboard to most surfaces.California residents: see\u0026nbsp;Proposition 65 informationMultipurpose spray adhesive bonds to many surfaces; great for use in home, office, and craft projectsSticks to: cardboard; ceramic; fabric; fiberglass; foam; glass; leather; metal; paper; plastic; rubber; vinyl; woodAggressive tack provides high initial grab, with enough time to position materials properlyTransparent spray formulaIndustrial sized can provides high coverageResists dripping or running when used in vertical applicationsIncludes 1 can; 16.75 fl. oz.Click here to view the Adhesive Spray Selector Guide",
  "attributes": [
    {
      "key": "Adhesion level",
      "value": "Medium"
    },
    {
      "key": "Adhesive Product Type",
      "value": "Glue/Epoxy"
    },
    {
      "key": "- Sticks to",
      "value": "cardboard; ceramic; fabric; fiberglass; foam; glass; leather; metal; paper; plastic; rubber; vinyl; wood"
    },
    {
      "key": "Curing time (hours)",
      "value": "1"
    },
    {
      "key": "Dries clear",
      "value": "Yes"
    },
    {
      "key": "Drillable",
      "value": "Yes"
    },
    {
      "key": "Flammable",
      "value": "Yes"
    },
    {
      "key": "Glue/epoxy type",
      "value": "Spray"
    },
    {
      "key": "Indoor/Outdoor",
      "value": "Indoor/Outdoor"
    },
    {
      "key": "MFG Brand Name",
      "value": "3M"
    },
    {
      "key": "Moisture Resistant",
      "value": "Yes"
    },
    {
      "key": "Product Depth (in.)",
      "value": "3"
    },
    {
      "key": "Product Height (in.)",
      "value": "9"
    },
    {
      "key": "Product Weight (oz.)",
      "value": "16.75"
    },
    {
      "key": "Product Width (in.)",
      "value": "3 in"
    },
    {
      "key": "Sandable",
      "value": "Yes"
    },
    {
      "key": "Set Time (Min.)",
      "value": "60"
    },
    {
      "key": "Solvent resistant",
      "value": "Yes"
    },
    {
      "key": "Stainable/Paintable",
      "value": "No"
    },
    {
      "key": "UV/sunlight resistant",
      "value": "No"
    }
  ],
  "isDeleted": false
}