{
  "uid": 100628,
  "name": "Kohler Cimarron Comfort Height Complete Solution Toilet",
  "description": "Featuring the classic, versatile look of the Cimarron collection, this two-piece toilet combines water-saving flush performance with graceful curves. A 1.28 GPF provides up to 16,500 Gal. of water savings per year, compared to a 3.5 Gal. toilet, without sacrificing performance. This toilet features innovative AquaPiston technology, a patented flush engine, that delivers a fast, powerful, and plug-free flush. The round-front bowl is positioned at a convenient height for comfort and ease of use. For added convenience, this model comes with all the necessary installation parts.Round-front bowl offers an ideal solution for smaller baths and powder roomsComfort height feature offers chair-height seating that makes sitting down and standing up easier for most adultsComplete solution toilets provide everything you need in one box, including bowl, tank, seat, wax ring, and floor hardwareSupply line not includedCoordinates with other products in the Cimarron collectionSingle-flush gravity uses the force of gravity and a precision-engineered tank, bowl, and trapway to create a strong siphon during flushingAquaPiston canister allows water to flow into the bowl from all sides (360), increasing the power and effectiveness of the flushFlush valve\u0027s 3: 2 ratio harnesses the natural force of gravity and optimizes flush performanceDurable canister design has 90% less exposed seal material than a 3 in. flapper, for leak-free performanceLight-touch canister flush requires a lower actuation force than a flapperDryLock system saves installation time and helps prevent water leakageWaterSense toilets meet strict EPA flushing guidelines, including using at least 20% less water than 1.6 Gal. toiletsAvailable exclusively at The Home Depot",
  "attributes": [
    {
      "key": "Bowl Height",
      "value": "Comfort Height"
    },
    {
      "key": "Bowl Height (in.)",
      "value": "16.5"
    },
    {
      "key": "Bowl Shape",
      "value": "Round"
    },
    {
      "key": "- Flush valve\u0027s 3",
      "value": "2 ratio harnesses the natural force of gravity and optimizes flush performance"
    },
    {
      "key": "Certifications and Listings",
      "value": "ADA Compliant"
    },
    {
      "key": "Color Family",
      "value": "White"
    },
    {
      "key": "Color/Finish",
      "value": "White"
    },
    {
      "key": "Commercial / Residential",
      "value": "Residential"
    },
    {
      "key": "Flush Valve Size (in.)",
      "value": "2.25"
    },
    {
      "key": "Flushing Mechanism",
      "value": "Gravity Flush"
    },
    {
      "key": "Flushing Technology",
      "value": "Gravity Fed"
    },
    {
      "key": "Flushing Type",
      "value": "Single Flush"
    },
    {
      "key": "Gallons Per Flush",
      "value": "1.28"
    },
    {
      "key": "MaP Performance Rating",
      "value": "1000"
    },
    {
      "key": "Material",
      "value": "Vitreous China"
    },
    {
      "key": "MFG Brand Name",
      "value": "KOHLER"
    },
    {
      "key": "Mount Location",
      "value": "Floor Mount"
    },
    {
      "key": "Product Depth (in.)",
      "value": "27.25 in"
    },
    {
      "key": "Product Height (in.)",
      "value": "30.5 in"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "101"
    },
    {
      "key": "Product Width (in.)",
      "value": "17.625 in"
    },
    {
      "key": "Rough In Size",
      "value": "12"
    },
    {
      "key": "Toilet Features",
      "value": "Complete Kit"
    },
    {
      "key": "Toilet Included Components",
      "value": "Seat"
    },
    {
      "key": "Trip Lever Location",
      "value": "Left Side"
    }
  ],
  "isDeleted": false
}