{
  "uid": 100671,
  "name": "Designers Edge L1322 LED Construction Light - Coleman Cable",
  "description": "Designers Edge L1322 (24) 120_ cool to the touch after hours of use and features high intensity, 120_ construction lighting. The light features padded grips, a telescoping stand, non-skid feet and weatherproof on/off switches. The 18/3-Gauge cord is 5 ft. long. CETL accredited. Coleman Cable, Inc. is a leading manufacturer and innovator of electrical and electronic wire and cable products for the security, sound, telecommunications, electrical construction, retail, commercial, industrial, irrigation, HVAC and automotive markets. Coleman Cable, Inc. offers a family of leading brands such as Moonrays, Fire Shield and Designers Edge. Since 1987, Designers Edge has been building its reputation as an innovator of commercial and industrial lighting. Designers Edge is recognized as a leader in its industry and holds multiple patents and awards for its world class designs.Remains cool to the touch while in usePolymeric housing is mounted on a metal H-frame base for added stabilityProduce up to 1558 Lumens of long lasting lightFeatures high output reflectors and weatherproof switches",
  "attributes": [
    {
      "key": "Bulb Type Included",
      "value": "LED"
    },
    {
      "key": "Certifications and Listings",
      "value": "1-UL Listed,ETL Listed"
    },
    {
      "key": "Color/Finish Family",
      "value": "Green"
    },
    {
      "key": "Commercial Light Type",
      "value": "Work Light"
    },
    {
      "key": "ENERGY STAR Certified",
      "value": "No"
    },
    {
      "key": "Fixture Color/Finish",
      "value": "Green"
    },
    {
      "key": "Hardware Included",
      "value": "No"
    },
    {
      "key": "Light Bulb Base Code",
      "value": "Other"
    },
    {
      "key": "Light Source",
      "value": "LED"
    },
    {
      "key": "Maximum Wattage (watts)",
      "value": "0"
    },
    {
      "key": "MFG Brand Name",
      "value": "Designers Edge"
    },
    {
      "key": "Number of Bulbs Required",
      "value": "24"
    },
    {
      "key": "Product Depth (in.)",
      "value": "24.016"
    },
    {
      "key": "Product Height (in.)",
      "value": "24.016"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "15.65"
    },
    {
      "key": "Product Width (in.)",
      "value": "11.811"
    }
  ],
  "isDeleted": false
}