{
  "uid": 100644,
  "name": "Crown Bolt Paracord 50 ft. Braided Rope Kit",
  "description": "Ideal for camping, hiking and other outdoor activities. Paracord is the duct tape of the fiber world. High strength to weight ratio. Readymade Paracord survival bracelets and buckles to make your own Paracord survival bracelet are also available.California residents: see\u0026nbsp;Proposition 65 informationContains one or more of: nylon, polypropylene, polyesterParacord is a must have for anyone who is serious about an outdoor lifestyleThere are 1001 uses for paracord including making a shelter, clotheslines, sling for gear or weapons, and making paracord survival braceletsMake your own paracord survival bracelet to ensure your paracord is always there when you need it mostParacord bracelets are convenient to carry on your person or your packWorking load limit of 160 lbs.Working load limit is a guideline for the maximum allowable weight capacity of a new ropeThe Cordage Institute defines Working Load Limit (WLL) as the working load that must not be exceeded for a particular application as established by a regulatory or standards setting agency. This is different than the Breaking Strength of a rope, which is the force at which a rope will break. Working Load Limit is always a lower value than the Breaking Strength of a rope.",
  "attributes": [
    {
      "key": "- Contains one or more of",
      "value": "nylon, polypropylene, polyester"
    },
    {
      "key": "Color Family",
      "value": "Blues"
    },
    {
      "key": "Fastener Type",
      "value": "Non-Wire Rope"
    },
    {
      "key": "Floats in water",
      "value": "Yes"
    },
    {
      "key": "Load limit (lb.)",
      "value": "160"
    },
    {
      "key": "Material",
      "value": "Nylon"
    },
    {
      "key": "MFG Brand Name",
      "value": "Crown Bolt"
    },
    {
      "key": "Package Quantity",
      "value": "1"
    },
    {
      "key": "Product Depth (in.)",
      "value": "2.35"
    },
    {
      "key": "Product Height (in.)",
      "value": "1.5"
    },
    {
      "key": "Product Length (ft.)",
      "value": "50"
    },
    {
      "key": "Product Length (in.)",
      "value": "600"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "0.286"
    },
    {
      "key": "Product Width (in.)",
      "value": "5.75"
    },
    {
      "key": "Rope configuration",
      "value": "Braided"
    },
    {
      "key": "Rope Diameter (in.)",
      "value": "1/8"
    },
    {
      "key": "Vinyl coated",
      "value": "0"
    },
    {
      "key": "Weather Resistant",
      "value": "Yes"
    }
  ],
  "isDeleted": false
}