{
  "uid": 100623,
  "name": "Duck Covers Ultimate Patio Furniture Cover - Mocha Cappuccino",
  "description": "Fits Square Tables with Chairs up to 72 in. wide. These covers are the \u0022ultimate\u0022 because they are ideal for use in harsh weather and strong wind conditions. Duck covers Ultimate Series patio furniture covers are designed to protect patio furniture from dust, dirt, sun, rain and heavy snow. Manufactured using a combination of high-strength polyester top panel, plus innovative, multi-layer, breathable side panels to help eliminate condensation. The multi-layer, breathable side panels eliminates the need for vents and provides additional cover height, unlike shorter competitive covers which offer less protection. High-strength polyester base for added durability. Mocha Cappuccino color. Two-year limited warranty has you covered. Migrate to the best patio furniture covers today.100% waterproof - ideal for high moisture climatesUnlike competitive covers, seam sealer tape applied during manufacturing process prevents water penetrating the cover at the seamsUV stability added during material production to reduce fadingA combination of nylon straps with side-release buckles and shock cord with locks firmly secures cover in placeColor coordinated so patio furniture covers can be combined with Duck covers elite or essential seriesDuck covers recommend you store cushions separately when not in use",
  "attributes": [
    {
      "key": "Assembled Depth (in.)",
      "value": "76 in"
    },
    {
      "key": "Assembled Height (in.)",
      "value": "32 in"
    },
    {
      "key": "Assembled Width (in.)",
      "value": "76 in"
    },
    {
      "key": "Color Family",
      "value": "Brown"
    },
    {
      "key": "Color/Pattern",
      "value": "nan"
    },
    {
      "key": "Cover Type",
      "value": "Dining group"
    },
    {
      "key": "Material",
      "value": "Polypropylene"
    },
    {
      "key": "MFG Brand Name",
      "value": "Duck Covers"
    },
    {
      "key": "Outdoor Living Product Type",
      "value": "Patio Furniture Cover"
    },
    {
      "key": "Patio Furniture Features",
      "value": "Waterproof"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "8"
    }
  ],
  "isDeleted": false
}