{
  "uid": 100673,
  "name": "Reflectix Radiant Barrier Insulation Roll",
  "description": "Reflectix Insulation has over 20 energy-saving applications for around the home. The list of uses includes crawl space, radiant floor, attic and walls. Our product is easy to handle and install. Reflectix requires only basic tools: A stapler, tape measure, utility knife, straight edge and safety glasses. Since our insulation is fiber-free, no protective garments or respirators are required.Reflectix 16 in. wide contractor size roll of double reflective insulation with staple tab that is easy to handle and installStaple tab edge is manufactured by perforating the bubbles three quarters of an inch down each edge of the product - this creates a foldable tab which provides easier stapling for installation in wall, ceiling and floor systemsR-values range from R-3.7 to R-21 depending on applicationOur energy saving applications include: HVAC ducts, water pipes, garage door, knee walls and water heaterInhibits condensationClass A / class 1 fire ratingManufactured at an ISO 9001:2008 facilityNo mess - no itchy fibersDoes not promote the growth of mold and mildewReflects 94%\u002B radiant energyWill not compress, collapse or disintegrateDurable and lightweightDoes not promote nesting for rodents and pestsVapor and radon retarder, not affected by moisture or humidityAdditional applications include wall and roof structures in metal and post frame buildingsLarge rolls for big projects are available through the special order program or on www.homedepot.comEco options approved product",
  "attributes": [
    {
      "key": "- Our energy saving applications include",
      "value": "HVAC ducts, water pipes, garage door, knee walls and water heater"
    },
    {
      "key": "- Manufactured at an ISO 9001",
      "value": "2008 facility"
    },
    {
      "key": "ENERGY STAR Certified",
      "value": "No"
    },
    {
      "key": "Friction Fit",
      "value": "No"
    },
    {
      "key": "Insulation Type",
      "value": "Radiant Barrier"
    },
    {
      "key": "MFG Brand Name",
      "value": "Reflectix"
    },
    {
      "key": "Product Length (ft.)",
      "value": "100 ft"
    },
    {
      "key": "Product Thickness (in.)",
      "value": ".3125 in"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "8"
    },
    {
      "key": "Sheet or Roll",
      "value": "Roll"
    }
  ],
  "isDeleted": false
}