{
  "uid": 100651,
  "name": "Coleman Solar Battery Maintainer Kit",
  "description": "The portable Coleman 2 Watt Solar Battery Maintainer offers an ideal way to maintain the batteries of cars, SUVs, boats, tractors and more. This unit is completely maintenance free and easy to install. Made with durable ABS plastic and amorphous solar cells, this solar panel charges in all daylight conditions, even on cloudy days. The panel plugs directly into your cigarette lighter and the suction cups allow for easy mounting of the panel to a window or a dashboard. The complete kit includes: 2 Watt solar battery maintainer, 7.5 ft. wire, 12 Volt DC plug, suction cups for easy mounting, and battery clamps. It has a temperature range of -40 to 176 degrees Fahrenheit.Made of durable ABS plastic and amorphous solar cellsExcellent for maintaining the batteries of cars, boats, SUVs, tractors and moreAmorphous solar panel works in all daylight conditions, even on cloudy daysMaintenance free / easy installationFor indoor use: inside the dash of a vehicle or by a window indoors as it is not waterproofPlugs into cigarette lighter with included battery clampsMounts on windshield with included suction cupsTemperature range: -40 to 176 FIncludes: alligator battery clamps, 12 Volt DC plug, 7.5 ft. of wire, suction cups to mount panel onto windshieldHome Depot Protection Plan:",
  "attributes": [
    {
      "key": "Amperage (amps)",
      "value": "0.12"
    },
    {
      "key": "- For indoor use",
      "value": "inside the dash of a vehicle or by a window indoors as it is not waterproof"
    },
    {
      "key": "- Temperature range",
      "value": "-40° to 176° F"
    },
    {
      "key": "- Includes",
      "value": "alligator battery clamps, 12 Volt DC plug, 7.5 ft. of wire, suction cups to mount panel onto windshield"
    },
    {
      "key": "Charge controller included",
      "value": "No"
    },
    {
      "key": "Electrical Product Type",
      "value": "Solar Power Maintainer"
    },
    {
      "key": "Inverter included",
      "value": "No"
    },
    {
      "key": "Low voltage audible alarm",
      "value": "No"
    },
    {
      "key": "MFG Brand Name",
      "value": "Coleman"
    },
    {
      "key": "Mounting frame included",
      "value": "No"
    },
    {
      "key": "Panel Height (in.)",
      "value": "0.50 in"
    },
    {
      "key": "Panel length (in.)",
      "value": "13.75"
    },
    {
      "key": "Panel weight (lb.)",
      "value": "1"
    },
    {
      "key": "Panel Width (in.)",
      "value": "5.00 in"
    },
    {
      "key": "Portable",
      "value": "Yes"
    },
    {
      "key": "Product Depth (in.)",
      "value": "0.5"
    },
    {
      "key": "Product Height (in.)",
      "value": "14"
    },
    {
      "key": "Product Width (in.)",
      "value": "7.5"
    },
    {
      "key": "Voltage (volts)",
      "value": "12"
    },
    {
      "key": "Wattage (watts)",
      "value": "2"
    }
  ],
  "isDeleted": false
}