{
  "uid": 100647,
  "name": "Tripp Lite PowerGuard 8-Outlet Surge Protector with 25ft Cord",
  "description": "Tripp Lite\u0027s TLP825 offers complete AC surge suppression for comprehensive system protection of workstations, desktop PCs, telecom systems and other sensitive electronics. Heavy grade AC surge suppression shields connected equipment from damage and performance problems due to the heaviest transient surges. TLP825 offers 8 total outlets, 25 foot cord with space-saving angled plug and diagnostic LEDs to warn of wiring problems and suppressor damage. Network grade AC suppression rated at 1440 joules shields equipment from surges and line noise. Integrated child-safety outlet covers safely seal off unused outlets. Attractive white housing with keyhole mounting slots and 3 designated transformer plug outlets offers convenient protection of desktop computer equipment and accessories.8 AC outlets with 3 transformer plug outlet that doesn\u0027t block remaining outlets25 foot AC line cable conveniently reaches distant outletsBuilt-in power switch with integrated 15 amp circuit breaker offers power control and overload protection over all outletsFail-safe thermal fusing protects against fire and other damage in the event of an extreme, extended overvoltage or surge conditionHome Depot Protection Plan:",
  "attributes": [
    {
      "key": "Certifications and Listings",
      "value": "1-UL Listed,CSA Listed,ETL Listed"
    },
    {
      "key": "Color Family",
      "value": "White"
    },
    {
      "key": "Color/Finish",
      "value": "IGNORE-No existing value"
    },
    {
      "key": "Commercial / Residential",
      "value": "Residential"
    },
    {
      "key": "Cord Included",
      "value": "Yes"
    },
    {
      "key": "Electrical Product Type",
      "value": "Plug/Connector"
    },
    {
      "key": "Hospital Grade",
      "value": "No"
    },
    {
      "key": "Material",
      "value": "Plastic"
    },
    {
      "key": "MFG Brand Name",
      "value": "Tripp Lite"
    },
    {
      "key": "Package Quantity",
      "value": "1"
    },
    {
      "key": "Plug/Connector",
      "value": "Connector"
    },
    {
      "key": "Product Depth (in.)",
      "value": "1.51"
    },
    {
      "key": "Product Height (in.)",
      "value": "4.86"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "3.46"
    },
    {
      "key": "Product Width (in.)",
      "value": "9.55"
    },
    {
      "key": "UL Listing",
      "value": "1-UL Listed"
    }
  ],
  "isDeleted": false
}