{
  "uid": 100617,
  "name": "Designers Edge L1323 High Intensity SMD LED Work Light",
  "description": "Designers Edge L1323 (24) 120 Degree High Intensity SMD LED Work Light remains cool to the touch after hours of use and features high intensity, 120 degree LEDs that produce up to 779 Lumens of long lasting light. Use this light to tackle a wide range of tasks including work site and construction lighting. These high intensity LEDs have a long lifespan, consume less energy and remain cool to the touch. The light features a padded grip, non-skid feet and a weatherproof on/off switch. cETL, Lighting Facts accredited. Coleman Cable, Inc. is a leading manufacturer and innovator of electrical and electronic wire and cable products for the security, sound, telecommunications, electrical construction, and retail, commercial, industrial, irrigation, HVAC and automotive markets. Coleman Cable, Inc. offers a family of leading brands such as Moon rays, Fire Shield and Designers Edge. Since 1987, Designers Edge has been building its reputation as an innovator of commercial and industrial lighting. Designers Edge is recognized as a leader in its industry and holds multiple patents and awards for its world class designs.Polymeric housing is mounted on a metal H-frame for added stabilityProduce up to 779 Lumens of long lasting lightFeatures a high output reflector, weatherproof switch and (24) 120 degree, high intensity LEDs18/3-Gauge power cord is 3 ft. long",
  "attributes": [
    {
      "key": "Bulb Type Included",
      "value": "LED"
    },
    {
      "key": "Certifications and Listings",
      "value": "1-UL Listed,ETL Listed"
    },
    {
      "key": "Color/Finish Family",
      "value": "Green"
    },
    {
      "key": "Commercial Light Type",
      "value": "Work Light"
    },
    {
      "key": "ENERGY STAR Certified",
      "value": "No"
    },
    {
      "key": "Fixture Color/Finish",
      "value": "Green"
    },
    {
      "key": "Hardware Included",
      "value": "No"
    },
    {
      "key": "Light Bulb Base Code",
      "value": "Other"
    },
    {
      "key": "Light Source",
      "value": "LED"
    },
    {
      "key": "Maximum Wattage (watts)",
      "value": "0"
    },
    {
      "key": "MFG Brand Name",
      "value": "Designers Edge"
    },
    {
      "key": "Number of Bulbs Required",
      "value": "24"
    },
    {
      "key": "Product Depth (in.)",
      "value": "12.75"
    },
    {
      "key": "Product Height (in.)",
      "value": "12.75"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "5.07"
    },
    {
      "key": "Product Width (in.)",
      "value": "11.25"
    }
  ],
  "isDeleted": false
}