{
  "uid": 100607,
  "name": "Sigman Beige Canvas Tarp - 7x9 ft. Heavy Duty",
  "description": "Sigman 10 oz. Beige Canvas Tarps are made from single filled cotton canvas duck. Beige canvas tarps are more environmentally friendly than plastic tarps such as poly tarps and vinyl tarps. Sigman beige canvas tarps are water, mildew and rot resistant. The beige canvas tarps are breathable and allow moisture to evaporate. Ideal for covering farm equipment, tractors, construction machinery, lumber, steel and for outdoor storage.Canvas tarps great for farm tarps, construction equipment tarps and general outdoor tarpsBeige canvas tarp fabric weight: 10 oz. per sq. yd before water resistant treatment and 16 oz. after water resistant treatment; biodegradable and environmentally friendly; color: BeigeThis beige canvas tarp has double stitched hems and seams and patch reinforced grommets on all sides7 ft. x 9 ft. canvas tarp covers area of up to approximately 63 sq. ft.Rust-resistant brass grommets approximately every 2 ft. for easy tie-downReusableWARNING: Canvas tarps are for outdoor use only; canvas tarp\u0027s wax and color dye may rub off and stain surfaces; canvas tarps may initially have an odorWARNING: Canvas tarp fabric is water resistant and breathable, but not 100% waterproof; if you need water proof material, please consider vinyl tarps or poly tarpsWARNING: Canvas tarps not recommended as car covers, boat covers or furniture covers because wax and dye on canvas tarps may rub off and stain surfacesWARNING: Canvas tarps are non-trailer able; for trailer tarps, please use high strength Sigman 18 oz. Vinyl Coated Polyester Tarps",
  "attributes": [
    {
      "key": "- Beige canvas tarp fabric weight",
      "value": "10 oz. per sq. yd before water resistant treatment and 16 oz. after water resistant treatment; biodegradable and environmentally friendly; color: Beige"
    },
    {
      "key": "- WARNING",
      "value": "Canvas tarps are for outdoor use only; canvas tarp\u0027s wax and color dye may rub off and stain surfaces; canvas tarps may initially have an odor"
    },
    {
      "key": "- WARNING",
      "value": "Canvas tarp fabric is water resistant and breathable, but not 100% waterproof; if you need water proof material, please consider vinyl tarps or poly tarps"
    },
    {
      "key": "- WARNING",
      "value": "Canvas tarps not recommended as car covers, boat covers or furniture covers because wax and dye on canvas tarps may rub off and stain surfaces"
    },
    {
      "key": "- WARNING",
      "value": "Canvas tarps are non-trailer able; for trailer tarps, please use high strength Sigman 18 oz. Vinyl Coated Polyester Tarps"
    },
    {
      "key": "Color Family",
      "value": "Beige / Cream"
    },
    {
      "key": "Color/Finish",
      "value": "Beige"
    },
    {
      "key": "Durability",
      "value": "Heavy duty"
    },
    {
      "key": "Material",
      "value": "Canvas"
    },
    {
      "key": "MFG Brand Name",
      "value": "Sigman"
    },
    {
      "key": "Paint Product Type",
      "value": "Tarps"
    },
    {
      "key": "Product Depth (in.)",
      "value": "80"
    },
    {
      "key": "Product Height (in.)",
      "value": "0.5"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "7.5"
    },
    {
      "key": "Product Width (in.)",
      "value": "104"
    },
    {
      "key": "Space between grommets (ft.)",
      "value": "2"
    },
    {
      "key": "Tarp Size (ft)",
      "value": "7x9"
    },
    {
      "key": "Tarp Width (ft.) x Tarp Length (ft.)",
      "value": "7 x 9"
    },
    {
      "key": "Tarps \u0026 Accessories Product Type",
      "value": "Tarps"
    },
    {
      "key": "Tarps, Drop Cloths \u0026 Plastic Sheeting Product Type",
      "value": "Tarps \u0026 Accessories"
    },
    {
      "key": "UV Resistant",
      "value": "No"
    },
    {
      "key": "Washable/Reusable",
      "value": "Yes"
    },
    {
      "key": "Water Resistant",
      "value": "Yes"
    }
  ],
  "isDeleted": false
}