{
  "uid": 100683,
  "name": "Brondell FreshSpa Hygienic Bidet Toilet Attachment",
  "description": "The Brondell FreshSpa easy bidet toilet attachment is a simple and inexpensive way to retrofit your existing toilet into a hygienic bidet. It provides personalized wash settings for maximum comfort and cleanliness, and even has a self-cleaning function. The easy-to-use controls allow for adjustable water pressure, from a gentle wash to a concentrated stream, while the wash nozzle has three separate angled positions, ensuring accurate coverage for all types of users. The FreshSpa is a snap to install on your existing toilet, usually requiring 20 minutes or less, and is compatible with all standard 2-piece toilet fixtures and even fits many contoured 1-piece toilets (French curve). It was manufactured with high-quality anti-bacterial ABS plastic and has a full body panel for simple cleaning and maintaining. It uses a heavy-duty solid brass core internal valve, solid brass T-valve and braided PVC hose with metal connectors. Its features guarantee no messy leaks or drips.Ambient temperature bidet washNozzle positioning with three settingsAdjustable water pressureRetractable, self-cleaning nozzleAnti-bacterial ABS plastic constructionAll-brass internal valveEasy installation and adjustable toilet fitIncludes all accessories for standard installation1-year limited manufacturer warrantyRetrofit your existing toilet into a hygenic bidet",
  "attributes": [
    {
      "key": "Color Family",
      "value": "White"
    },
    {
      "key": "MFG Brand Name",
      "value": "Brondell"
    },
    {
      "key": "Product Depth (in.)",
      "value": "17.3"
    },
    {
      "key": "Product Height (in.)",
      "value": "3"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "2"
    },
    {
      "key": "Product Width (in.)",
      "value": "8.5"
    },
    {
      "key": "Toilet Features",
      "value": "No Additional Features"
    },
    {
      "key": "Toilet Included Components",
      "value": "No Addional Items Included"
    }
  ],
  "isDeleted": false
}