{
  "uid": 100635,
  "name": "RIDGID GEN5X Brushless 18-Volt Compact Hammer Drill Combo Kit",
  "description": "RIDGID introduces their next generation of cordless tool with the GEN5X Brushless 18-Volt Compact Hammer Drill/Driver and 3-Speed Impact Driver Combo Kit. The 18-Volt Brushless 2-Piece kit has best-in-class torque for the most demanding applications. RIDGID brushless has up to 50% more run time and longer motor life. Powered by 4.0Ah Hyper Lithium Technology, an innovative battery technology built for high performance. With free registration, this kit is covered for life. Free Batteries, free Parts and free Service, for Life.California residents: see\u0026nbsp;Proposition 65 informationIncludes: R86116 Hammer Drill, R86037 Impact Driver, (2) R840087 4.0Ah HYPER Lithium-Ion Batteries, R840095 Charger, (2) belt hooks with screws, Auxiliary Handle, (2) Bits, Bag and Operator\u0027s Manuals.Hammer drill: best-in-class torque with a powerful 700 in. lbs. of torque in a compact hammer drillHammer drill: compact size and lightweight design for a fully powered hammer drill in a compact sizeHammer drill mode selector quickly transition between driving, drilling or hammer modes without changing the micro-clutch settingImpact drill: best-in-class torque with a crushing industry leading 2,250 in-lbs of torqueImpact drill: 3 speed settings provide adjustable power and speed for the most demanding jobs as well as precision workImpact drill: tri-beam 3 LED lights around the front housing to eliminate shadowsGrip light engages light independently of trigger to illuminate work spaceHex grip enhanced micro-texture for secure grip and maximum user comfort4.0 HYPER lithium-ion batteries have triple-protection electronics, best-in-class extreme weather performance and on-battery fuel gaugesGEN5X brushless motors technology deliver up to 50% more run time and longer motor lifeCLICK HERE TO REGISTER YOUR RIDGID PRODUCT.",
  "attributes": [
    {
      "key": "Batteries Included",
      "value": "Yes"
    },
    {
      "key": "Battery Amp Hours",
      "value": "4"
    },
    {
      "key": "Battery Power Type",
      "value": "Lithium Ion"
    },
    {
      "key": "Battery Size",
      "value": "18-volt"
    },
    {
      "key": "- Hammer drill",
      "value": "best-in-class torque with a powerful 700 in. lbs. of torque in a compact hammer drill"
    },
    {
      "key": "- Hammer drill",
      "value": "compact size and lightweight design for a fully powered hammer drill in a compact size"
    },
    {
      "key": "- Impact drill",
      "value": "best-in-class torque with a crushing industry leading 2,500 in-lbs of torque"
    },
    {
      "key": "- Impact drill",
      "value": "3 speed settings provide adjustable power and speed for the most demanding jobs as well as precision work"
    },
    {
      "key": "- Impact drill",
      "value": "tri-beam 3 LED lights around the front housing to eliminate shadows"
    },
    {
      "key": "Certifications and Listings",
      "value": "cUL Listed"
    },
    {
      "key": "Charger Included",
      "value": "Yes"
    },
    {
      "key": "Color Family",
      "value": "Orange"
    },
    {
      "key": "Cordless Tool Type",
      "value": "Combo Kit"
    },
    {
      "key": "Cordless/Corded",
      "value": "Cordless"
    },
    {
      "key": "MFG Brand Name",
      "value": "RIDGID"
    },
    {
      "key": "Number of Batteries Included",
      "value": "2"
    },
    {
      "key": "Number of Tools Included",
      "value": "2"
    },
    {
      "key": "Power Tool Features",
      "value": "Bag Included,Bits/Blades Included,Brushless"
    },
    {
      "key": "Power Tool Product Type",
      "value": "Cordless"
    },
    {
      "key": "Product Depth (in.)",
      "value": "9.06 in"
    },
    {
      "key": "Product Height (in.)",
      "value": "9.29 in"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "3"
    },
    {
      "key": "Product Width (in.)",
      "value": "11.81 in"
    },
    {
      "key": "Reconditioned",
      "value": "No"
    },
    {
      "key": "Tools Included",
      "value": "Hammer Driver Drill,Impact Driver"
    },
    {
      "key": "Tools Product Type",
      "value": "Power Tool"
    },
    {
      "key": "Voltage (volts)",
      "value": "18"
    }
  ],
  "isDeleted": false
}