{
  "uid": 100657,
  "name": "EZ-Ivy Green Bamboo Ivy Fence Panel",
  "description": "Instant privacy, Safety \u0026 Beauty. EZ Ivy Our collapsible bamboo ivy fence will transform any ordinary structure into a maintenance-free beautiful one. This artificial ivy hides unsightly views while providing lush greenery year-round. Perfect for front yards, backyards, balconies, decks, pools, hot tubs, restaurants, cafes, real estate staging, apartments, rentals, special events and many more. Easy to install and instantly enjoy privacy, safety and beauty. This product replicates a bamboo organic look with one side covering and can expand to 126 in. wide.Expands to approx. 20 sq/ftAssembled Dimension: 24 in. W x 2 in. D x 120 in. HMaintenance free: have you ever tried to maintain real ivy, it strangles other plants and takes overRealistic: EZ-Ivy blends beautifully with natural landscapingEZ-Ivy maintains its healthy green color and appearance without the hassle and cost of watering itEZ installation: install using standard zip or twist ties that you buy for regular shrubs or even using a staple gun, it goes up fast and easyDurable: UV resistant and extremely durable in the harshest environments that Mother Nature has to offer,EZ-Ivy doesn\u0027t crack, disintegrate or fade, its remains beautiful year after yearRemains green year-round: specially formulated UV resistant materials ensures that EZ-Ivy maintains its lush, vibrant colorBlends in with real ivy or plants: EZ-Ivy blends naturally with your existing plants or ivy, great for starting an ivy fence or wall to get instant privacy and coverage while the real ivy grows and blends in with your EZ-IvyPlease Note: EZ-Ivy is not fire proofAnother great feature is rodents stay away from EZ-Ivy unlike real ivy were rodents nest and infestWith EZ-Ivy not only are you saving on your water bill, but you don\u0027t have to trim and maintain it",
  "attributes": [
    {
      "key": "- Assembled Dimension",
      "value": "24 in. W x 2 in. D x 120 in. H"
    },
    {
      "key": "- Maintenance free",
      "value": "have you ever tried to maintain real ivy, it strangles other plants and takes over"
    },
    {
      "key": "- Realistic",
      "value": "EZ-Ivy blends beautifully with natural landscaping"
    },
    {
      "key": "- EZ installation",
      "value": "install using standard zip or twist ties that you buy for regular shrubs or even using a staple gun, it goes up fast and easy"
    },
    {
      "key": "- Durable",
      "value": "UV resistant and extremely durable in the harshest environments that Mother Nature has to offer,EZ-Ivy doesn\u0027t crack, disintegrate or fade, its remains beautiful year after year"
    },
    {
      "key": "- Remains green year-round",
      "value": "specially formulated UV resistant materials ensures that EZ-Ivy maintains its lush, vibrant color"
    },
    {
      "key": "- Blends in with real ivy or plants",
      "value": "EZ-Ivy blends naturally with your existing plants or ivy, great for starting an ivy fence or wall to get instant privacy and coverage while the real ivy grows and blends in with your EZ-Ivy"
    },
    {
      "key": "- Please Note",
      "value": "EZ-Ivy is not fire proof"
    },
    {
      "key": "Color",
      "value": "Green"
    },
    {
      "key": "Color Family",
      "value": "Greens"
    },
    {
      "key": "Container included",
      "value": "Yes"
    },
    {
      "key": "Decor Product Type",
      "value": "Decorative Accessory"
    },
    {
      "key": "Decorative Accessory Product Type",
      "value": "Artificial Plant"
    },
    {
      "key": "MFG Brand Name",
      "value": "EZ-Ivy"
    },
    {
      "key": "Plant category",
      "value": "Plants"
    },
    {
      "key": "Plant variety",
      "value": "Ivy"
    },
    {
      "key": "Product Depth (in.)",
      "value": "2"
    },
    {
      "key": "Product Height (in.)",
      "value": "120"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "5.4"
    },
    {
      "key": "Product Width (in.)",
      "value": "24"
    }
  ],
  "isDeleted": false
}