{
  "uid": 100775,
  "name": "Mighty Mule Slide Gate Opener Kit with Solar Compatibility",
  "description": "The Mighty Mule MM-SL2000B electric Gate Opener is a slide gate opener that is ideal for heavy duty commercial or residential single slide gates. The operator is designed for gates weighing up to 1000 lbs. and up to 30 ft. in length that allows for a 20 ft. opening. For dual panel applications, the Mighty Mule Dual Slide Operator (MM-SL2200B) is required. Included is a standard safety feature; Internal Friction Brake Lock that locks the gate in the closed position for added safety and security. Also includes an adjustable obstruction sensor, gate sequencing and auto close settings. The operator can be programmed for left to right or right to left opening.Includes a battery (FM150), single button remote (FM135), AC transformer (RB750), radio receiver and all hardware for installationIdeal for single slide gate panels that weigh up to 1,000 lb. and are 30 ft. long that allows for a 20 ft. opening and opening time is 1 ft. per second and has a high cycle capabilityThe SL2000B\u0027s includes an adjustable obstruction sensor, gate sequencing and auto close settingsFor commercial and residential slide gate applications that are UL rated for Class I,II,III with a compact designRated for over 50 cycles per dayPowered by a 12 volt DC motor and is solar compatibleProvides connections for safety loops, vehicle exit wands, intercoms, card readers and phone systems30% Residential Energy Efficient Property Tax Credit available, residential home owners can use this credit on a new operator system, accessories and installation with the purchase of a 10-Watt Mighty Mule solar panel (FM123)Backed by a 24 Month Mighty Mule warranty and technical support",
  "attributes": [
    {
      "key": "Commercial/Residential Use",
      "value": "Commercial / Residential"
    },
    {
      "key": "Fencing Product Type",
      "value": "Gate Opener Remote/Transmitter"
    },
    {
      "key": "Gate opening style",
      "value": "Sliding"
    },
    {
      "key": "Hardware Included",
      "value": "Yes"
    },
    {
      "key": "Keypad",
      "value": "No"
    },
    {
      "key": "Maximum gate size (ft.)",
      "value": "20"
    },
    {
      "key": "MFG Brand Name",
      "value": "Mighty Mule"
    },
    {
      "key": "Power Requirements",
      "value": "AC or Solar"
    },
    {
      "key": "Product Depth (in.)",
      "value": "34"
    },
    {
      "key": "Product Height (in.)",
      "value": "27"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "70"
    },
    {
      "key": "Product Width (in.)",
      "value": "49"
    },
    {
      "key": "Weight Capacity (lb.)",
      "value": "1000"
    }
  ],
  "isDeleted": false
}