{
  "uid": 100764,
  "name": "DEWALT Precision Pro Compound Miter Saw - 12 in.",
  "description": "You need accuracy from your miter saw and this tool delivers. The Heavy Duty Single-Bevel Compound Miter Saw\u0027s precise miter system and innovative machined base fence design deliver long-term fence straightness by providing additional support. This miter saw is powered by a 15-Amp motor and comes equipped with a 12 in. carbide blade that spins at 4000 RPM.Includes a carbide blade, dust bag, blade wrench and comfortable side handles in the baseMiter detent override that allows you to override the miter stops and adjust to the desired setting without the saw slipping into the miter detentsAdjustable stainless steel miter detent plate with 11 positive stopsTall sliding fences that support crown moulding up to 5-1/4 in. nested and base moulding up to 6-1/2 in. vertically against the fence while easily sliding out of the way for bevel cutsCrosscut capacity up to 2x8 in. dimensional lumberBevels to the left up to 48 and to the right up to 3, with positive stops at 0, 45 and 33.9 for cutting crown moulding laying flatLightweight saw design at 42 lbs. for portabilityCam lock miter handle with miter detent override that eliminates the need to twist the handle to lock in on the angle4 hardened steel bevel stops at 0, 33.9, 45 and 48 that delivers versatility at most common bevel anglesIndependently certified to applicable standards3-year limited manufacturer warranty1-year free service contract with DEWALT90-day money-back guaranteeHome Depot Protection Plan:",
  "attributes": [
    {
      "key": "Amperage (amps)",
      "value": "15"
    },
    {
      "key": "Arbor Size",
      "value": "1 In."
    },
    {
      "key": "Bevel Type",
      "value": "Single"
    },
    {
      "key": "Blade Diameter",
      "value": "12 in"
    },
    {
      "key": "Certifications and Listings",
      "value": "1-UL Listed"
    },
    {
      "key": "Color Family",
      "value": "Yellow"
    },
    {
      "key": "Cord Length (ft.)",
      "value": "6"
    },
    {
      "key": "Corded Tool Type",
      "value": "Miter Saw"
    },
    {
      "key": "Cordless/Corded",
      "value": "Corded"
    },
    {
      "key": "Dust collection type",
      "value": "Bag"
    },
    {
      "key": "Keyless/keyed blade change",
      "value": "Keyed"
    },
    {
      "key": "Maximum Cutting Thickness (in.)",
      "value": "8"
    },
    {
      "key": "Maximum Degree Miter Cuts - Left",
      "value": "50 °"
    },
    {
      "key": "Maximum Degree Miter Cuts - Right",
      "value": "50 °"
    },
    {
      "key": "MFG Brand Name",
      "value": "DEWALT"
    },
    {
      "key": "Miter Saw Type",
      "value": "Compound"
    },
    {
      "key": "Power Tool Features",
      "value": "Positive Stops"
    },
    {
      "key": "Power Tool Product Type",
      "value": "Corded"
    },
    {
      "key": "Product Depth (in.)",
      "value": "24.03 in"
    },
    {
      "key": "Product Height (in.)",
      "value": "15.98 in"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "40"
    },
    {
      "key": "Product Width (in.)",
      "value": "18.08 in"
    },
    {
      "key": "Reconditioned",
      "value": "No"
    },
    {
      "key": "Tools Product Type",
      "value": "Power Tool"
    }
  ],
  "isDeleted": false
}