{
  "uid": 100703,
  "name": "TrafficMASTER Portland Stone Gray Ceramic Floor and Wall Tile",
  "description": "The Portland Stone 18 in. x 18 in. Gray Ceramic Floor and Wall Tile is designed for medium-duty residential floors, including kitchens, halls, corridors and balconies. A great way to incorporate a touch of style into your space at a great price. Emulates the look of stone in a ceramic body. Large format tile is great for small or large areas.17.44 square feet, 8 pieces per case. Case weight is 70 lb.Grade 1, ceramic tile for floor, wall and countertop use18 in. width x 18 in. length x 9 mm thickGlazed smooth finish with a low sheen and slight variation in toneP.E.I. Rating III is suitable for medium-duty residential floors including kitchens, halls, corridors, balconies, terraces and areas used more often with normal footwear and small amounts of dirtSemi-Vitreous flooring has water absorption of more than 0.5% but less than 3% for indoor use and some outdoor applications is not frost resistantC.O.F. greater than .50 is recommended for standard residential applications and is marginally skid resistant. Indoor useNot frost resistantResidential onlyLearn how to get a Lifetime Warranty by using Custom Building Products from The Home Depot. Visit www.homedepot.com/CBPDon\u0027t forget your coordinating trim pieces, grout, backerboard, thinset and installation toolsThis item is available for in store purchase onlyIt is recommended you purchase a minimum of 10% overage to account for design cuts and patterns",
  "attributes": [
    {
      "key": "Approximate Tile Size",
      "value": "18x18"
    },
    {
      "key": "Break Strength (lb.)",
      "value": "251"
    },
    {
      "key": "Color Family",
      "value": "Grays"
    },
    {
      "key": "Color/Finish",
      "value": "Grays"
    },
    {
      "key": "Commercial / Residential",
      "value": "Residential"
    },
    {
      "key": "DCOF Rating",
      "value": "Less than 0.42"
    },
    {
      "key": "Exact Dry SCOF Rating",
      "value": ".65"
    },
    {
      "key": "Exact Wet SCOF Rating",
      "value": ".3"
    },
    {
      "key": "Flooring Product Type",
      "value": "Ceramic Tile"
    },
    {
      "key": "MFG Brand Name",
      "value": "TrafficMASTER"
    },
    {
      "key": "Number of Tiles per Case",
      "value": "8"
    },
    {
      "key": "Product Length (in.)",
      "value": "18"
    },
    {
      "key": "Product Thickness (mm)",
      "value": "9"
    },
    {
      "key": "Product Width (in.)",
      "value": "18"
    },
    {
      "key": "Style Type",
      "value": "Stone Look"
    },
    {
      "key": "Suggested Grout Line Size",
      "value": "1/8"
    },
    {
      "key": "Tile Features",
      "value": "Chemical Resistant,Glazed"
    },
    {
      "key": "Tile Finish",
      "value": "Matte"
    },
    {
      "key": "Tile Material",
      "value": "Ceramic"
    },
    {
      "key": "Tile Use",
      "value": "Accent Wall,Bath Wall,Bedroom Floor,Entry Way,Hallway Floor,Kitchen Floor,Living Room Floor,Shower Wall"
    }
  ],
  "isDeleted": false
}