{
  "uid": 100737,
  "name": "MS International Emperador Brown Marble Splitface Mosaic Wall Tile",
  "description": "With its unglazed finish, the MS International Inc Emperador Splitface 12 in. x 12 in. Brown Marble Mesh-Mounted Mosaic Tile makes an understated but stylish impact on your walls. Designed for indoor use, this natural stone wall tile has water absorption of less than 0.5% and is certified by the Marble Institute of America.1 square foot per piece, each piece sold individually - piece weight equals 5 lb.Grade 1, natural marble mosaic for wall use12 in. width x 12 in. length x 10mm thick mesh-mounted mosaic; 5/8 in. W x 2 in. L brick piecesSplitface finish with a low sheen and a random variation in toneP.E.I. Rating is not applicable for natural stoneVitreous flooring has water absorption of more than 0.5% but less than 3% for indoor use and some outdoor applications and is frost resistantC.O.F. is not applicable to wall tile itemsCompletely frost resistant for indoor or outdoor applications; use a latex-modified thinset for acceptable bond strengthResidential and commercial useGenuine StoneDon\u0027t forget your coordinating trim pieces, grout, backerboard, thinset, and installation toolsAll online orders for this item ship via common carrier or parcel ground and may arrive in multiple boxesIt is recommended you purchase a minimum of 10% overage to account for design cuts and patternsThis is a GREENGUARD Indoor Air Quality Certified and GREENGUARD Children \u0026 Schools Certified product",
  "attributes": [
    {
      "key": "Approximate Tile Size",
      "value": "12x12"
    },
    {
      "key": "Color Family",
      "value": "Browns / Tans"
    },
    {
      "key": "Color/Finish",
      "value": "Brown"
    },
    {
      "key": "Commercial / Residential",
      "value": "Commercial / Residential"
    },
    {
      "key": "Flooring Product Type",
      "value": "Mosaic Tile"
    },
    {
      "key": "MFG Brand Name",
      "value": "MS International"
    },
    {
      "key": "Mosaic Sub Unit Length (in.)",
      "value": "Random"
    },
    {
      "key": "Mosaic Sub Unit Width (in.)",
      "value": "Random"
    },
    {
      "key": "Number of Tiles per Case",
      "value": "1"
    },
    {
      "key": "Product Length (in.)",
      "value": "12"
    },
    {
      "key": "Product Thickness (mm)",
      "value": "10"
    },
    {
      "key": "Product Width (in.)",
      "value": "12"
    },
    {
      "key": "Style Type",
      "value": "Contemporary"
    },
    {
      "key": "Suggested Grout Line Size",
      "value": "1/8"
    },
    {
      "key": "Tile Features",
      "value": "Radiant/Underfloor Warming Heating"
    },
    {
      "key": "Tile Finish",
      "value": "Polished"
    },
    {
      "key": "Tile Material",
      "value": "Marble"
    },
    {
      "key": "Tile Use",
      "value": "Accent Wall,Backsplash,Bath Wall,Exterior Wall,Fireplace Facade,Outdoor,Shower Wall"
    }
  ],
  "isDeleted": false
}