{
  "uid": 100779,
  "name": "OnlinePlantCenter SunSedum Yellow Evergreen Ground Cover",
  "description": "Fast growing, succulent, evergreen ground cover with finely dissected, needle like, brilliant yellow, summer foliage. In fall, the ends of each leaf change to an orange color which holds through winter to spring. Dense, mat like 3 to 5 in. tall by 18 in. wide, ground hugging habit. In summer, showy, plate like heads of starry, yellow, flower clusters are held on eight in. tall, sturdy stems. Plant in full sun in most any soil. it\u0027s thick succulent leaves help to withstand dry periods, and it is considered extremely drought tolerant once established. Wonderful when allowed to cascade over the edge of container plantings. Also, use on slopes. A robust perennial, for sure.Extremely drought tolerant ground cover perennialShowy, starry, yellow flower clusters in summerThick, succulent leavesEasy to grow, low maintenance, evergreen perennial1 gal. pot - state or federal regulations may require this plant to ship as a bare root plant, without pot and without soilMay ship in a dormant state, where winter color is not as bold as summer huesThis plant ships bare root, with no pot and no soil, to Arizona, California, Idaho, Montana, Nevada, Oregon, Utah, and WashingtonPerforms best in plant growing zones 4 to 8, when grown in other Zones, special care requirements will be requiredTo accommodate mature size or when planting in groups, space 10 in. away from other plants or structuresWhen shipped as a bare root plant, the Shake \u0026 Ship system has been used to remove soil from roots",
  "attributes": [
    {
      "key": "Additional Characteristics",
      "value": "Deer Resistant,Disease Resistant,Drought Tolerant,Insect Resistant"
    },
    {
      "key": "Blossom Color",
      "value": "Yellow"
    },
    {
      "key": "Botanical Name",
      "value": "Sedum repestre \u0027Angelina"
    },
    {
      "key": "Hardiness Zone",
      "value": "4,5,6,7,8"
    },
    {
      "key": "Mature Height (in.)",
      "value": "4 in"
    },
    {
      "key": "Mature Width (in.)",
      "value": "10 in"
    },
    {
      "key": "MFG Brand Name",
      "value": "OnlinePlantCenter"
    },
    {
      "key": "Shipped As",
      "value": "Container"
    },
    {
      "key": "Sun Tolerance",
      "value": "Full Sun"
    },
    {
      "key": "Water Requirements",
      "value": "Low"
    }
  ],
  "isDeleted": false
}