{
  "uid": 100736,
  "name": "Loctite Landscaping Adhesive, Heavy Duty Exterior Construction Adhesive",
  "description": "Loctite PL 500 Landscape Block Adhesive is an exterior, heavy-duty, premium quality adhesive designed to meet any landscaping need. It delivers a quick and easy solution to installing the final course of cap with landscape blocks and the installation of cement paving stones. Excellent for landscaping projects, such as securing block walls and capstones and for bonding brick, stone, timbers, concrete, metal and wood. Loctite PL 500 Landscape Block Adhesive formula may be used under a variety of moisture and temperature conditions ranging from sub-freezing to elevated temperatures and dry, wet or frozen materials. Provides excellent flexibility to compensate for the different expansion rates of dissimilar materials. It is particularly effective when bonding irregular surfaces or bridging gaps between surfaces. Low VOC formulation can be used in all 50 states.California residents: see\u0026nbsp;Proposition 65 informationHeavy duty exterior construction adhesive formulated specifically to adhere brick and stone; perfect for most landscaping projectsGunnable in cold weather and will not roll up on wet and frozen lumber as other adhesives willWaterproof and weather resistant, excellent for us in temperature extremesGap filling properties will help to bridge minor gaps when bonding irregular surfacesProduct may vary by storeNote: Product may vary by store.",
  "attributes": [
    {
      "key": "Adhesion level",
      "value": "High"
    },
    {
      "key": "Adhesive Product Type",
      "value": "Construction Adhesive"
    },
    {
      "key": "- Note",
      "value": "Product may vary by store."
    },
    {
      "key": "Construction adhesive type",
      "value": "Specialty"
    },
    {
      "key": "Curing time (hours)",
      "value": "168"
    },
    {
      "key": "Dries clear",
      "value": "No"
    },
    {
      "key": "Drillable",
      "value": "Yes"
    },
    {
      "key": "Flammable",
      "value": "No"
    },
    {
      "key": "Indoor/Outdoor",
      "value": "Outdoor"
    },
    {
      "key": "MFG Brand Name",
      "value": "Loctite"
    },
    {
      "key": "Moisture Resistant",
      "value": "Yes"
    },
    {
      "key": "Product Depth (in.)",
      "value": "1.875"
    },
    {
      "key": "Product Height (in.)",
      "value": "11.25"
    },
    {
      "key": "Product Weight (oz.)",
      "value": "16.96 oz"
    },
    {
      "key": "Product Width (in.)",
      "value": "1.875"
    },
    {
      "key": "Sandable",
      "value": "Yes"
    },
    {
      "key": "Set Time (Min.)",
      "value": "20"
    },
    {
      "key": "Solvent resistant",
      "value": "Yes"
    },
    {
      "key": "Stainable/Paintable",
      "value": "Paintable"
    },
    {
      "key": "UV/sunlight resistant",
      "value": "Yes"
    }
  ],
  "isDeleted": false
}