{
  "uid": 100750,
  "name": "GE Energy Star 4.6 cu. ft. Top Load Washer",
  "description": "Your GE ENERGY STAR 4.6 cu. ft. DOE Top Load Washer in White features a stainless steel capacity washer that won\u0027t rust, chip or snag clothing. It is ENERGY STAR qualified to meet or exceed federal guidelines for efficiency year-round energy and money savings. Stain PreTreat assists removing tough stains with preprogrammed settings that modify your cycle to treat the four most common stains. The all white appearance will add a touch of modern to your laundry room. GE appliances provide up-to-date technology and exceptional quality to simplify the way you live. With a timeless appearance, this family of appliances is ideal for your family. And, coming from one of the most trusted names in America, you know that this entire selection of appliances is as advanced as it is practical.4.6 cu. ft. DOE stainless steel washer handles bigger loads to let you enjoy more time in the living roomStainless Steel tub won\u0027t chip, rust or snag clothingSpeed Wash delivers ready to go results within minutesInfusor wash system uses HE detergent, requiring less water than a traditional top load washer14 wash cycles including delicates, jeans and casuals ensure that your expensive fabrics get the special attention that they needENERGY STAR qualified to meet or exceed federal guidelines for energy efficiency for year-round energy and money savingsElectronic controls for easy one-touch operation and cycle display timeAutomatic water level adjustment reduces wasteDelay start feature begins operation when it\u0027s most convenient for your scheduleQuiet design reduces operational noise, so you can do laundry at any time even when you have guestsSanitize with Oxi removes 99.99% of bacteria with a dedicated cycle that uses an Oxi additive to boost your detergent\u0027s cleaning power, while keeping fabrics looking and feeling their bestStain Removal Guide assists removing tough stains with preprogrammed settings that modify your cycle to treat the four most common mistakesWarm Rinse removes any leftover soap residueDeep Fill adds more water for larger loadsDeep Rinse removes any leftover soap residueAuto Soak loosens stains by soaking up to 2 hoursThe Home Depot will not hook up your washer with used fill hoses; new fill hoses will be offered during appliance checkoutClick Here for details on the services included with Delivery \u0026 Basic Hook-up and Installation options for Major Appliances",
  "attributes": [],
  "isDeleted": false
}