{
  "uid": 100753,
  "name": "Masonite Mini Blind Steel Patio Door with Vinyl Frame",
  "description": "Bring the beauty of the outdoors inside with the energy-efficient Masonite 60 in. x 80 in. Painted Prehung Inswing Right-Hand Mini blind Steel Patio Door with Brickmold in Vinyl Frame. Enjoy the scenery or, when privacy is needed, simply lower the internal mini blinds. Expertly designed, the blinds never need to be cleaned. The clear, multi-pane insulated glass is treated with a Low-E coating that reflects heat out of the home in the summer and locks in heat during the winter. Plus the premium polyurethane insulation and weatherstripping are designed to let the beauty of nature in, but the weather out resulting in lower heating and cooling bills. Upgrade to a maintenance-free white vinyl door frame that never requires painting. Includes vinyl brickmold integrated into frame for added architectural interest.California residents: see\u0026nbsp;Proposition 65 informationHigh-quality steel provides strength and securitySteel reinforced door features energy saving polyurethane door coreHigh performance compression weatherstripping helps to seal out draftsRaise and lower mini blinds are easy to use and maintain - available in standard glazed onlyLow-E tempered glass helps keep you comfortable in any seasonMasonite colors complement Behr paints color palette to easily coordinate your door with shutters, trim and moreRot-resistant bottom rail made of high-performance composite materialsPatio door slabs are double bored for lockset - not includedPatio door comes fully assembled with hinges, frame, aluminum sill and weatherstrippingPatio door comes fully assembled with hinges, vinyl frame, aluminum sill and weather strippingFrom outside, open towards the inside of the house with the hinges on the left/right",
  "attributes": [
    {
      "key": "Assembled Depth (in.)",
      "value": "4.5625 in"
    },
    {
      "key": "Assembled Height (in.)",
      "value": "79.5 in"
    },
    {
      "key": "Assembled Width (in.)",
      "value": "59.25 in"
    },
    {
      "key": "Color Family",
      "value": "White"
    },
    {
      "key": "Color/Finish",
      "value": "Pure White (ECC-50-50)"
    },
    {
      "key": "Commercial",
      "value": "No"
    },
    {
      "key": "Door Configuration",
      "value": "Double Door"
    },
    {
      "key": "Door Handing",
      "value": "Right-Hand/Inswing"
    },
    {
      "key": "Door Size (WxH) in.",
      "value": "60 x 80"
    },
    {
      "key": "Door Thickness (in.)",
      "value": "1.75 in"
    },
    {
      "key": "Door Type",
      "value": "French Patio Door"
    },
    {
      "key": "Energy Star Qualified",
      "value": "Not Qualified"
    },
    {
      "key": "Features",
      "value": "Blinds Between the Glass,Brickmould,Lockset Bore,Weatherstripping"
    },
    {
      "key": "Finish Type",
      "value": "Painted"
    },
    {
      "key": "Included",
      "value": "No additional items or accessories included"
    },
    {
      "key": "LowE rating",
      "value": "Yes"
    },
    {
      "key": "Material",
      "value": "Steel"
    },
    {
      "key": "MFG Brand Name",
      "value": "Masonite"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "240"
    }
  ],
  "isDeleted": false
}