{
  "uid": 100852,
  "name": "Glacier Bay White Medicine Cabinet with Adjustable Shelf",
  "description": "The Glacier Bay 15 in. x 19 in. Recessed or Surface Mount Medicine Cabinet in White has  a sturdy and durable wood frame finished in white to complement a wide range of decor. Featuring an adjustable shelf that accommodates various container shapes and sizes, this single mirror cabinet has a reversible door that can be installed to open to either the left or the right. Pre-assembled for convenient recessed or surface mount installation, this simple and stylish cabinet will provide years of use and enjoyment. Limited Lifetime Warranty.Adjustable hinges are concealed for a seamless appearanceSingle mirror offers convenience and a classic lookSturdy frame in white finish complements most decor1 adjustable shelf accommodates a variety of container shapes and sizesSturdy wood frame in white finish complements most decorAdjustable hinges are concealed for a seamless appearancePre-assembled for easy surface or recessed mount installationPre-assembled for easy installation",
  "attributes": [
    {
      "key": "Assembled Depth (in.)",
      "value": "5.00 in"
    },
    {
      "key": "Assembled Height (in.)",
      "value": "19.25 in"
    },
    {
      "key": "Assembled Width (in.)",
      "value": "15.25 in"
    },
    {
      "key": "Assembly Required",
      "value": "No"
    },
    {
      "key": "Cabinet material",
      "value": "Other"
    },
    {
      "key": "Color Family",
      "value": "White"
    },
    {
      "key": "Color/Finish",
      "value": "White"
    },
    {
      "key": "Frame Material",
      "value": "Other"
    },
    {
      "key": "Medicine Cabinet Width (in)",
      "value": "15.25"
    },
    {
      "key": "MFG Brand Name",
      "value": "Glacier Bay"
    },
    {
      "key": "Mount Type",
      "value": "Surface Mount"
    },
    {
      "key": "Number of Shelves",
      "value": "1"
    },
    {
      "key": "Shape",
      "value": "Rectangle"
    },
    {
      "key": "Shelf width (in.)",
      "value": "13.875"
    },
    {
      "key": "Vanity Features",
      "value": "Adjustable Hinges,Concealed Hinges,Recessed"
    },
    {
      "key": "Vanity Included Components",
      "value": "No Additional Included Components"
    },
    {
      "key": "Weight Capacity (lb.)",
      "value": "21"
    }
  ],
  "isDeleted": false
}