{
  "uid": 100849,
  "name": "Brush Master 11 HP Chipper Shredder with Adjustable Deflector",
  "description": "This chipper shredder comes with a brush master 11 HP engine. It features a 2-way feed including a discharge chute. This innovative chipper is designed with an adjustable deflector. The deflector provides multiple angles that can discharge directly into a container or garbage can or a standard outdoor trash can so there is no need for bagging. Self feeds and chips up to 3 in. diameter branches, turning yard waste into useful 1/4 in. mulch. Transforms 12 bags of yard waste into 1 bag of chips. Ideal for small weekend jobs and yard clean up. Highly portable and maneuverable.Transforms 3 x 3 in. dia. branches and debris into 1/4 in. chips2-Way feed; side chute and oversized top funnel for leaves11 HP, 270 cc engine with automatic low oil shutdownTop sloped funnel prevents chipper overloading enhancing durability and protecting the operatorEnvironmentally responsible: transforms 12 bags of yard waste into 1 bag of chipsTwo hardened steel cutting blades and 6 hammers for chipping efficiencyDischarge chute has adjustable deflector (allows multiple angles to feed into container or garbage can or a standard outdoor trash can) - No need for baggingAutomatic low oil level engine shutdownOnly minimal assembly requiredHome Depot Protection Plan:",
  "attributes": [
    {
      "key": "Bag/maximum load capacity (bushels)",
      "value": "0"
    },
    {
      "key": "- Environmentally responsible",
      "value": "transforms 12 bags of yard waste into 1 bag of chips"
    },
    {
      "key": "CA (CARB) Compliant",
      "value": "Not CARB Compliant"
    },
    {
      "key": "Chipper blade material",
      "value": "Steel"
    },
    {
      "key": "Chipper capacity (in.)",
      "value": "3"
    },
    {
      "key": "Commercial",
      "value": "No"
    },
    {
      "key": "Engine Displacement (cc)",
      "value": "270"
    },
    {
      "key": "Engine torque (ft.-lb.)",
      "value": "11"
    },
    {
      "key": "Engine Type",
      "value": "OHV"
    },
    {
      "key": "Feed capacity (in.)",
      "value": "3"
    },
    {
      "key": "Fuel tank capacity (oz.)",
      "value": "54.4"
    },
    {
      "key": "Housing Material",
      "value": "Metal"
    },
    {
      "key": "MFG Brand Name",
      "value": "Brush Master"
    },
    {
      "key": "Power Type",
      "value": "Gas"
    },
    {
      "key": "Product Depth (in.)",
      "value": "23"
    },
    {
      "key": "Product Height (in.)",
      "value": "34"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "145"
    },
    {
      "key": "Product Width (in.)",
      "value": "24"
    },
    {
      "key": "Reconditioned",
      "value": "No"
    },
    {
      "key": "Self-Feeding",
      "value": "Yes"
    },
    {
      "key": "Start Type",
      "value": "Manual"
    },
    {
      "key": "Translucent fuel tank",
      "value": "No"
    },
    {
      "key": "Wheels",
      "value": "Yes"
    }
  ],
  "isDeleted": false
}