{
  "uid": 100880,
  "name": "Sportsman Propane Powermate 2000-Watt Portable Generator",
  "description": "The Sportsman Propane 1,350/2,000-Watt Portable Generator can power common household appliances and power tools. It is equipped with a single 120-Volt outlet and a 12-Volt DC outlet for battery charging. This recoil start generator can run for 12 hours with a 50% load on 20 lbs. of propane fuel. A generator of this size is ideal for small camping or tailgating parties or to have on hand in case you need some temporary power in an emergency situation. It has a 2.8 HP 4-Stroke OHV Recoil Start engine. Its affordable but well thought out with full featured options such as Automatic Low Oil Shutdown and Circuit Protection. It boasts an Engine Run Time of 12 Hours at 50% on a common 20 lb. (gas grill type) cylinder (LPG cylinder not included). A 5 foot propane fuel hose with a regulator is included for your added convenience. The engine is surprisingly quiet; it runs at less than 65 dB. This is a great generator for anyone who needs affordable power. Propane has several distinct advantages over gasoline generators. Propane burns cleaner than gas engines. Carbon monoxide emissions run up to 40% lower. Propane will not degrade, so you can keep several propane tanks on hand for emergencies and store them for an unlimited amount of time. Since this generator runs on propane you never have to worry about the fuel going bad or having the carburetor getting fouled due to degenerated gasoline a common problem with gasoline powered small engines.Uses a standard gas grill style LPG tank like the ones sold and refilled at the Home Depot2.8 HP, 4 stroke OHV, recoil start engine, delivers maximum performanceGenerator runs on clean, quiet and efficient liquid propane gas (LPG), so you never have to worry about bad gasoline fouling the engineWeighs only 55 lbs. very portable and easy to store1,350 running Watts/2,000 surge Watts5 ft. regulator hose is included in boxLPG propane tank is not includedAir cooled, spark arrestor, UL listed electrical components, engine shut off switch1-12-Volt DC outlet and 1-120-Volt outletRun time equal to 12 hours at 50% load per 20 lbs. of LPG fuelDecibel rating: less than 65 dBEPA approvedPropane GeneratorHome Depot Protection Plan:",
  "attributes": [
    {
      "key": "Built-in inverter",
      "value": "No"
    },
    {
      "key": "- Decibel rating",
      "value": "less than 65 dB"
    },
    {
      "key": "CA (CARB) Compliant",
      "value": "Not CARB Compliant"
    },
    {
      "key": "Certifications and Listings",
      "value": "1-UL Listed"
    },
    {
      "key": "Continuous Wattage",
      "value": "1350"
    },
    {
      "key": "Engine Displacement (cc)",
      "value": "87"
    },
    {
      "key": "Engine Make",
      "value": "OEM Branded"
    },
    {
      "key": "Engine manufacturer",
      "value": "Sportsman"
    },
    {
      "key": "Fuel tank capacity (gallons)",
      "value": "100"
    },
    {
      "key": "Fuel type",
      "value": "Propane Gas"
    },
    {
      "key": "Full load fuel consumption (gallons/hour)",
      "value": "1"
    },
    {
      "key": "Generator Features",
      "value": "Automatic Voltage Regulation,Fuel Gauge,GFCI Outlet(s),Low Oil Shutdown"
    },
    {
      "key": "Horsepower (hp)",
      "value": "2.8"
    },
    {
      "key": "MFG Brand Name",
      "value": "Sportsman"
    },
    {
      "key": "Muffler",
      "value": "Yes"
    },
    {
      "key": "Number of circuits/outlets",
      "value": "2"
    },
    {
      "key": "Operational volume (dB)",
      "value": "79.5"
    },
    {
      "key": "Osha Required GFCI Outlets",
      "value": "Yes"
    },
    {
      "key": "Peak Wattage",
      "value": "2000"
    },
    {
      "key": "Product Depth (in.)",
      "value": "18"
    },
    {
      "key": "Product Height (in.)",
      "value": "15.5"
    },
    {
      "key": "Product Length (in.)",
      "value": "18.5"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "55"
    },
    {
      "key": "Product Width (in.)",
      "value": "14.5"
    },
    {
      "key": "Run time at 50% load (hours/tank)",
      "value": "12"
    },
    {
      "key": "Voltage (volts)",
      "value": "120"
    },
    {
      "key": "Wheel Kit Included",
      "value": "No"
    }
  ],
  "isDeleted": false
}