{
  "uid": 100876,
  "name": "Handy Home Products Berkley 10 ft. x 18 ft. Wood Storage Building Kit",
  "description": "The Handy Home Products Berkley 10 ft. x 18 ft. Wood Storage Building Kit is made with factory-primed SmartSide siding to resist fungal decay and wood-destroying insects. The storage building provides 1,597 cu. ft. of storage capacity, so you have plenty of space for lawn tools, riding mowers, building materials and more. The 5 ft. 4 in. wide by 6 ft. high extra-wide double doors can be installed on the eave or gable side for ideal ventilation. The windows, shutters, flower boxes, and dormers are sold separately.All wood is pre-cut and ready to assembleMade with factory-primed smartside siding to resist fungal decay and wood-destroying insects1,597 cu. ft. storage capacity provides space to stow your gardening tools and yard equipment when not in useSide walls are 6 ft. high with a 10 ft. peak to provide plenty of room to store lawnmowers and other large itemsPre-cut panels and pre-hung doors come with nails, screws, continuous hinges, hardware and simple, illustrated instructions for easy assembly5 ft. 4 in. wide by 6 ft. high extra-wide double doors can be installed on the eave or gable side for ideal ventilationDoors feature cross bucks for additional rigidity that can be removed based on aesthetic preferencesResistant to rusting, denting or sagging as well as damage from demanding wind and snow loadsShed siding is primed and ready for paint paint and shingles sold separatelyPremium locking lever provides additional securityCan be installed with a cement foundationFloor not included. For kit with floor see model# 18424-6 internet 100350372Only available for curbside deliveryFactory-primed SmartSide(TM) Siding an engineered wood product that is treated to resist fungal decay and wood-destroying insects15 Year Limited Warranty",
  "attributes": [
    {
      "key": "Approximate Depth (ft.)",
      "value": "18"
    },
    {
      "key": "Approximate Width (ft.)",
      "value": "11"
    },
    {
      "key": "Assembled Depth (in.)",
      "value": "220.00 in"
    },
    {
      "key": "Assembled Height (in.)",
      "value": "121 in"
    },
    {
      "key": "Assembled Width (in.)",
      "value": "130 in"
    },
    {
      "key": "Assembly Required",
      "value": "Yes"
    },
    {
      "key": "Door Opening Height (In.)",
      "value": "72"
    },
    {
      "key": "Door Opening Width (ft.)",
      "value": "5"
    },
    {
      "key": "Door Opening Width (In.)",
      "value": "64"
    },
    {
      "key": "Exact Width x Depth",
      "value": "10 ft 10 in x 18 ft 4 in"
    },
    {
      "key": "Floor Options",
      "value": "Without Floor"
    },
    {
      "key": "MFG Brand Name",
      "value": "Handy Home Products"
    },
    {
      "key": "Number of Doors",
      "value": "1"
    },
    {
      "key": "Number of Windows",
      "value": "0"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "1805"
    },
    {
      "key": "Roof Color Family",
      "value": "Light Brown Wood"
    },
    {
      "key": "Roof Pitch",
      "value": "4/12 \u0026 26/12"
    },
    {
      "key": "Roof Shape",
      "value": "Gambrel"
    },
    {
      "key": "Shed Door Type",
      "value": "Double"
    },
    {
      "key": "Shed Features",
      "value": "Door Latch,Double Door,Lockable Door"
    },
    {
      "key": "Shed Style",
      "value": "Barn"
    },
    {
      "key": "Sidewall Height (in.)",
      "value": "72"
    },
    {
      "key": "Siding Color Family",
      "value": "Beige/bisque"
    },
    {
      "key": "Storage Capacity (cu. ft.)",
      "value": "1597"
    }
  ],
  "isDeleted": false
}