{
  "uid": 100846,
  "name": "Kelvinator 108,000 BTU Gas Furnace with 92.1% Efficiency",
  "description": "Ideal for new or replacement residential or commercial installations. The 108,000 BTU Input KG7SC Series 92.1 percent efficiency residential gas furnace has a 34 1/2 in. tall cabinet and is designed for installation in up-flow and horizontal applications. This single stage, high efficiency furnace is natural gas ready and convertible to propane (LP Gas) with the optional GLP 028 conversion kit. All KG7SC furnaces are certified for Category IV venting and may be vented either through a side wall or roof applications using approved plastic as allowed by the National Fuel Gas Code. Features an electronic hot surface igniter for increased safety and efficiency, and adjustable 4 speed maintenance free direct drive blower that never needs lubrication, and self diagnostic control module to monitor operation. The primary heat exchanger is constructed of tubular aluminized steel and has a stainless steel secondary heat exchanger. Units are factory assembled, wired and tested to assure safe dependable and economic installation and operation. NOTE: Requires 1/2 in. input to gas valve, dedicated circuit breaker, and 120-Volt wiring with proper polarity and ground. Consumer in required to register the product within 60 days of installation to qualify for the extended 10 years parts warranty and limited lifetime heat exchanger warranty. Dimensions: 34.5 in. H x 24.5in. W x 28 in. D. Not certified for mobile home use.100 Percent fired and tested on the manufacturing line to assure proper and efficient operation upon installation30 second blower delay at start-up assures warm duct temperature at call for heat; adjustable blower off settings of 60, 90, 120, and 180 secondsColor coded wire harness designed to fit the components, all with quick-connect fitting for ease of service and replacementFlexible category IV venting system may be vertically or horizontally vented using either a one-pipe or two-pipe system for maximum flexibility in installationTubular aluminized steel primary heat exchanger and stainless steel secondary heat exchanger assures a long lifeMulti-speed direct drive blower motor is designed to a wide range of cooling capacities; switches on control board provide easy blower speed selectionSelf-diagnostic control board assures proper and safe operation and simplifies troubleshootingTwo piece door design with captured screws hold door secure and prevents losing door screwsNatural gas ready and may be converted in the field to LP using the optional GLP 028 conversion kitBTU input of 108,000 and 99,000 BTU outputHot surface igniter for safe and efficient operationTo qualify for the extended 10 years parts warranty, the equipment must be registered  online at www.nordynewarranty.com within 60 days of installation for replacement or 60 days after closing on a new home construction.  Some states do not require registration, but proof of installation is required to qualify for the 10 years parts warrantyEquipment should be sized, selected and installed by a qualified professional to ensure proper installation, safe operation, adherence to federal, state and local codes and for valid warranty. See installation guide for more details.Professional Installation recommendedClick here for more information",
  "attributes": [
    {
      "key": "Annual Fuel Utilization Efficiency (AFUE) (%)",
      "value": "92.1"
    },
    {
      "key": "Certifications and Listings",
      "value": "CSA Listed"
    },
    {
      "key": "Energy Consumption (kWh/year)",
      "value": "108000"
    },
    {
      "key": "ENERGY STAR Certified",
      "value": "No"
    },
    {
      "key": "Fuel Gauge",
      "value": "No"
    },
    {
      "key": "Gas or Electric",
      "value": "Gas"
    },
    {
      "key": "Heat rating (BTU/hour)",
      "value": "108000"
    },
    {
      "key": "Heating Product Type",
      "value": "Forced Air Furnace"
    },
    {
      "key": "Heating Technology Type",
      "value": "Convection"
    },
    {
      "key": "MFG Brand Name",
      "value": "Kelvinator"
    },
    {
      "key": "Number of Blower Speeds",
      "value": "4 or More"
    },
    {
      "key": "Power/Fuel Type",
      "value": "Natural Gas"
    },
    {
      "key": "Product Depth (in.)",
      "value": "28"
    },
    {
      "key": "Product Height (in.)",
      "value": "34.5"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "150"
    },
    {
      "key": "Product Width (in.)",
      "value": "24.5"
    }
  ],
  "isDeleted": false
}