{
  "uid": 100842,
  "name": "Iron Harmony Straight Top Exterior Prehung Door - Heavy Bronze",
  "description": "Iron Doors Unlimited, the leader in residential wrought iron doors, artisan-crafted designs for every architectural style - hand forged and hand finished from the highest quality 12-Gauge steel. Armonia (Harmony) Straight Top. Full Lite. Timeless, serene and simple hand-hammered scrollwork design. Beauty. Durability, Security, Affordability, Elegance and quality do not have to be expensive. Note: Some Armonia styles feature tinted clear Tea Glass - not opaque. Offers no privacy.Hand forged and hand finished from the highest quality 12-Gauge steel5/8 in. Hand forged scrollwork2 in. Thick door panel; integral threshold; heavy duty hingesWeatherstripping around each door and glass panelInjected foam insulation in jambs and slabsPre-drilled holes for handles and locksTempered double pane glass opens independently of door for cleaning and ventilationFlush bolt system on top and bottom of double doors locks in dormant door7 Step finishing process with zinc coating for galvanizing, primers, hand applied finishes, protected with oil based clear coat sealerPrice includes threshold, sweeps, glass, weather stripping and door jamb, does not include handlesListed door size is actual size of complete door unit, including jambRecommended RO (rough opening) atleast 1 in. wider and 1/2 in. taller than height and width of unit sizeIndustry-leading warranty protecting parts, finish and glassMost doors can be installed in a day for a lifetime of enjoyment",
  "attributes": [
    {
      "key": "Color Family",
      "value": "Bronze"
    },
    {
      "key": "Color/Finish",
      "value": "Heavy Bronze"
    },
    {
      "key": "Commercial",
      "value": "No"
    },
    {
      "key": "Door Configuration",
      "value": "Single Door"
    },
    {
      "key": "Door Handing",
      "value": "Right-Hand/Inswing"
    },
    {
      "key": "Door Size (WxH) in.",
      "value": "40 x 98"
    },
    {
      "key": "Door Style",
      "value": "Classic"
    },
    {
      "key": "Door Thickness (in.)",
      "value": "2 in"
    },
    {
      "key": "Door Type",
      "value": "Exterior Prehung"
    },
    {
      "key": "Energy Star Qualified",
      "value": "Not Qualified"
    },
    {
      "key": "Features",
      "value": "Weatherstripping"
    },
    {
      "key": "Finish Type",
      "value": "Painted"
    },
    {
      "key": "Fire rating",
      "value": "nan"
    },
    {
      "key": "Glass Caming Finish",
      "value": "No caming"
    },
    {
      "key": "Glass Style",
      "value": "Tinted"
    },
    {
      "key": "Glass Type",
      "value": "Full Lite"
    },
    {
      "key": "Hinge Finish",
      "value": "Bronze"
    },
    {
      "key": "Included",
      "value": "No additional items or accessories included"
    },
    {
      "key": "Jamb Size (in.)",
      "value": "6\u0022"
    },
    {
      "key": "Material",
      "value": "Iron"
    },
    {
      "key": "MFG Brand Name",
      "value": "Iron Doors Unlimited"
    },
    {
      "key": "Number of Hinges",
      "value": "2"
    },
    {
      "key": "Panel Type",
      "value": "No panel"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "375"
    },
    {
      "key": "Rough Opening Height",
      "value": "98.5"
    },
    {
      "key": "Rough Opening Width",
      "value": "41"
    }
  ],
  "isDeleted": false
}