{
  "uid": 100826,
  "name": "RIDGID X4 Compact Cordless Combo Kit with Hyper Lithium-Ion",
  "description": "RIDGID\u0027s X4 generation of cordless tools is designed to be compact and lightweight without losing any of the power. The X4 18-Volt Hyper Lithium-Ion Cordless Combo Kit includes best-in-class features on all the tools in the kit. The impact driver features 1750 in. lbs. of torque, a 1-handed bit holder for quick loading and a removable belt hook that can attach to either side. With free registration, this kit is covered for life, including free batteries, parts and service.California residents: see\u0026nbsp;Proposition 65 informationIncludes R8611501 hammer drill, R8641 reciprocating saw, R86034 impact driver, R8691 work light, R8651 circular saw, two R840083 18-Volt high-capacity hyper lithium battery packs, R840093 dual chemistry charger, contractor bag, wood cutting reciprocating saw blade, 6-1/2 in. circular saw blade, #2 Philips bit, blade wrench, belt hook, auxiliary handle assembly and operator\u0027s manualsImpact driver: high torque output delivers 1400 in. lbs. for tough applicationsCircular saw delivers 5000 RPM and features a sight line blower to direct debris away from the cut line for increased visibilityCordless reciprocating saw designed with on/off orbital action, pivoting shoe lockable in three positions and tool-free blade changeIncludes two AC840083 batteries and one AC840093 charger; drill is compatible with the following batteries and chargers, sold separately: AC840084, AC840085 and AC46182 batteries and AC470013 chargerCompact, lightweight hammer drill with 4-pole open frame motor for superior power can switch between driving, drilling and hammer modes without changing clutch settingImpact driver: 1-handed quick-load bit holder makes bit changes quicker and easier with a snap load collet and simple ejecting bit releaseImpact driver: removable belt hook attaches to either side of tool to keep impact driver in immediate reachLED work light: dual mode light easily changes from spotlight to area lightLED work light: retractable sky hook easily hangs on standard 2X workpiecesCLICK HERE TO REGISTER YOUR RIDGID PRODUCT.",
  "attributes": [
    {
      "key": "Batteries Included",
      "value": "Yes"
    },
    {
      "key": "Battery Amp Hours",
      "value": "3"
    },
    {
      "key": "Battery Power Type",
      "value": "Lithium Ion"
    },
    {
      "key": "Battery Size",
      "value": "Lithium Ion"
    },
    {
      "key": "- Impact driver",
      "value": "high torque output delivers 1400 in. lbs. for tough applications"
    },
    {
      "key": "- Includes two AC840083 batteries and one AC840093 charger; drill is compatible with the following batteries and chargers, sold separately",
      "value": "AC840084, AC840085 and AC46182 batteries and AC470013 charger"
    },
    {
      "key": "- Impact driver",
      "value": "1-handed quick-load bit holder makes bit changes quicker and easier with a snap load collet and simple ejecting bit release"
    },
    {
      "key": "- Impact driver",
      "value": "removable belt hook attaches to either side of tool to keep impact driver in immediate reach"
    },
    {
      "key": "- LED work light",
      "value": "dual mode light easily changes from spotlight to area light"
    },
    {
      "key": "- LED work light",
      "value": "retractable sky hook easily hangs on standard 2X workpieces"
    },
    {
      "key": "Certifications and Listings",
      "value": "1-UL Listed"
    },
    {
      "key": "Charger Included",
      "value": "Yes"
    },
    {
      "key": "Color Family",
      "value": "Gray"
    },
    {
      "key": "Cordless Tool Type",
      "value": "Combo Kit"
    },
    {
      "key": "Cordless/Corded",
      "value": "Cordless"
    },
    {
      "key": "MFG Brand Name",
      "value": "RIDGID"
    },
    {
      "key": "Number of Batteries Included",
      "value": "2"
    },
    {
      "key": "Number of Tools Included",
      "value": "5"
    },
    {
      "key": "Power Tool Features",
      "value": "Bag Included,Bits/Blades Included"
    },
    {
      "key": "Power Tool Product Type",
      "value": "Cordless"
    },
    {
      "key": "Product Depth (in.)",
      "value": "24.4 in"
    },
    {
      "key": "Product Height (in.)",
      "value": "9.8 in"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "26.3"
    },
    {
      "key": "Product Width (in.)",
      "value": "13.8 in"
    },
    {
      "key": "Reconditioned",
      "value": "No"
    },
    {
      "key": "Tools Included",
      "value": "Circular Saw,Drill,Impact Driver,Reciprocating Saw,Worklight"
    },
    {
      "key": "Tools Product Type",
      "value": "Power Tool"
    },
    {
      "key": "Voltage (volts)",
      "value": "18"
    }
  ],
  "isDeleted": false
}