{
  "uid": 100887,
  "name": "Safavieh Outdoor Oasis Gray Floral Area Rug",
  "description": "Safavieh\u0027s Courtyard collection was created for today\u0027s indoor/outdoor lifestyle.These beautiful but practical rugs take outdoor decorating to the next level with new designs in fashion-forward colors, and patterns from classic to contemporary. Made with enhanced material for extra durability, Courtyard rugs are pre-coordinated to work together in related spaces inside or outside the home. Safavieh developed a special sisal weave that achieves intricate designs that are so easy to maintain, you simply clean your rug with a garden hose.100% PolypropyleneNo backing, rug pad recommended to avoid shifting and slidingPower Loomed in TurkeyWater resistant making it perfect for outdoor useVacuum regularly and spot clean; for hard-to-remove stains, professional rug cleaning is recommendedFor an instant decorating makeover, this area rug is one of the easiest and most fashionable ways to refresh a room with character and stylePlease Note: The digital images and product dimensions on our website are as accurate as possible. Due to differences in computer monitors, some rug colors may vary slightly. Lengths and widths may vary from the published dimensions. We do our best to provide you with an exact measurement, but please be advised that some variation exists. Patterns may vary slightly according to shape and size selected.60 day manufacturer warranty, for warranty information on this product, please call our Internet Customer Service Center at 1-800-435-4654",
  "attributes": [
    {
      "key": "Approximate Rug Size",
      "value": "9 X 12"
    },
    {
      "key": "Area Rug Pattern",
      "value": "Border,Floral"
    },
    {
      "key": "Area Rug Style",
      "value": "Classic,Cottage"
    },
    {
      "key": "Backing material",
      "value": "Polyester, Latex, Other"
    },
    {
      "key": "- Please Note",
      "value": "The digital images and product dimensions on our website are as accurate as possible. Due to differences in computer monitors, some rug colors may vary slightly. Lengths and widths may vary from the published dimensions. We do our best to provide you with an exact measurement, but please be advised that some variation exists. Patterns may vary slightly according to shape and size selected."
    },
    {
      "key": "Cleaning instructions",
      "value": "Garden hose"
    },
    {
      "key": "Color Family",
      "value": "Gray"
    },
    {
      "key": "Color/Finish",
      "value": "Grey / Natural"
    },
    {
      "key": "Commercial / Residential",
      "value": "Residential"
    },
    {
      "key": "Construction",
      "value": "Machine-made"
    },
    {
      "key": "Features",
      "value": "Water Resistant"
    },
    {
      "key": "Flooring Product Type",
      "value": "Area Rug"
    },
    {
      "key": "Indoor/Outdoor",
      "value": "Indoor/Outdoor"
    },
    {
      "key": "MFG Brand Name",
      "value": "Safavieh"
    },
    {
      "key": "Pile height (in.)",
      "value": "0.25"
    },
    {
      "key": "Product Length (in.)",
      "value": "144"
    },
    {
      "key": "Product Thickness (in.)",
      "value": "0.25"
    },
    {
      "key": "Product Width (in.)",
      "value": "107"
    },
    {
      "key": "Rug Material",
      "value": "Synthetic"
    },
    {
      "key": "Rug Shape",
      "value": "Rectangle"
    },
    {
      "key": "Rug Weave",
      "value": "Loomed"
    }
  ],
  "isDeleted": false
}