{
  "uid": 100866,
  "name": "Johnson PocketPro 1500 Series Door Frame Kit",
  "description": "The Johnson Hardware 1500 Series Pocket Door Frame for Doors up to 30 in. x 80 in. is an easily assembled, premium quality commercial/residential kit for installing a pocket door into a wall. Pocket doors do not need \u0022swing\u0022 room, saving valuable floor space while still assuring the full privacy of a standard door. Manufactured and designed in the USA, the frame is structurally strong and perfect for the builder or do-it-yourselfer. The kit components are all of the highest quality and durability which is why we can offer a lifetime warranty.Smooth rolling, balanced three wheel tricycle hangers ensure that all wheels carry weight evenly for the smoothest operationA flip of a clip separates hangers from doors for easy door installation and removalPrecision extruded box track is made of heavy-walled aluminum and guarantees that your door will not jump trackConvex rails on box track trap dirt for free rollingWood split jamb and wood stud uprights have full steel sides and backs to provide maximum rigidity for wall materials and restricts nails from penetration into pocketSelf-adjusting floor anchors allow for settling of floor without disturbing horizontal alignment of header and trackIn addition to the frame, track, and hangers, kit also includes door guide, adjustment wrench, and door bumperFor door thicknesses of 1 in. to 1-3/8 in. (1-3/4 in. door adaptor kit available)For door widths up to 30 in.For door heights up to 80 in.For door weights of up to 200 lbs.Johnson Hardware offers a true lifetime warranty and will replace any item found defective in material or workmanship regardless of its date of purchase",
  "attributes": [
    {
      "key": "Assembled Depth (in.)",
      "value": "3.5 in"
    },
    {
      "key": "Assembled Height (in.)",
      "value": "85 in"
    },
    {
      "key": "Assembled Width (in.)",
      "value": "60 in"
    },
    {
      "key": "Builders Hardware Product Type",
      "value": "Pocket Door Hardware"
    },
    {
      "key": "Door Type",
      "value": "Pocket"
    },
    {
      "key": "Finish",
      "value": "Aluminum Track/Plated Steel Parts"
    },
    {
      "key": "Finish Family",
      "value": "Unfinished"
    },
    {
      "key": "Material",
      "value": "Other"
    },
    {
      "key": "Maximum door height (in.)",
      "value": "80"
    },
    {
      "key": "Maximum door thickness (in.)",
      "value": "1.375"
    },
    {
      "key": "Maximum door width (in.)",
      "value": "30"
    },
    {
      "key": "MFG Brand Name",
      "value": "Johnson Hardware"
    },
    {
      "key": "Minimum door thickness (in.)",
      "value": "1"
    },
    {
      "key": "Number of doors accommodated",
      "value": "1"
    },
    {
      "key": "Track included",
      "value": "Yes"
    },
    {
      "key": "Weight load per door/panel (lb.)",
      "value": "200"
    }
  ],
  "isDeleted": false
}