{
  "uid": 100839,
  "name": "Ariens Subaru 22-Ton Gas Log Splitter with Towable Capability",
  "description": "This Ariens gas log splitter offers mobility and power. Its Subaru EA-175V engine produces 8.26 ft.-lb. of torque and there is vertical and horizontal splitting capacity. The controls are located in the center so it can be operated from either side. It is towable, so you can take it where you need to handle tough jobs.Subaru EA-175V engine produces 8.26 ft.-lb. of torque for powerful splitting22-Ton splitting force effectively splits larger logs12-second cycle time quickly resets the splitter to split another logCentrally located controls allows you to operate from either sideOpen operating zone reduces operator fatigueVertical and horizontal splitting capacity for versatilityLog cradle and draw bar handle are standard featuresTowable at speeds up to 45 mph for convenienceIncludes 3 year limited consumer warrantyItem usually ships in 7-10 business daysIn most shipping areas, Ariens offers white glove delivery service, Log Splitter will be shipped to your local Ariens authorized servicing dealer for set-up and inspection prior to home delivery, inspection includes operator\u0027s manual confirmation, set tire pressure, check fluid levels, test start unit and file warranty registration informationDisclaimer in qualifying area only - If an Ariens authorized dealer is not in your shipping area, Log Splitter will ship unassembled, directly to you via regular truck delivery, To confirm White Glove Delivery availability prior to purchasing, call 888-927-4367 option #2Home Depot Protection Plan:",
  "attributes": [
    {
      "key": "CA (CARB) Compliant",
      "value": "CARB Compliant"
    },
    {
      "key": "Cycle time (sec.)",
      "value": "12"
    },
    {
      "key": "Engine Displacement (cc)",
      "value": "174"
    },
    {
      "key": "Engine Make",
      "value": "Subaru"
    },
    {
      "key": "Engine torque (ft.-lb.)",
      "value": "8.26"
    },
    {
      "key": "Engine Type",
      "value": "OHC"
    },
    {
      "key": "Fuel Tank Capacity",
      "value": ".32 gal (US)"
    },
    {
      "key": "Log Splitter Power Type",
      "value": "Gas"
    },
    {
      "key": "Maximum log diameter (in.)",
      "value": "25"
    },
    {
      "key": "Maximum log length (in.)",
      "value": "25"
    },
    {
      "key": "MFG Brand Name",
      "value": "Ariens"
    },
    {
      "key": "Product Depth (in.)",
      "value": "86.25"
    },
    {
      "key": "Product Height (in.)",
      "value": "46.5"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "367"
    },
    {
      "key": "Product Width (in.)",
      "value": "38.25"
    },
    {
      "key": "Reconditioned",
      "value": "No"
    },
    {
      "key": "Splitting force (tons)",
      "value": "22"
    },
    {
      "key": "Start Type",
      "value": "Manual"
    },
    {
      "key": "Towable",
      "value": "Yes"
    },
    {
      "key": "Vertical or Horizontal",
      "value": "Vertical / Horizontal"
    },
    {
      "key": "Wheels",
      "value": "Yes"
    }
  ],
  "isDeleted": false
}