{
  "uid": 100857,
  "name": "PRO-SERIES Rolling Scaffold Tower with Guard Rail Set",
  "description": "With the Pro-Series Two Story Rolling Scaffold Tower you can access light fixtures to change light bulbs or clean tall windows in the great room. This Scaffold Tower allows you to easily access hard to reach places to install acoustical or ceiling tiles, perform electrical work or complete HVAC installation. Roll from one end of the room to the other, for painting, patching, wallpapering and hanging drywall with eight 5 in. swivel locking casters. That\u0027s a big help when you don\u0027t have time to tear down and rebuild the scaffold. Homeowners and contractors alike will appreciate the 1,000 lbs. load capacity. That means you can easily get 2 or more big guys up there to help with drywall installation or painting. A large, 66.5 in. L x 16.25 in. W, wood and steel deck provides a sturdy work surface. The Pro-Series Two Story Rolling Scaffold Tower unit includes everything you need to build a safe and secure interior scaffold system, from the casters to the guard rail. Use a single or double stack, based on the needs of the job. When used as a single story system, the scaffold measures only 29 in. W, so it can fit through standard doorways.Designed for interior useDurable powder coat paint finish66.5 in. L x 16.25 in. W work surfaceOverall size: 6 ft. L x 4 ft., 5.25 in. W x 14 ft., 10 in. H1/2 in. Thick wood deck with steel frame66.5 in. L x 16.25 in. W work surfaceWooded platform with steel frame sits up to 11 ft. off the groundScaffold tower set includes: two 6 ft. multi-purpose scaffold, 1 guard rail set, one 18 in. 4-piece outrigger set",
  "attributes": [
    {
      "key": "Assembled depth (ft.)",
      "value": "28.7"
    },
    {
      "key": "Assembled height (ft.)",
      "value": "142"
    },
    {
      "key": "Base Width (in.)",
      "value": "29"
    },
    {
      "key": "- Overall size",
      "value": "6 ft. L x 4 ft., 5.25 in. W x 14 ft., 10 in. H"
    },
    {
      "key": "- Overall size",
      "value": "6 ft. L x 4 ft., 5.25 in. W x 14 ft., 10 in. H"
    },
    {
      "key": "- Scaffold tower set includes",
      "value": "two 6 ft. multi-purpose scaffold, 1 guard rail set, one 18 in. 4-piece outrigger set"
    },
    {
      "key": "Certifications and Listings",
      "value": "ANSI Certified,OSHA Compliant"
    },
    {
      "key": "Duty Rating",
      "value": "Standard"
    },
    {
      "key": "Guard rails",
      "value": "Included"
    },
    {
      "key": "Ladders/Scaffolding Features",
      "value": "Adjustable,Casters,Hardware Included,Ladder Included,Weather Resistant"
    },
    {
      "key": "Material",
      "value": "Steel"
    },
    {
      "key": "Maximum Load (lb.)",
      "value": "1000.000 lb"
    },
    {
      "key": "MFG Brand Name",
      "value": "PRO-SERIES"
    },
    {
      "key": "Number of levels/stories",
      "value": "2"
    },
    {
      "key": "Number of platforms included",
      "value": "2"
    },
    {
      "key": "Platform length (ft.)",
      "value": "6"
    },
    {
      "key": "Product Depth (in.)",
      "value": "28.7"
    },
    {
      "key": "Product Height (in.)",
      "value": "142"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "404"
    },
    {
      "key": "Product Width (in.)",
      "value": "73.6"
    },
    {
      "key": "Residential/Commercial/industrial Use",
      "value": "Residential or commercial"
    }
  ],
  "isDeleted": false
}