{
  "uid": 100897,
  "name": "Clopay Intellicore Classic Garage Door with Ultra-Grain Surface",
  "description": "Clopay Garage Doors featuring Intellicore insulation technology represent the ultimate smart choice for homeowners. Clopay Intellicore is proprietary polyurethane foam that is injected into a garage door, expanding to fill the entire structure. The result is a door with incredible strength and durability. Its dense insulation also produces a quieter door, while its industry leading R-values provide year-round comfort and improved energy efficiency. This door also features Clopay ultra-grain, a painted steel surface simulating a real stained door without the hassles of staining and the ongoing maintenance of wood. The price includes the door and components only. Installation is NOT included.Click here to design your Custom Clopay Garage Door and schedule an installOffers a 3-layer construction (steel-insulation-steel)Garage door comes with plain windows for added curb appeal and allowing natural light shine through your garageMaximum energy efficiency with 1-3/8 in. thick, high R-value polyurethane insulation - R-value 12.9Heavy-duty exterior steel ensures durability and securityEZ-Set torsion springs are includedRust-proof and durable tog-l-loc fastening system secures steel skin to sturdy steel frameBottom weather seal in rust-proof aluminum retainer helps seal floors and is easily replaced",
  "attributes": [
    {
      "key": "Color Family",
      "value": "White"
    },
    {
      "key": "Door Configuration",
      "value": "Double Door"
    },
    {
      "key": "Garage Door Collection",
      "value": "Classic"
    },
    {
      "key": "Garage Door Color",
      "value": "White"
    },
    {
      "key": "Garage Door Size",
      "value": "16\u0027x7\u0027"
    },
    {
      "key": "Garage Door Style",
      "value": "Classic"
    },
    {
      "key": "Garage Features",
      "value": "Insulated,Paintable,Windows"
    },
    {
      "key": "Insulated",
      "value": "Yes"
    },
    {
      "key": "Insulation R-Value",
      "value": "12.9"
    },
    {
      "key": "Material",
      "value": "Steel"
    },
    {
      "key": "MFG Brand Name",
      "value": "Clopay"
    },
    {
      "key": "Product Depth (in.)",
      "value": "192"
    },
    {
      "key": "Product Height (in.)",
      "value": "84"
    },
    {
      "key": "Product Width (in.)",
      "value": "1.38"
    }
  ],
  "isDeleted": false
}