{
  "uid": 100829,
  "name": null,
  "description": "Swing-N-Slide Playsets presents the Playful Palace, an action-packed wood clubhouse with double decks at 4 ft. and 5 ft. high. Featuring an enclosed clubhouse, flags, a steering wheel and a telescope, this playset will keep the kids busy all summer long. Its unique design is loaded with activities including a picnic table with canopy, a rock wall on the back and a separate lemonade stand. This is a Wood Complete Playset, so everything comes in the box, including all lumber, accessories, hardware, fasteners and fully illustrated instructions. The Playful Palace comes with a 5-year warranty and is fully compliant with ASTM safety standards.5 ft. high deck with enclosed clubhouse, window and steering wheel is covered by a wood roof with architectural details4 ft. high deck terrace, with a rock wall entry and access to the included cool wave slide, features a telescope with compass and decorative flagsIncludes the popular cool wave slide that carries a lifetime warrantyIncludes two swing seats, a ring/trapeze combo, climbing rock wall with rocks, two flags and picnic table with canopy, separate lemonade stand, telescope, steering wheel and cool wave slideWeight capacity of 945 lbs. based on a maximum occupancy of 11 children under the age of 10For private backyard use only; do not use in public settingsMeets and/or exceeds American Society of Testing Materials (ASTM) safety standardsAll Swing-N-Slide products are designed for single family residential use only, the item cannot be shipped to a commercial ship to address or used in a commercial setting.",
  "attributes": [
    {
      "key": "Assembled Depth (in.)",
      "value": "132 in"
    },
    {
      "key": "Assembled Height (in.)",
      "value": "114 in"
    },
    {
      "key": "Assembled Width (in.)",
      "value": "172 in"
    },
    {
      "key": "Assembly Required",
      "value": "Yes"
    },
    {
      "key": "Certifications and Listings",
      "value": "ASTM Compliant"
    },
    {
      "key": "Color Family",
      "value": "Multi"
    },
    {
      "key": "Material",
      "value": "Cedar"
    },
    {
      "key": "Materials",
      "value": "Plastic/Metal/Wood"
    },
    {
      "key": "MFG Brand Name",
      "value": "Swing-N-Slide Playsets"
    },
    {
      "key": "Mounting",
      "value": "Surface Mounted"
    },
    {
      "key": "Number of Activities",
      "value": "11"
    },
    {
      "key": "Number of Swings Included",
      "value": "3"
    },
    {
      "key": "Play Set Includes",
      "value": "All lumber,Hardware"
    },
    {
      "key": "Product Depth (in.)",
      "value": "132"
    },
    {
      "key": "Product Height (in.)",
      "value": "114"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "369"
    },
    {
      "key": "Product Width (in.)",
      "value": "172"
    },
    {
      "key": "Recommended Age Range",
      "value": "3-10"
    },
    {
      "key": "Roof Style",
      "value": "Wood shingle roof with architectural features"
    },
    {
      "key": "Space Required, Height (ft.)",
      "value": "11"
    },
    {
      "key": "Space Required, Length (ft.)",
      "value": "28"
    },
    {
      "key": "Space Required, Width (ft.)",
      "value": "27"
    },
    {
      "key": "Weight Capacity (lb.)",
      "value": "945"
    }
  ],
  "isDeleted": false
}