{
  "uid": 100828,
  "name": "Owens Corning EcoTouch Fiberglass Insulation - Sound Control, R-19",
  "description": "EcoTouch insulation is the reinvention of fiberglass insulation from Owens Corning, the industry leader that invented fiberglass insulation. Install our insulation with confidence knowing that over 70 years of innovation and experience has gone in the making of EcoTouch insulation. Unlike traditional fiberglass insulation, Owens Corning EcoTouch insulation contains more than 99% natural ingredients consisting of minerals and plant-based compounds and is verified to be formaldehyde free. Owens Corning EcoTouch insulation is third-party certified to include a minimum of 65% total recycled content for unfaced insulation and 58% for kraft faced insulation. Owens Corning EcoTouch insulation helps to control sound and temperature - keeps your home warm in the winter and cool in the summer.Dimensions: 6-1/4 in. x 15 in. x 39.2 ft., 1 piece (48.96 sq. ft. / roll )Application: 2 in. x 6 in. walls (Interior / exterior), floors, crawlspaceProvides thermal performance and helps lower monthly heating/cooling costsEcoTouch insulation helps control sound; add to bedrooms, home office, family room, utility room, kitchen and bathroomCan be combined with FOAMULAR insulating sheathing to achieve greater thermal performance in an exterior wall assemblyBuying guide and insulation calculator:",
  "attributes": [
    {
      "key": "- Dimensions",
      "value": "6-1/4 in. x 15 in. x 39.2 ft., 1 piece (48.96 sq. ft. / roll )"
    },
    {
      "key": "- Application",
      "value": "2 in. x 6 in. walls (Interior / exterior), floors, crawlspace"
    },
    {
      "key": "Coverage Area (sq. ft.)",
      "value": "48.96"
    },
    {
      "key": "ENERGY STAR Certified",
      "value": "Yes"
    },
    {
      "key": "Faced or Unfaced",
      "value": "Unfaced"
    },
    {
      "key": "Formaldehyde Free",
      "value": "Yes"
    },
    {
      "key": "Insulation Application Type",
      "value": "2x6 Walls,Crawlspaces,Floors"
    },
    {
      "key": "Insulation R-Value",
      "value": "19"
    },
    {
      "key": "Insulation Type",
      "value": "Fiberglass"
    },
    {
      "key": "MFG Brand Name",
      "value": "Owens Corning"
    },
    {
      "key": "Product Depth (in.)",
      "value": "470.4"
    },
    {
      "key": "Product Height (in.)",
      "value": "6.25"
    },
    {
      "key": "Product Length (ft.)",
      "value": "39.2 ft"
    },
    {
      "key": "Product Thickness (in.)",
      "value": "6.25 in"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "13"
    },
    {
      "key": "Product Width (in.)",
      "value": "15"
    },
    {
      "key": "Roll or Batt",
      "value": "Roll"
    },
    {
      "key": "Vapor Retardent",
      "value": "No"
    }
  ],
  "isDeleted": false
}