{
  "uid": 100837,
  "name": "1. Makita LXT Lithium-Ion Cordless Blower",
  "description": "The Makita 18-Volt LXT Lithium-Ion Cordless Blower (model DUB182Z, tool only) is a go-to clean-up tool and a favorite on job sites and in workshops. It seamlessly combines the convenience of cordless with the superior power-to-weight ratio of Makita\u0027s 18-Volt LXT Lithium-Ion battery technology. The DUB182Z is the perfect addition to any kit, tool bag or work shop. Its part of Makita\u0027s expanding 18-Volt Lithium-Ion series, the world\u0027s largest cordless tool line-up powered by 18-Volt Lithium-Ion slide-style battery. Makita 18-Volt Lithium-Ion batteries have the fastest charge times in their categories, so they spend more time working and less time sitting on the charger.California residents: see\u0026nbsp;Proposition 65 informationVariable speed (0 - 18,000 RPM) for optimum speed controlUp to 12 minutes of continuous operation from a single charge at high speedCompact and ergonomic design at only 20-3/4 in. longWeighs only 3.9 lbs. with battery (battery not included) for reduced operator fatigueRubberized soft grip handle for increased operator comfortMakita built variable 3-speed motor produces a maximum air velocity of 179-MPHA perfect addition to any gang box or tool boxEquipped with star protection computer controls to protect against overloading, over-discharging and over-heatingRapid optimum charger communicates with the battery\u0027s built-in chip throughout the charging process to optimize battery life by actively controlling current, voltage and temperature (battery and charger sold separately)Rapid optimum charger has a built-in fan to cool the battery for faster, more efficient charging (battery and charger sold separately)Makita technology delivers category-leading charge time, so the battery spends more time working and less time sitting on the charger (battery and charger sold separately)Compatible with Makita 18-Volt lithium-ion batteries with a star symbol (battery sold separately)Home Depot Protection Plan:",
  "attributes": [
    {
      "key": "Antivibration",
      "value": "No"
    },
    {
      "key": "Assembled Depth (in.)",
      "value": "6.4 in"
    },
    {
      "key": "Assembled Height (in.)",
      "value": "7.2 in"
    },
    {
      "key": "Assembled Width (in.)",
      "value": "12.7 in"
    },
    {
      "key": "Assembly Required",
      "value": "Yes"
    },
    {
      "key": "Batteries Included",
      "value": "No"
    },
    {
      "key": "Battery Type Required",
      "value": "BL1830, Bl1830-2"
    },
    {
      "key": "Blower Type",
      "value": "Handheld Blower"
    },
    {
      "key": "Certifications and Listings",
      "value": "1-UL Listed"
    },
    {
      "key": "Charger Included",
      "value": "No"
    },
    {
      "key": "Commercial",
      "value": "Yes"
    },
    {
      "key": "Engine Cycles",
      "value": "Electric Motor"
    },
    {
      "key": "Interchangeable nozzle connections",
      "value": "Yes"
    },
    {
      "key": "Maximum air speed (mph)",
      "value": "179"
    },
    {
      "key": "Maximum Air Volume (CFM)",
      "value": "91"
    },
    {
      "key": "MFG Brand Name",
      "value": "Makita"
    },
    {
      "key": "Noise rating (dB)",
      "value": "83"
    },
    {
      "key": "Number of Batteries Required",
      "value": "1"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "3.7"
    },
    {
      "key": "Reconditioned",
      "value": "No"
    },
    {
      "key": "Start Type",
      "value": "Electric"
    },
    {
      "key": "Variable speeds",
      "value": "Yes"
    },
    {
      "key": "Voltage (volts)",
      "value": "18"
    }
  ],
  "isDeleted": false
}