{
  "uid": 100874,
  "name": "Ryobi 1700-PSI Electric Pressure Washer with Turbo Nozzle",
  "description": "The Ryobi 1700-PSI Pressure Washer is engineered to handle even your toughest jobs. With a powerful 13-Amp Electric Motor, this Ryobi Pressure Washer delivers 1700-PSI of force for quick cleaning of driveways, decks, windows and other areas around the house. Featuring a durable and compact roll-cage frame design this pressure washer is designed for easy transport. The On-Board Detergent Tank offers hassle-free cleaning by eliminating the need to drag a bucket and hose behind you. For added convenience, the Ryobi 1700-PSI Pressure Washer is equipped with on-board accessory storage and a bonus Turbo Nozzle for up to 50% more cleaning power. The Ryobi 1700-PSI Electric Pressure Washer is backed with the Ryobi 3-year limited warranty and is guaranteed to deliver results for years to come.California residents: see\u0026nbsp;Proposition 65 information1700-PSI 1.2-GPM for efficient cleaning of residential areasOn-board detergent tank for easy soap applicationQuick connect capable for easy use of nozzles and additional attachmentsRugged roll-cage frame design protects the motor housing and stays upright; no tipping25 ft. non-marring high pressure hose will not leave scuffs on the job3 nozzles included (15 soap and turbo) for cleaning a variety of surfacesIncluded turbo nozzle provides up to 50% more cleaning power with a cone-shaped spray patternMaintenance free aluminum pump for easy pump upkeepOn-board accessory storage for quickly and conveniently stowing trigger handle, hose and nozzles3-year warranty for guaranteed performance30 day risk-free guarantee for worry-free purchaseHome Depot Protection Plan:",
  "attributes": [
    {
      "key": "Amperage (amps)",
      "value": "13"
    },
    {
      "key": "Assembled Depth (in.)",
      "value": "17.125 in"
    },
    {
      "key": "Assembled Height (in.)",
      "value": "18.500 in"
    },
    {
      "key": "Assembled Width (in.)",
      "value": "17.750 in"
    },
    {
      "key": "Commercial",
      "value": "No"
    },
    {
      "key": "Cord Length (ft.)",
      "value": "35"
    },
    {
      "key": "Cord lock",
      "value": "Yes"
    },
    {
      "key": "Detergent tank",
      "value": "Yes"
    },
    {
      "key": "Foldable handle",
      "value": "No"
    },
    {
      "key": "GFIC plug",
      "value": "Yes"
    },
    {
      "key": "GPM",
      "value": "1.2"
    },
    {
      "key": "Hose Diameter (In.)",
      "value": ".25 in"
    },
    {
      "key": "Hose length (in.)",
      "value": "300"
    },
    {
      "key": "Hose Material",
      "value": "Rubber"
    },
    {
      "key": "Maximum Pressure (PSI)",
      "value": "1700"
    },
    {
      "key": "MFG Brand Name",
      "value": "Ryobi"
    },
    {
      "key": "Number of tips included",
      "value": "3"
    },
    {
      "key": "Onboard cord storage",
      "value": "Yes"
    },
    {
      "key": "Onboard storage",
      "value": "Yes"
    },
    {
      "key": "Pressure Washer Power Type",
      "value": "Electric"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "32"
    },
    {
      "key": "Pump Brand",
      "value": "Other"
    },
    {
      "key": "Pump Type",
      "value": "Axial"
    },
    {
      "key": "Reconditioned",
      "value": "No"
    },
    {
      "key": "Start Type",
      "value": "Electric"
    },
    {
      "key": "Water capability",
      "value": "Cold"
    },
    {
      "key": "Wheels",
      "value": "Yes"
    }
  ],
  "isDeleted": false
}