{
  "uid": 100868,
  "name": "ScaleBlaster Water Health Plus Conditioner",
  "description": "The ScaleBlaster Deluxe Electronic Water Conditioner is an innovative, computerized water conditioning system that solves hard water problems without the need for chemicals or salt, making it a healthy option for those on salt-restricted diets. This water conditioner removes and prevents limescale deposits in household pipes, protecting and prolonging the life of water heaters, dishwashers and washing machines. Limescale deposits on showerheads, sinks and faucets will easily wipe off or disappear, and soap lathers up more, leaving your skin feeling smoother and your hair more manageable. Enjoy healthier and better tasting water, as well as brighter, whiter and longer lasting clothes, towels and sheets. This water conditioner requires no maintenance and is simple to install with no plumbing required.Solves hard water problems without the need for chemicals, salt or maintenanceBetter for the home, your body and the environmentDesigned for very hard water areas (10-19 grains)Small enclosure requires minimal space for installationGreat for individuals on salt-restricted dietsEasily eliminates limescale deposits in pipes and on sinks, showerheads and faucetsAlso ideal for tankless water heatersHome Depot Protection Plan:See how the ScaleBlaster Deluxe Electronic Water Conditioner stacks up next to a water softener:",
  "attributes": [
    {
      "key": "Amperage (amps)",
      "value": "0.5"
    },
    {
      "key": "Cord Length (ft.)",
      "value": "5"
    },
    {
      "key": "Indicator light(s)",
      "value": "Yes"
    },
    {
      "key": "Maximum filtered water flow (gallons per min.)",
      "value": "25"
    },
    {
      "key": "Maximum Pipe Diameter",
      "value": "1.5 in"
    },
    {
      "key": "MFG Brand Name",
      "value": "ScaleBlaster"
    },
    {
      "key": "Minimum number of cable/coil wrappings",
      "value": "30"
    },
    {
      "key": "Product Depth (in.)",
      "value": "3.75"
    },
    {
      "key": "Product Height (in.)",
      "value": "10.5"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "4.5"
    },
    {
      "key": "Product Width (in.)",
      "value": "7.3"
    },
    {
      "key": "Voltage (volts)",
      "value": "120"
    },
    {
      "key": "Wattage (watts)",
      "value": "60"
    }
  ],
  "isDeleted": false
}