{
  "uid": 100969,
  "name": "Patio Armor Weather-Resistant Furniture Cover - Taupe/Olive Green",
  "description": "Our classic Patio Armor furniture covers are designed to keep your outdoor patio furniture looking great. Made from high grade polyester, our patio furniture covers resist cracking, fading, tearing, and mold build up. The underside is coated with PVC for increased water resistance and further protection from the elements. Designed for style, the cover is a traditional taupe color with an elegant olive trim. You can be confident that your patio furniture is secure through the seasons. We have covers available to fit all of your needs, chairs, chaise lounges, love seat / bench, and tables. You\u0027ve invested a lot in your patio furniture and you should protect it with the best.Made from 380 g polyester for a canvas like feelHeavyweight fabric resists ripping and tearingCoated underside provides added water protectionNeutral but fashionable taupe color matches your outdoor furniture and environmentSynthetic material resists mold and mildew buildupMaterial breathes with side vents allowing heat and moisture to escapeHighly weather resistant limiting potential for cracking in cold weather",
  "attributes": [
    {
      "key": "Assembled Depth (in.)",
      "value": "30 in"
    },
    {
      "key": "Assembled Height (in.)",
      "value": "48 in"
    },
    {
      "key": "Assembled Width (in.)",
      "value": "27 in"
    },
    {
      "key": "Color Family",
      "value": "Multi-Colored"
    },
    {
      "key": "Color/Pattern",
      "value": "Dark Taupe/Olive Green"
    },
    {
      "key": "Cover Type",
      "value": "Stack"
    },
    {
      "key": "Material",
      "value": "Polyester"
    },
    {
      "key": "MFG Brand Name",
      "value": "Patio Armor"
    },
    {
      "key": "Outdoor Living Product Type",
      "value": "Patio Furniture Cover"
    },
    {
      "key": "Patio Furniture Features",
      "value": "No additional features"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "4.4"
    }
  ],
  "isDeleted": false
}