{
  "uid": 100923,
  "name": "Temple-Inland Ultra Stock MDF Panel - PrecisionCraft 4x8ft SmoothCut",
  "description": "Temple-inland ultra stock MDF is valued for its defect-free composition and highly uniform density that allow it to cut, rout, shape and drill cleanly, holding intricate detail with a minimum of waste and tool wear. Panel for panel, it\u0027s hard to beat for material efficiency, machining performance and productivity. Ultra stock MDF also finishes beautifully and consistently. Its flat, smooth surface delivers exceptional results whether laminated, direct printed or painted. Sanded with a range of available grits, it performs well even with very thin overlays and dark paint colors. Dimensional stability is another important benefit. That means swelling and thickness variations are virtually eliminated when using this product. The precision craftsmen machine into their component parts during production will be maintained in the assembled product they produce. Fasteners will draw tight and end users will enjoy the accurate fit and clean appearance.California residents: see\u0026nbsp;Proposition 65 informationCuts and routs cleanlyDecorative edge profiles and intricate contours deep in the core are also easily producedUltra stock premium can be painted, printed, stained, veneered or laminated with excellent resultsMachined edges are smooth and perform equally well for either wet or dry film edge finishing",
  "attributes": [
    {
      "key": "Actual product thickness (in.)",
      "value": ".75"
    },
    {
      "key": "Actual product width (in.)",
      "value": "48"
    },
    {
      "key": "MFG Brand Name",
      "value": "Unbranded"
    },
    {
      "key": "Plywood Type",
      "value": "Particle Board/MDF"
    },
    {
      "key": "Pressure Treated",
      "value": "No"
    },
    {
      "key": "Product Depth (in.)",
      "value": "0.75"
    },
    {
      "key": "Product Height (in.)",
      "value": "97"
    },
    {
      "key": "Product Length (ft.)",
      "value": "8"
    },
    {
      "key": "Product Thickness (in.)",
      "value": ".5 in"
    },
    {
      "key": "Product Thickness x Width x Length",
      "value": ".5 in. x 4 ft. x 8 ft."
    },
    {
      "key": "Product Width (ft.)",
      "value": "4"
    },
    {
      "key": "Product Width (in.)",
      "value": "49"
    },
    {
      "key": "Stainable/Paintable",
      "value": "Stainable \u0026 Paintable"
    },
    {
      "key": "Tounge and Groove",
      "value": "No"
    }
  ],
  "isDeleted": false
}