{
  "uid": 100998,
  "name": "Mighty Mule Slide Gate Opener with Access Package and Sensor",
  "description": "The Mighty Mule MM-LPS13-S Contractor Series Slide driveway Gate Opener Kit is designed for residential single slide gates. As a Home Depot Exclusive the Access Package includes 1 additional Single Button Remote (FM135), Wired or Wireless Digital Keypad (FM137), Digital Keypad Mounting Post (FM100) and 75ft. Driveway Vehicle Exit Sensor (FM138-75)! The operator is designed for gate panels weighing up to 650 lbs. and 24 ft. in length. This compact slide driveway gate opener is designed for all types of gates including: chain link, tube, panel, ornamental, wood, and vinyl. This dynamic operator can be mounted various ways including concrete, mount post or existing mounting pad. Included is a standard safety feature, Internal Friction Brake Lock that locks the gate in the closed position for added safety and security.The package includes 1 additional single button access remote (FM135), wired or wireless digital keypad (FM137), digital keypad mounting post (FM100) and 75 ft. driveway vehicle exit sensor (FM138-75), also included, the standard MM-LPS13 Kit contents: Includes 1 single button access remote (FM135), AC transformer (RB570), 2 batteries (FM150), control box, all required hardware and a detailed installation manual with an interactive DVDSafety Photo Eyes (R4222) are recommended for safety of exiting the propertyIncludes a built-in internal friction brake lockFeatures a chain quick release for manual gate operation30% Residential Energy Efficient Property Tax Credit available, residential home owners can use this credit on a new operator system, accessories and installation with the purchase of a Mighty Mule solar panel; 10-Watt (FM123)Backed by an 18 month Mighty Mule warranty and technical support",
  "attributes": [
    {
      "key": "- The package includes 1 additional single button access remote (FM135), wired or wireless digital keypad (FM137), digital keypad mounting post (FM100) and 75 ft. driveway vehicle exit sensor (FM138-75), also included, the standard MM-LPS13 Kit contents",
      "value": "Includes 1 single button access remote (FM135), AC transformer (RB570), 2 batteries (FM150), control box, all required hardware and a detailed installation manual with an interactive DVD"
    },
    {
      "key": "Commercial/Residential Use",
      "value": "Residential"
    },
    {
      "key": "Fencing Product Type",
      "value": "Gate Opener Kit"
    },
    {
      "key": "Gate opening style",
      "value": "Sliding"
    },
    {
      "key": "Hardware Included",
      "value": "Yes"
    },
    {
      "key": "Lighting Included",
      "value": "No"
    },
    {
      "key": "Maximum gate size (ft.)",
      "value": "24"
    },
    {
      "key": "MFG Brand Name",
      "value": "Mighty Mule"
    },
    {
      "key": "Power Requirements",
      "value": "AC or Solar"
    },
    {
      "key": "Product Depth (in.)",
      "value": "12"
    },
    {
      "key": "Product Height (in.)",
      "value": "12.5"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "50"
    },
    {
      "key": "Product Width (in.)",
      "value": "10.5"
    },
    {
      "key": "Remote control included",
      "value": "Yes"
    },
    {
      "key": "Weight Capacity (lb.)",
      "value": "650"
    },
    {
      "key": "Wired or Wireless",
      "value": "Wireless"
    }
  ],
  "isDeleted": false
}