{
  "uid": 100919,
  "name": "GraceFlex Pro Waterproof Flashing Tape",
  "description": "Grace Vycor Pro flashing, with its unique film and non-asphaltic, butyl-modified adhesive, provides premium protection against water infiltration in critical details, such as windows and doors. The special adhesive formulation provides a wide application temperature range for year round versatility in any climate. When installed properly, Vycor Pro flashing tape reduces the risk of mold and rots development, and contributes to energy efficiency.California residents: see\u0026nbsp;Proposition 65 informationSuperior adhesion to substrate: Forms strong waterproof bond, protecting walls against mold, mildew and rotSeals around fasteners: Prevents water penetration to the substrateForm superior laps: Ensures strong laps even at seams in the flashingLimits air leakage around windows and doors: Contributes to energy efficiencyForms a water and air tight seal with building materialsHighly conformable and flexible: Can accommodate settlement and shrinkage movementRipcord and measurement markings: Enables fast and easy installationProven track record: Vycor Plus flashing employs the same proven technology as Grace ice and water shield - the leader in roofing underlayments for over 35 years",
  "attributes": [
    {
      "key": "- Superior adhesion to substrate",
      "value": "Forms strong waterproof bond, protecting walls against mold, mildew and rot"
    },
    {
      "key": "- Seals around fasteners",
      "value": "Prevents water penetration to the substrate"
    },
    {
      "key": "- Form superior laps",
      "value": "Ensures strong laps even at seams in the flashing"
    },
    {
      "key": "- Limits air leakage around windows and doors",
      "value": "Contributes to energy efficiency"
    },
    {
      "key": "- Highly conformable and flexible",
      "value": "Can accommodate settlement and shrinkage movement"
    },
    {
      "key": "- Ripcord and measurement markings",
      "value": "Enables fast and easy installation"
    },
    {
      "key": "- Proven track record",
      "value": "Vycor Plus flashing employs the same proven technology as Grace ice and water shield - the leader in roofing underlayments for over 35 years"
    },
    {
      "key": "Color Family",
      "value": "Black"
    },
    {
      "key": "Commercial / Residential",
      "value": "Commercial / Residential"
    },
    {
      "key": "Coverage Area (sq. ft.)",
      "value": "25"
    },
    {
      "key": "MFG Brand Name",
      "value": "Grace"
    },
    {
      "key": "Product Depth (in.)",
      "value": "0.04"
    },
    {
      "key": "Product Height (in.)",
      "value": "900"
    },
    {
      "key": "Product Width (in.)",
      "value": "4"
    },
    {
      "key": "Roofing Product Type",
      "value": "Underlayment"
    },
    {
      "key": "Texture",
      "value": "Smooth"
    },
    {
      "key": "Thickness (In.)",
      "value": ".04"
    },
    {
      "key": "Unrolled length (ft.)",
      "value": "75"
    }
  ],
  "isDeleted": false
}