{
  "uid": 100909,
  "name": "SummerHawk Ranch Coop-n-Run Combo with Expansion Option",
  "description": "Start Living, Sunny Side Up with this space-efficient coop-and-run combination. Its hand built from solid fir and is roomy enough to comfortably house up to 4 chickens. The roost features a uniquely styled roof, offering shade and shelter while beneath the coop, a galvanized mesh-enclosed run gives hens a secure space to forage and exercise. The dual-stall nesting box is accessible through a convenient, waist-height prop-up door for easy egg collection. The coop is simple to assemble, requiring only one person and a screwdriver. Additional run space may be provided by attaching one or more Universal expansion pens (sold separately), which is recommended for those who cannot free-range their birds during the day.Hand built from sustainably harvested, naturally weather and pest resistant firSized to comfortably house 4 hensSpacious interior features twin nest stalls, 2 roosting bars and adjustable ventilationWaist-height nest box features a stylish, hinged roof and removable divider - no need to bend or crouchRemovable, metal sliding tray allows for easy cleaning accessBest-in-class mesh-enclosed run area features chicken ramp for access to roostHeavy, galvanized wire is secured using our unique, extra strength, wire-clamping wood design4 doors for convenient access to all areas of the coopAll doors feature spring-bolt latches to keep hens safe from predatorsSimple enough for 1 person to assemble in as little as 30 minutes with a screwdriverExpandable with SummerHawk Ranch universal expansion pen (sold separately)Assembled exterior dimensions: 74 in. L x 30 in. W x 50 in. H",
  "attributes": [
    {
      "key": "Assembled Depth (in.)",
      "value": "74 in"
    },
    {
      "key": "Assembled Height (in.)",
      "value": "50 in"
    },
    {
      "key": "Assembled Width (in.)",
      "value": "30 in"
    },
    {
      "key": "- Assembled exterior dimensions",
      "value": "74 in. L x 30 in. W x 50 in. H"
    },
    {
      "key": "Livestock Supplies Product type",
      "value": "Equipment"
    },
    {
      "key": "MFG Brand Name",
      "value": "SummerHawk Ranch"
    },
    {
      "key": "Product Depth (in.)",
      "value": "38.58"
    },
    {
      "key": "Product Height (in.)",
      "value": "10.83"
    },
    {
      "key": "Product Width (in.)",
      "value": "36.42"
    }
  ],
  "isDeleted": false
}