{
  "uid": 100953,
  "name": "Surebonder Heavy Duty Industrial Pneumatic Glue Gun Kit",
  "description": "Industrial Pneumatic Heavy Duty Adjustable Temperature Glue Gun. This glue gun is perfect for heavy duty operations. The gun uses 450-watts of heating power. Pneumatically controlled pistons feed the glue stick when the trigger is squeezed. The higher the wattage the faster the glue melts for increased production. Uses 5/8 in. (.625 in.) diameter, 10 in. length glue sticks. Standard features include lighted on/off switch, temperature control screwdriver, air regulator, 8 ft. air hose with quick connector and storage case. You\u0027ll be in awe with the enhanced performance and precision you will get from this gun. (Air compressor not included).California residents: see\u0026nbsp;Proposition 65 informationGun is lightweight, has a durable body and an integrated gun balancer mount hole for quick and easy accessibilityUnique effort saving trigger and rubber grip handle for comfortable long operationStroke adjuster allows user to preset the amount of glue outputTemperature adjustment feature with screwdriver and storageGlue temperature ranges from 284 to 400Comes with air regulator, filter, quick coupler and electric cordGun and accessories come in a high impact carrying caseUses 5/8 in. diameter 10 in. glue sticksRequired air pressure 30-80 pieceAir consumption 1 CFM 50-piece100-120-Volt AC, 50 Hz - 60 HzMulti temperature glue gunAir compressor needed - not included",
  "attributes": [
    {
      "key": "Adhesive Product Type",
      "value": "Glue Gun"
    },
    {
      "key": "Built-in drip pan",
      "value": "No"
    },
    {
      "key": "Built-in stand",
      "value": "Yes"
    },
    {
      "key": "Certifications and Listings",
      "value": "No Certifications or Listings"
    },
    {
      "key": "Check valve",
      "value": "Yes"
    },
    {
      "key": "Feed style",
      "value": "Trigger"
    },
    {
      "key": "Glue stick diameter capacity (in.)",
      "value": ".625"
    },
    {
      "key": "Heater Power Rating",
      "value": "450 W"
    },
    {
      "key": "Indoor/Outdoor",
      "value": "Indoor"
    },
    {
      "key": "MFG Brand Name",
      "value": "Surebonder"
    },
    {
      "key": "Nondrip nozzle",
      "value": "Yes"
    },
    {
      "key": "Product Depth (in.)",
      "value": "4"
    },
    {
      "key": "Product Height (in.)",
      "value": "10"
    },
    {
      "key": "Product Weight (oz.)",
      "value": "8.95 oz"
    },
    {
      "key": "Product Width (in.)",
      "value": "11"
    }
  ],
  "isDeleted": false
}