{
  "uid": 100944,
  "name": "Frigidaire Over-The-Range Stainless Steel Microwave with Auto-Reheat",
  "description": "This extra-large and sleek Frigidaire 1.6 cu. ft. Over-the-Range Stainless Steel Microwave oven features Auto-Reheat and One-Touch options so you can warm up any meal with a single touch. The Fits-More capacity allows it to hold almost any dish. The ventilation with Auto-Start Heat Sensor Fan features includes two fan speeds that move up to 300 cu. ft. of air per minute and removable dishwasher-safe filters.1.6 cu. ft. Extra-Large capacity microwave provides ample cooking space and will hold almost any dish - even a 13 in. x 9 in. baking dish1,000 Watts of cooking power and 10 power levelsThe built in 2-Speed 170/300 CFM ventilating system doubles as a convertible hood to remove smoke, steam and odorsReady-Select Controls allow you to easily select options with the touch of a buttonMicrowaves feature easy-to-use one-touch buttons so you can cook baked potatoes, popcorn or even add 30 seconds with the touch of a buttonMulti-Stage Cooking option allows you to program power levels and cooking times in advance, so you can program the microwave all at once to defrost, cook and keep a meal warmExtra-Large 13-1/2 Diameter Glass TurntableInterior light illuminates the contents of the microwave for increased visibilityTwo Speed Ventilation Over-The-Range microwave doubles as a hood with Auto-start Heat SensorDishwasher-Safe vent filter and charcoal vent filters (ductless, recirculating Installation) remove grease and impurities from the airStainless Steel Exterior with Ready Select Electronic Touch Controls with digital clock and countdown timer. 36 Filler Panel Kit (Stainless) 36 panel kit Optional, order item no. MWFILKTSSLimited One-Year Warranty nationwideClick Here for details on the services included with Delivery \u0026 Basic Hook-up and Installation options for Major Appliances",
  "attributes": [
    {
      "key": "Appliance Type",
      "value": "Over the Range Microwave"
    },
    {
      "key": "Capacity of Microwave (cu. ft.)",
      "value": "1.6"
    },
    {
      "key": "Certifications and Listings",
      "value": "1-UL Listed,ANSI Certified"
    },
    {
      "key": "Color/Finish",
      "value": "Stainless Steel"
    },
    {
      "key": "Color/Finish Family",
      "value": "Stainless"
    },
    {
      "key": "Cut-Out Front to Back Width (in.)",
      "value": "14 in"
    },
    {
      "key": "Cut-Out Height (in.)",
      "value": "17 in"
    },
    {
      "key": "Cut-Out Left to Right Length (in.)",
      "value": "30 in"
    },
    {
      "key": "Door Swing/Style",
      "value": "Right to Left Swing"
    },
    {
      "key": "Exhaust Fan Speeds",
      "value": "2"
    },
    {
      "key": "Exhaust Maximum CFM",
      "value": "300"
    },
    {
      "key": "MFG Brand Name",
      "value": "Frigidaire"
    },
    {
      "key": "Microwave Door Release",
      "value": "Pull"
    },
    {
      "key": "Microwave Features",
      "value": "Charcoal Filter,Clock,Cooking Light,Interior Light,Nightlight,Removable Filter,Timer,Turntable"
    },
    {
      "key": "Microwave Size",
      "value": "30 in."
    },
    {
      "key": "Number of One-Touch Settings",
      "value": "13"
    },
    {
      "key": "Number of Power Levels",
      "value": "9"
    },
    {
      "key": "Oven Settings",
      "value": "Defrost"
    },
    {
      "key": "Product Depth (in.)",
      "value": "15.031"
    },
    {
      "key": "Product Height (in.)",
      "value": "16.406"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "63.93"
    },
    {
      "key": "Product Width (in.)",
      "value": "29.875"
    },
    {
      "key": "Safety Listing",
      "value": "UL"
    },
    {
      "key": "Sensor Cook",
      "value": "No"
    },
    {
      "key": "Turntable",
      "value": "Yes"
    },
    {
      "key": "Turntable Diameter",
      "value": "13.593 in"
    },
    {
      "key": "Vent Type",
      "value": "Convertible"
    },
    {
      "key": "Wattage (watts)",
      "value": "1000"
    }
  ],
  "isDeleted": false
}