{
  "uid": 100981,
  "name": "PULSE Showerspas Bonzai 8 in. Rain Shower System",
  "description": "Packed with features the Bonzai shower system will perform to perfection. The 8 in. rain showerhead easily pivots side to side on an elegantly arched shower arm. Three relaxing body jets with pulsating spray can be angled to hit just the right spots. A five function handshower completes the bundle by offering an array of patterns to sooth your body. Installation is a breeze. Invigoration is assured. Designed to install in virtually any shower without remodeling, a typical install is less than 1 hour-even for the do it yourselfer. It simply connects to water supply at your existing showerhead location and uses your existing hot/cold shower valve.Surface mounted and completely pre-plumbed, easily retrofit your existing shower without a remodelSilver anodized aluminum body with chrome fixturesRub tips clean with spray straight technology8 in. rain showerhead with soft tips to clear mineral buildup for long lasting performanceElegantly arched shower arm pivots side to side5-function handshower with 59 in. non-marring hose3 pulsating body jets provide a soothing spray with adjustable positioningBrass diverter easily switches functions-place between functions for further enjoymentConvenient glass shelf for shower productsSimply replaces your existing showerhead/shower armBackflow protection in the handshower hose1/2 in. NPT brass nipple connector2.5 GPM/9.5 LPM shower system",
  "attributes": [
    {
      "key": "Assembled Depth (in.)",
      "value": "21 in"
    },
    {
      "key": "Assembled Height (in.)",
      "value": "50.5 in"
    },
    {
      "key": "Assembled Width (in.)",
      "value": "8 in"
    },
    {
      "key": "Bath Faucet Type",
      "value": "Showerhead"
    },
    {
      "key": "Certifications and Listings",
      "value": "No Certifications or Listings"
    },
    {
      "key": "Color Family",
      "value": "Chrome"
    },
    {
      "key": "Color/Finish",
      "value": "Chrome"
    },
    {
      "key": "Connection size (in.)",
      "value": "1/2 In."
    },
    {
      "key": "Faucet Features",
      "value": "No Additional Features"
    },
    {
      "key": "Faucet Included Components",
      "value": "No Additional Items"
    },
    {
      "key": "Faucet type",
      "value": "Bath Faucet"
    },
    {
      "key": "Flow rate (gallons per minute)",
      "value": "2.5"
    },
    {
      "key": "Hose length (in.)",
      "value": "59"
    },
    {
      "key": "MFG Brand Name",
      "value": "PULSE Showerspas"
    },
    {
      "key": "Number of Spray Settings",
      "value": "7"
    },
    {
      "key": "Showerhead face diameter (in.)",
      "value": "8"
    },
    {
      "key": "Spray Pattern",
      "value": "Rain"
    },
    {
      "key": "Vacuum breaker included",
      "value": "No"
    }
  ],
  "isDeleted": false
}