{
  "uid": 100954,
  "name": "Englander Multi-Fuel Stove with Auto-Start Igniter and Blower",
  "description": "This impressive Englander Multi-Fuel Stove offers an array of heating options by burning corn, cherry pits, wood pellets and more, making it a versatile alternative fuel burner. The realistic brick-patterned fiberboard in the firebox and decorative cast door provide a certain classic charm, combined with the modern convenience of a user-friendly control panel pre-programmed for different fuels. With a large ash drawer for clean-out, this stove also features the unique, multi-fuel auto-start igniter to light the toughest fuels, including corn. The unit has been designed and tested to heat up to 2200 sq. ft., with a 50 lb. hopper feeding the large firebox. For the required outside air hook-up, an outside air kit is also included for convenience, valued at over $60.Steel construction offers long-lasting durabilityHopper capacity of 50 lbs. wood pellets or 60 lbs. corn; also burns cherry pits and more for versatile fuel optionsHeats up to 2200 sq. ft. for a comfortable living space1-touch auto-start igniter is simple and safe for lighting the toughest of fuels; unit is also thermostat adaptable for automatic startup and shutdown (thermostat not included)User-friendly control board is pre-programmed for different fuelsBuilt-in variable speed blower system for optimal operationElegant design with decorative side panel inserts for an elegant touch (lip trim is also available)3 in. pellet vent rear exhaust uses corn or multi-fuel pipe (see owner\u0027s manual)Beautiful cast door with straight lift door latch and extra large glass for easy accessAdaptable for use in a mobile homeRealistic brick fiberboard in firebox offers an authentic lookEPA certified for wood pelletsLimited warranty of 5 years for firebox and 1 year for electrical componentsOutside air kit included (over $60 value)",
  "attributes": [
    {
      "key": "Area Heated (Sq. Ft.)",
      "value": "2200"
    },
    {
      "key": "Assembled Depth (in.)",
      "value": "31.75 in"
    },
    {
      "key": "Assembled Height (in.)",
      "value": "30.625 in"
    },
    {
      "key": "Assembled Width (in.)",
      "value": "27.625 in"
    },
    {
      "key": "Assembly Required",
      "value": "Yes"
    },
    {
      "key": "Certifications and Listings",
      "value": "1-UL Listed"
    },
    {
      "key": "Features",
      "value": "Damper,Pedestal Base,Rear heat shield,Side heat shield"
    },
    {
      "key": "Firebox depth (in.)",
      "value": "6.875"
    },
    {
      "key": "Firebox height (in.)",
      "value": "17.625"
    },
    {
      "key": "Firebox width (in.)",
      "value": "17.875"
    },
    {
      "key": "Fuel type",
      "value": "Pellet"
    },
    {
      "key": "Hopper capacity (lb.)",
      "value": "50"
    },
    {
      "key": "Material",
      "value": "Steel"
    },
    {
      "key": "MFG Brand Name",
      "value": "Englander"
    },
    {
      "key": "Mount type",
      "value": "Freestanding"
    },
    {
      "key": "Product Depth (in.)",
      "value": "31.75"
    },
    {
      "key": "Product Height (in.)",
      "value": "30.625"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "355"
    },
    {
      "key": "Product Width (in.)",
      "value": "27.625"
    },
    {
      "key": "Vent diameter (in.)",
      "value": "3"
    },
    {
      "key": "Vented or Vent-Free",
      "value": "Vented"
    }
  ],
  "isDeleted": false
}