{
  "uid": 100947,
  "name": "Martha Stewart Living DuPont Corian Bedford Marble Countertop - Beveled Edge",
  "description": "DuPont Corian countertops are the smart choice in solid surfaces. They offer endless benefits at an affordable price. With Seamless design, they can offer a smooth look without worry of grout lines or bacteria growth.Flexible options: Use in horizontal and vertical applications; cut, mold, rout or carve to suit your design needsStain-resistant: Non-porous and stain-resistant for easy cleaning and minimal maintenanceEasy to renew: Renewable to like-new appearance, repairable to remove scratches and marksEasy to clean: With proper cleaning, resists the growth of bacteria, mold and mildew15 year limited warranty backed by DuPontStart your kitchen design today with our Kitchen PlannerGet a free quote with our Countertop Estimator",
  "attributes": [
    {
      "key": "Antimicrobial",
      "value": "No"
    },
    {
      "key": "- Flexible options",
      "value": "Use in horizontal and vertical applications; cut, mold, rout or carve to suit your design needs"
    },
    {
      "key": "- Stain-resistant",
      "value": "Non-porous and stain-resistant for easy cleaning and minimal maintenance"
    },
    {
      "key": "- Easy to renew",
      "value": "Renewable to like-new appearance, repairable to remove scratches and marks"
    },
    {
      "key": "- Easy to clean",
      "value": "With proper cleaning, resists the growth of bacteria, mold and mildew"
    },
    {
      "key": "Color Family",
      "value": "Gray"
    },
    {
      "key": "Color Group",
      "value": "D - $$$$"
    },
    {
      "key": "Color/Finish",
      "value": "Bedford Marble"
    },
    {
      "key": "Edge Type",
      "value": "Beveled"
    },
    {
      "key": "High Temperature Resistance",
      "value": "Yes"
    },
    {
      "key": "Kitchen Product Type",
      "value": "Countertop Sample"
    },
    {
      "key": "Material",
      "value": "Solid Surface"
    },
    {
      "key": "MFG Brand Name",
      "value": "Martha Stewart Living"
    },
    {
      "key": "Product Depth (in.)",
      "value": "0.5"
    },
    {
      "key": "Product Height (in.)",
      "value": "2"
    },
    {
      "key": "Product Length (in.)",
      "value": "2 in"
    },
    {
      "key": "Product Thickness (in.)",
      "value": ".5 in"
    },
    {
      "key": "Product Width (in.)",
      "value": "2 in"
    },
    {
      "key": "Scratch Resistant",
      "value": "Yes"
    },
    {
      "key": "Stain Resistant",
      "value": "Yes"
    }
  ],
  "isDeleted": false
}