{
  "uid": 100918,
  "name": "Milliken Millwork Classic Steel Door with Clear Glass Collection",
  "description": "Milliken Millwork Builder\u0027s Choice Steel Front Doors are built to last and can add substantial curb appeal to your home. This Builder\u0027s Choice Steel front door unit comes with our MSystem2 Warranty on both the Door Component and the Base Prehung System as well as a 10 year Warranty on the Glass Lite. Each Milliken Millwork Builder\u0027s Choice Steel door comes with a one-piece, high density polystyrene core delivering excellent insulation allowing it to meet or exceed current energy code standards. Our Prehung door unit (called the MSystem) seals out the weather and practically eliminates air and water infiltration all together. Paired gracefully with the smooth, primed white finish of the door, the Classic Clear Glass Collection helps bring the overall experience of the entire door unit together. This 32 in. x 80 in. Builder\u0027s Choice Steel front door unit with Classic Clear Glass offers the strength and durability found in Builder\u0027s Choice Steel, with the added beauty of insulated glass, making it a wonderful addition to any home for an ultra-competitive price. Milliken Millwork Builder\u0027s Choice Steel Doors will give you both peace of mind when purchasing and confidence after installation, knowing the timeless beauty of your Milliken Millwork Builder\u0027s Choice Steel Door will last.25-Gauge steel and LVL stiles that resists warping and corrosionCompression weather-strip and a composite, adjustable sill includedFrame width is 4-9/16 in. and this door unit is a right-hand inswing3 hinges with Satin Nickel finish and Med. Pet Door (8-1/4\u0022 X 12-1/4\u0022 Flap Opening \u0026 1-40lb weight limit)Door component is pre-drilled for 2-1/8 in. entry and deadbolt locks (locks sold separately)Will meet or exceed federal guidelines for energy efficiency (where and if applicable)Classic clear glass is insulated and carries a privacy rating of 0 out of 10Standard MSystem2 warranty is a 2 year limited warranty on the door component and the base prehung system as well as a 10 year warranty on the glassNot designed for commercial use",
  "attributes": [
    {
      "key": "Assembled Depth (in.)",
      "value": "4.563 in"
    },
    {
      "key": "Assembled Height (in.)",
      "value": "80 in"
    },
    {
      "key": "Assembled Width (in.)",
      "value": "32 in"
    },
    {
      "key": "Color Family",
      "value": "White"
    },
    {
      "key": "Color/Finish",
      "value": "Primed White"
    },
    {
      "key": "Door Configuration",
      "value": "Single Door"
    },
    {
      "key": "Door Handing",
      "value": "Right-Hand/Inswing"
    },
    {
      "key": "Door Size (WxH) in.",
      "value": "32 x 80"
    },
    {
      "key": "Door Style",
      "value": "Classic"
    },
    {
      "key": "Door Thickness (in.)",
      "value": "1.75"
    },
    {
      "key": "Door Type",
      "value": "Exterior Prehung"
    },
    {
      "key": "Energy Star Qualified",
      "value": "North-Central"
    },
    {
      "key": "Features",
      "value": "Brickmould,Lockset Bore,Weatherstripping"
    },
    {
      "key": "Finish Type",
      "value": "Primed"
    },
    {
      "key": "Fire rating",
      "value": "nan"
    },
    {
      "key": "Glass Caming Finish",
      "value": "No caming"
    },
    {
      "key": "Glass Style",
      "value": "Clear"
    },
    {
      "key": "Glass Type",
      "value": "9 Lite"
    },
    {
      "key": "Hinge Finish",
      "value": "Nickel"
    },
    {
      "key": "Included",
      "value": "No additional items or accessories included"
    },
    {
      "key": "Jamb Size (in.)",
      "value": "4-9/16\u0022"
    },
    {
      "key": "Material",
      "value": "Steel"
    },
    {
      "key": "MFG Brand Name",
      "value": "Milliken Millwork"
    },
    {
      "key": "Number of Hinges",
      "value": "3"
    },
    {
      "key": "Panel Type",
      "value": "No panel"
    },
    {
      "key": "Product Weight (lb.)",
      "value": "88.5"
    },
    {
      "key": "Rough Opening Height",
      "value": "82.25"
    },
    {
      "key": "Rough Opening Width",
      "value": "34"
    }
  ],
  "isDeleted": false
}